[NoCoverage] BooleanLiteral
components/AcuteCareView.tsx:28:42
 export const AcuteCareView: React.FC<AcuteCareViewProps> = ({ isEditMode }) => {
   const [searchQuery, setSearchQuery] = useState('');
   const [items, setItems] = useState<AcuteManagementItem[]>(INITIAL_ACUTE);
-  const [isDirty, setIsDirty] = useState(false);
+  const [isDirty, setIsDirty] = useState(true);
   const [enlargedImage, setEnlargedImage] = useState<{ src: string; alt: string } | null>(null);
 

[NoCoverage] StringLiteral
components/AcuteCareView.tsx:32:5
   const [enlargedImage, setEnlargedImage] = useState<{ src: string; alt: string } | null>(null);
 
   const { results: filteredAcute, didYouMean } = useClinicalSearch(items, searchQuery, [
-    'presentation'
+    ""
   ]);
 

[NoCoverage] BlockStatement
components/AcuteCareView.tsx:35:90
     'presentation'
   ]);
 
-  const updateItem = (index: number, field: keyof AcuteManagementItem, value: string) => {
-    const newItems = [...items];
-    newItems[index] = { ...newItems[index], [field]: value };
-    setItems(newItems);
-    setIsDirty(true);
-  };
+  const updateItem = (index: number, field: keyof AcuteManagementItem, value: string) => {};
 
   const addItem = () => {

[NoCoverage] ObjectLiteral
components/AcuteCareView.tsx:37:23
 
   const updateItem = (index: number, field: keyof AcuteManagementItem, value: string) => {
     const newItems = [...items];
-    newItems[index] = { ...newItems[index], [field]: value };
+    newItems[index] = {};
     setItems(newItems);
     setIsDirty(true);

[NoCoverage] BooleanLiteral
components/AcuteCareView.tsx:39:16
     const newItems = [...items];
     newItems[index] = { ...newItems[index], [field]: value };
     setItems(newItems);
-    setIsDirty(true);
+    setIsDirty(false);
   };
 

[NoCoverage] BlockStatement
components/AcuteCareView.tsx:42:25
     setIsDirty(true);
   };
 
-  const addItem = () => {
-    setItems([
-      ...items,
-      { presentation: 'New Presentation', management: '', adjuncts: '', imaging: '' }
-    ]);
-    setIsDirty(true);
-  };
+  const addItem = () => {};
 
   const removeItem = (index: number) => {

[NoCoverage] BooleanLiteral
components/AcuteCareView.tsx:47:16
       ...items,
       { presentation: 'New Presentation', management: '', adjuncts: '', imaging: '' }
     ]);
-    setIsDirty(true);
+    setIsDirty(false);
   };
 

[NoCoverage] BlockStatement
components/AcuteCareView.tsx:50:41
     setIsDirty(true);
   };
 
-  const removeItem = (index: number) => {
-    setItems(items.filter((_, i) => i !== index));
-    setIsDirty(true);
-  };
+  const removeItem = (index: number) => {};
 
   const handleSave = () => {

[NoCoverage] MethodExpression
components/AcuteCareView.tsx:51:14
   };
 
   const removeItem = (index: number) => {
-    setItems(items.filter((_, i) => i !== index));
+    setItems(items);
     setIsDirty(true);
   };

[NoCoverage] ArrowFunction
components/AcuteCareView.tsx:51:27
   };
 
   const removeItem = (index: number) => {
-    setItems(items.filter((_, i) => i !== index));
+    setItems(items.filter(() => undefined));
     setIsDirty(true);
   };

[NoCoverage] BooleanLiteral
components/AcuteCareView.tsx:52:16
 
   const removeItem = (index: number) => {
     setItems(items.filter((_, i) => i !== index));
-    setIsDirty(true);
+    setIsDirty(false);
   };
 

[NoCoverage] BlockStatement
components/AcuteCareView.tsx:55:28
     setIsDirty(true);
   };
 
-  const handleSave = () => {
-    // In a real app, we'd save to storage/API
-    setIsDirty(false);
-    alert('Changes saved locally for this session.');
-  };
+  const handleSave = () => {};
 
   return (

[NoCoverage] BooleanLiteral
components/AcuteCareView.tsx:57:16
 
   const handleSave = () => {
     // In a real app, we'd save to storage/API
-    setIsDirty(false);
+    setIsDirty(true);
     alert('Changes saved locally for this session.');
   };

[NoCoverage] StringLiteral
components/AcuteCareView.tsx:58:11
   const handleSave = () => {
     // In a real app, we'd save to storage/API
     setIsDirty(false);
-    alert('Changes saved locally for this session.');
+    alert("");
   };
 

[NoCoverage] BooleanLiteral
components/AcuteCareView.tsx:87:25
             </button>
             <button
               onClick={handleSave}
-              disabled={!isDirty}
+              disabled={isDirty}
             >

[NoCoverage] ConditionalExpression
components/AcuteCareView.tsx:110:8
         />
       </div>
 
-      {didYouMean && (
-        <div className="max-w-4xl mx-auto mb-8 flex justify-center">
-          <button
-            onClick={() => setSearchQuery(didYouMean)}
-            className="flex items-center gap-2 px-6 py-3 bg-rose-950/40 hover:bg-rose-900/40 text-rose-450 border border-rose-500/20 rounded-2xl transition-all shadow-sm cursor-pointer"
-          >
-            <span className="text-xs font-black uppercase tracking-widest text-rose-400">
-              Did you mean
-            </span>
-            <span className="text-sm font-bold border-b border-rose-600 border-dashed">
-              {didYouMean}
-            </span>
-            <span className="text-xs font-black uppercase tracking-widest text-rose-400">?</span>
-          </button>
-        </div>
-      )}
+      {false}
 
       <div className="grid grid-cols-1 gap-8">

[NoCoverage] ConditionalExpression
components/AcuteCareView.tsx:110:8
         />
       </div>
 
-      {didYouMean && (
-        <div className="max-w-4xl mx-auto mb-8 flex justify-center">
-          <button
-            onClick={() => setSearchQuery(didYouMean)}
-            className="flex items-center gap-2 px-6 py-3 bg-rose-950/40 hover:bg-rose-900/40 text-rose-450 border border-rose-500/20 rounded-2xl transition-all shadow-sm cursor-pointer"
-          >
-            <span className="text-xs font-black uppercase tracking-widest text-rose-400">
-              Did you mean
-            </span>
-            <span className="text-sm font-bold border-b border-rose-600 border-dashed">
-              {didYouMean}
-            </span>
-            <span className="text-xs font-black uppercase tracking-widest text-rose-400">?</span>
-          </button>
-        </div>
-      )}
+      {true}
 
       <div className="grid grid-cols-1 gap-8">

[NoCoverage] ArrowFunction
components/AcuteCareView.tsx:113:22
       {didYouMean && (
         <div className="max-w-4xl mx-auto mb-8 flex justify-center">
           <button
-            onClick={() => setSearchQuery(didYouMean)}
+            onClick={() => undefined}
             className="flex items-center gap-2 px-6 py-3 bg-rose-950/40 hover:bg-rose-900/40 text-rose-450 border border-rose-500/20 rounded-2xl transition-all shadow-sm cursor-pointer"
           >

[NoCoverage] ObjectLiteral
components/AcuteCareView.tsx:131:22
         {filteredAcute.map((item, idx) => (
           <motion.div
             key={idx}
-            initial={{ opacity: 0, y: 20 }}
+            initial={{}}
             animate={{ opacity: 1, y: 0 }}
             transition={{ delay: idx * 0.1 }}

[NoCoverage] ObjectLiteral
components/AcuteCareView.tsx:132:22
           <motion.div
             key={idx}
             initial={{ opacity: 0, y: 20 }}
-            animate={{ opacity: 1, y: 0 }}
+            animate={{}}
             transition={{ delay: idx * 0.1 }}
             className="relative group"

[NoCoverage] ArithmeticOperator
components/AcuteCareView.tsx:133:34
             key={idx}
             initial={{ opacity: 0, y: 20 }}
             animate={{ opacity: 1, y: 0 }}
-            transition={{ delay: idx * 0.1 }}
+            transition={{ delay: idx / 0.1 }}
             className="relative group"
           >

[NoCoverage] ObjectLiteral
components/AcuteCareView.tsx:133:25
             key={idx}
             initial={{ opacity: 0, y: 20 }}
             animate={{ opacity: 1, y: 0 }}
-            transition={{ delay: idx * 0.1 }}
+            transition={{}}
             className="relative group"
           >

[NoCoverage] ArrowFunction
components/AcuteCareView.tsx:138:26
           >
             {isEditMode && (
               <button
-                onClick={() => removeItem(idx)}
+                onClick={() => undefined}
               >

[NoCoverage] ArrowFunction
components/AcuteCareView.tsx:151:31
                   <Zap className="w-6 h-6 text-rose-500" />
                   <input
                     value={item.presentation}
-                    onChange={(e) => updateItem(idx, 'presentation', e.target.value)}
+                    onChange={() => undefined}
                     className="flex-1 bg-transparent text-2xl font-black text-white outline-none focus:text-rose-450"
                     placeholder="Presentation Name"

[NoCoverage] ArrowFunction
components/AcuteCareView.tsx:166:33
                     </div>
                     <textarea
                       value={item.management}
-                      onChange={(e) => updateItem(idx, 'management', e.target.value)}
+                      onChange={() => undefined}
                       className="w-full bg-slate-950 border border-white/5 rounded-xl p-3 text-xs font-bold text-slate-200 outline-none focus:border-rose-500/50 min-h-[100px]"
                     />

[NoCoverage] ArrowFunction
components/AcuteCareView.tsx:179:33
                     </div>
                     <textarea
                       value={item.adjuncts}
-                      onChange={(e) => updateItem(idx, 'adjuncts', e.target.value)}
+                      onChange={() => undefined}
                       className="w-full bg-slate-950 border border-white/5 rounded-xl p-3 text-xs font-bold text-slate-200 outline-none focus:border-rose-500/50 min-h-[100px]"
                     />

[NoCoverage] ArrowFunction
components/AcuteCareView.tsx:192:33
                     </div>
                     <textarea
                       value={item.imaging}
-                      onChange={(e) => updateItem(idx, 'imaging', e.target.value)}
+                      onChange={() => undefined}
                       className="w-full bg-slate-950 border border-white/5 rounded-xl p-3 text-xs font-bold text-slate-200 outline-none focus:border-rose-500/50 min-h-[100px]"
                     />

[NoCoverage] BooleanLiteral
components/AcuteCareView.tsx:203:23
                   </p>
                   <MedImage
                     src={
-                      !item.localImageUrl
+                      item.localImageUrl
                         ? item.imageUrl || '/assets/placeholders/clinical-presentation.svg'
                         : undefined

[NoCoverage] ConditionalExpression
components/AcuteCareView.tsx:204:27
                   <MedImage
                     src={
                       !item.localImageUrl
-                        ? item.imageUrl || '/assets/placeholders/clinical-presentation.svg'
+                        ? true
                         : undefined
                     }

[NoCoverage] ConditionalExpression
components/AcuteCareView.tsx:204:27
                   <MedImage
                     src={
                       !item.localImageUrl
-                        ? item.imageUrl || '/assets/placeholders/clinical-presentation.svg'
+                        ? false
                         : undefined
                     }

[NoCoverage] ArrowFunction
components/AcuteCareView.tsx:212:32
                     label="Clinical Visual"
                     fallbackIcon={<Zap />}
                     isEditMode={isEditMode}
-                    onEnlarge={(src, alt) => setEnlargedImage({ src, alt })}
+                    onEnlarge={() => undefined}
                     config={{ size: 'md', position: 'right' }}
                     onDelete={() => {

[NoCoverage] BlockStatement
components/AcuteCareView.tsx:214:37
                     isEditMode={isEditMode}
                     onEnlarge={(src, alt) => setEnlargedImage({ src, alt })}
                     config={{ size: 'md', position: 'right' }}
-                    onDelete={() => {
-                      updateItem(idx, 'localImageUrl', undefined);
-                      updateItem(idx, 'imageUrl', undefined);
-                    }}
+                    onDelete={() => {}}
                     onUpload={() => {
                       const input = document.createElement('input');

[NoCoverage] BlockStatement
components/AcuteCareView.tsx:218:37
                       updateItem(idx, 'localImageUrl', undefined);
                       updateItem(idx, 'imageUrl', undefined);
                     }}
-                    onUpload={() => {
-                      const input = document.createElement('input');
-                      input.type = 'file';
-                      input.accept = 'image/*';
-                      input.onchange = async (e: any) => {
-                        const file = e.target.files?.[0];
-                        if (!file) return;
-                        const assetId = `acute_${Math.random().toString(36).substr(2, 9)}`;
-                        const url = await storage.saveAsset(assetId, file);
-                        updateItem(idx, 'localImageUrl', url);
-                      };
-                      input.click();
-                    }}
+                    onUpload={() => {}}
                   />
                 </div>

[NoCoverage] StringLiteral
components/AcuteCareView.tsx:221:38
                     onUpload={() => {
                       const input = document.createElement('input');
                       input.type = 'file';
-                      input.accept = 'image/*';
+                      input.accept = "";
                       input.onchange = async (e: any) => {
                         const file = e.target.files?.[0];

[NoCoverage] BlockStatement
components/AcuteCareView.tsx:222:58
                       const input = document.createElement('input');
                       input.type = 'file';
                       input.accept = 'image/*';
-                      input.onchange = async (e: any) => {
-                        const file = e.target.files?.[0];
-                        if (!file) return;
-                        const assetId = `acute_${Math.random().toString(36).substr(2, 9)}`;
-                        const url = await storage.saveAsset(assetId, file);
-                        updateItem(idx, 'localImageUrl', url);
-                      };
+                      input.onchange = async (e: any) => {};
                       input.click();
                     }}

[NoCoverage] OptionalChaining
components/AcuteCareView.tsx:223:38
                       input.type = 'file';
                       input.accept = 'image/*';
                       input.onchange = async (e: any) => {
-                        const file = e.target.files?.[0];
+                        const file = e.target.files[0];
                         if (!file) return;
                         const assetId = `acute_${Math.random().toString(36).substr(2, 9)}`;

[NoCoverage] ConditionalExpression
components/AcuteCareView.tsx:224:29
                       input.accept = 'image/*';
                       input.onchange = async (e: any) => {
                         const file = e.target.files?.[0];
-                        if (!file) return;
+                        if (false) return;
                         const assetId = `acute_${Math.random().toString(36).substr(2, 9)}`;
                         const url = await storage.saveAsset(assetId, file);

[NoCoverage] BooleanLiteral
components/AcuteCareView.tsx:224:29
                       input.accept = 'image/*';
                       input.onchange = async (e: any) => {
                         const file = e.target.files?.[0];
-                        if (!file) return;
+                        if (file) return;
                         const assetId = `acute_${Math.random().toString(36).substr(2, 9)}`;
                         const url = await storage.saveAsset(assetId, file);

[NoCoverage] MethodExpression
components/AcuteCareView.tsx:225:50
                       input.onchange = async (e: any) => {
                         const file = e.target.files?.[0];
                         if (!file) return;
-                        const assetId = `acute_${Math.random().toString(36).substr(2, 9)}`;
+                        const assetId = `acute_${Math.random().toString(36)}`;
                         const url = await storage.saveAsset(assetId, file);
                         updateItem(idx, 'localImageUrl', url);

[NoCoverage] StringLiteral
components/AcuteCareView.tsx:227:41
                         if (!file) return;
                         const assetId = `acute_${Math.random().toString(36).substr(2, 9)}`;
                         const url = await storage.saveAsset(assetId, file);
-                        updateItem(idx, 'localImageUrl', url);
+                        updateItem(idx, "", url);
                       };
                       input.click();

[NoCoverage] ConditionalExpression
components/AcuteCareView.tsx:239:27
                 title={item.presentation}
                 icon={Zap}
                 headerColorClass="bg-rose-950/30"
-                imageUrl={item.imageUrl || '/assets/placeholders/clinical-presentation.svg'}
+                imageUrl={true}
                 localImageUrl={item.localImageUrl}
                 details={[

[NoCoverage] ConditionalExpression
components/AcuteCareView.tsx:239:27
                 title={item.presentation}
                 icon={Zap}
                 headerColorClass="bg-rose-950/30"
-                imageUrl={item.imageUrl || '/assets/placeholders/clinical-presentation.svg'}
+                imageUrl={false}
                 localImageUrl={item.localImageUrl}
                 details={[

[NoCoverage] ArrayDeclaration
components/AcuteCareView.tsx:241:26
                 headerColorClass="bg-rose-950/30"
                 imageUrl={item.imageUrl || '/assets/placeholders/clinical-presentation.svg'}
                 localImageUrl={item.localImageUrl}
-                details={[
-                  {
-                    label: 'Management',
-                    content: item.management,
-                    icon: Stethoscope,
-                    labelColorClass: 'text-amber-500'
-                  },
-                  {
-                    label: 'Adjuncts',
-                    content: item.adjuncts,
-                    icon: Syringe,
-                    labelColorClass: 'text-blue-450'
-                  },
-                  {
-                    label: 'Imaging & Review',
-                    content: item.imaging,
-                    icon: Microscope,
-                    labelColorClass: 'text-indigo-400'
-                  }
-                ]}
+                details={[]}
               />
             )}

[NoCoverage] ObjectLiteral
components/AcuteCareView.tsx:248:19
                     icon: Stethoscope,
                     labelColorClass: 'text-amber-500'
                   },
-                  {
-                    label: 'Adjuncts',
-                    content: item.adjuncts,
-                    icon: Syringe,
-                    labelColorClass: 'text-blue-450'
-                  },
+                  {},
                   {
                     label: 'Imaging & Review',

[NoCoverage] StringLiteral
components/AcuteCareView.tsx:249:28
                     labelColorClass: 'text-amber-500'
                   },
                   {
-                    label: 'Adjuncts',
+                    label: "",
                     content: item.adjuncts,
                     icon: Syringe,

[NoCoverage] StringLiteral
components/AcuteCareView.tsx:252:38
                     label: 'Adjuncts',
                     content: item.adjuncts,
                     icon: Syringe,
-                    labelColorClass: 'text-blue-450'
+                    labelColorClass: ""
                   },
                   {

[NoCoverage] ObjectLiteral
components/AcuteCareView.tsx:254:19
                     icon: Syringe,
                     labelColorClass: 'text-blue-450'
                   },
-                  {
-                    label: 'Imaging & Review',
-                    content: item.imaging,
-                    icon: Microscope,
-                    labelColorClass: 'text-indigo-400'
-                  }
+                  {}
                 ]}
               />

[NoCoverage] StringLiteral
components/AcuteCareView.tsx:258:38
                     label: 'Imaging & Review',
                     content: item.imaging,
                     icon: Microscope,
-                    labelColorClass: 'text-indigo-400'
+                    labelColorClass: ""
                   }
                 ]}

[NoCoverage] ConditionalExpression
components/AcuteCareView.tsx:277:8
         clinicians and current local hospital guidelines before application.
       </div>
 
-      {enlargedImage && (
-        <ImageModal
-          src={enlargedImage.src}
-          alt={enlargedImage.alt}
-          onClose={() => setEnlargedImage(null)}
-        />
-      )}
+      {false}
     </div>
   );

[NoCoverage] LogicalOperator
components/AcuteCareView.tsx:277:8
         clinicians and current local hospital guidelines before application.
       </div>
 
-      {enlargedImage && (
-        <ImageModal
-          src={enlargedImage.src}
-          alt={enlargedImage.alt}
-          onClose={() => setEnlargedImage(null)}
-        />
-      )}
+      {enlargedImage || <ImageModal src={enlargedImage.src} alt={enlargedImage.alt} onClose={() => setEnlargedImage(null)} />}
     </div>
   );

[NoCoverage] ArrowFunction
components/AcuteCareView.tsx:281:20
         <ImageModal
           src={enlargedImage.src}
           alt={enlargedImage.alt}
-          onClose={() => setEnlargedImage(null)}
+          onClose={() => undefined}
         />
       )}
