[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:48:78
   const [activeTab, setActiveTab] = useState<MainTab>('pharmacology');
 
   // Physiology State
-  const [activePhysCategory, setActivePhysCategory] = useState<PhysCategory>('normal');
+  const [activePhysCategory, setActivePhysCategory] = useState<PhysCategory>("");
   const [selectedPhysTopic, setSelectedPhysTopic] = useState<string | null>(null);
   const [selectedDrug, setSelectedDrug] = useState<AnaesthesiaDrug | null>(null);

[NoCoverage] ArrayDeclaration
components/AnaestheticsCCView.tsx:53:69
   const [selectedDrug, setSelectedDrug] = useState<AnaesthesiaDrug | null>(null);
   const [searchQuery, setSearchQuery] = useState('');
   const [activeDrugCategory, setActiveDrugCategory] = useState<string>('induction');
-  const [customDrugs, setCustomDrugs] = useState<AnaesthesiaDrug[]>([]);
+  const [customDrugs, setCustomDrugs] = useState<AnaesthesiaDrug[]>(["Stryker was here"]);
   const [isSearchingAI, setIsSearchingAI] = useState(false);
   const [error, setError] = useState<string | null>(null);

[NoCoverage] BooleanLiteral
components/AnaestheticsCCView.tsx:54:54
   const [searchQuery, setSearchQuery] = useState('');
   const [activeDrugCategory, setActiveDrugCategory] = useState<string>('induction');
   const [customDrugs, setCustomDrugs] = useState<AnaesthesiaDrug[]>([]);
-  const [isSearchingAI, setIsSearchingAI] = useState(false);
+  const [isSearchingAI, setIsSearchingAI] = useState(true);
   const [error, setError] = useState<string | null>(null);
 

[NoCoverage] BlockStatement
components/AnaestheticsCCView.tsx:57:19
   const [isSearchingAI, setIsSearchingAI] = useState(false);
   const [error, setError] = useState<string | null>(null);
 
-  useEffect(() => {
-    loadCustomDrugs();
-  }, []);
+  useEffect(() => {}, []);
 
   const loadCustomDrugs = async () => {

[NoCoverage] BlockStatement
components/AnaestheticsCCView.tsx:61:39
     loadCustomDrugs();
   }, []);
 
-  const loadCustomDrugs = async () => {
-    try {
-      const drugs = await storage.getAnaesthesiaDrugs();
-      setCustomDrugs(drugs);
-    } catch (e) {
-      console.error('Failed to load custom drugs:', e);
-    }
-  };
+  const loadCustomDrugs = async () => {};
 
   const deduplicate = (base: AnaesthesiaDrug[], custom: AnaesthesiaDrug[]) => {

[NoCoverage] BlockStatement
components/AnaestheticsCCView.tsx:62:9
   }, []);
 
   const loadCustomDrugs = async () => {
-    try {
-      const drugs = await storage.getAnaesthesiaDrugs();
-      setCustomDrugs(drugs);
-    } catch (e) {
+    try {} catch (e) {
       console.error('Failed to load custom drugs:', e);
     }

[NoCoverage] BlockStatement
components/AnaestheticsCCView.tsx:65:17
     try {
       const drugs = await storage.getAnaesthesiaDrugs();
       setCustomDrugs(drugs);
-    } catch (e) {
-      console.error('Failed to load custom drugs:', e);
-    }
+    } catch (e) {}
   };
 

[NoCoverage] BlockStatement
components/AnaestheticsCCView.tsx:70:79
     }
   };
 
-  const deduplicate = (base: AnaesthesiaDrug[], custom: AnaesthesiaDrug[]) => {
-    const map = new Map<string, AnaesthesiaDrug>();
-    base.forEach((d) => map.set(d.name, d));
-    custom.forEach((d) => map.set(d.name, d));
-    return Array.from(map.values());
-  };
+  const deduplicate = (base: AnaesthesiaDrug[], custom: AnaesthesiaDrug[]) => {};
 
   const allDrugs = [

[NoCoverage] ArrowFunction
components/AnaestheticsCCView.tsx:72:18
 
   const deduplicate = (base: AnaesthesiaDrug[], custom: AnaesthesiaDrug[]) => {
     const map = new Map<string, AnaesthesiaDrug>();
-    base.forEach((d) => map.set(d.name, d));
+    base.forEach(() => undefined);
     custom.forEach((d) => map.set(d.name, d));
     return Array.from(map.values());

[NoCoverage] ArrowFunction
components/AnaestheticsCCView.tsx:73:20
   const deduplicate = (base: AnaesthesiaDrug[], custom: AnaesthesiaDrug[]) => {
     const map = new Map<string, AnaesthesiaDrug>();
     base.forEach((d) => map.set(d.name, d));
-    custom.forEach((d) => map.set(d.name, d));
+    custom.forEach(() => undefined);
     return Array.from(map.values());
   };

[NoCoverage] ArrowFunction
components/AnaestheticsCCView.tsx:78:29
   };
 
   const allDrugs = [
-    ...INDUCTION_AGENTS.map((d) => ({ ...d, category: 'induction' })),
+    ...INDUCTION_AGENTS.map(() => undefined),
     ...MUSCLE_RELAXANTS.map((d) => ({ ...d, category: 'relaxants' })),
     ...EMERGENCY_DRUGS.map((d) => ({ ...d, category: 'emergency' })),

[NoCoverage] ObjectLiteral
components/AnaestheticsCCView.tsx:78:37
   };
 
   const allDrugs = [
-    ...INDUCTION_AGENTS.map((d) => ({ ...d, category: 'induction' })),
+    ...INDUCTION_AGENTS.map((d) => ({})),
     ...MUSCLE_RELAXANTS.map((d) => ({ ...d, category: 'relaxants' })),
     ...EMERGENCY_DRUGS.map((d) => ({ ...d, category: 'emergency' })),

[NoCoverage] ArrowFunction
components/AnaestheticsCCView.tsx:79:29
 
   const allDrugs = [
     ...INDUCTION_AGENTS.map((d) => ({ ...d, category: 'induction' })),
-    ...MUSCLE_RELAXANTS.map((d) => ({ ...d, category: 'relaxants' })),
+    ...MUSCLE_RELAXANTS.map(() => undefined),
     ...EMERGENCY_DRUGS.map((d) => ({ ...d, category: 'emergency' })),
     ...customDrugs

[NoCoverage] ArrowFunction
components/AnaestheticsCCView.tsx:80:28
   const allDrugs = [
     ...INDUCTION_AGENTS.map((d) => ({ ...d, category: 'induction' })),
     ...MUSCLE_RELAXANTS.map((d) => ({ ...d, category: 'relaxants' })),
-    ...EMERGENCY_DRUGS.map((d) => ({ ...d, category: 'emergency' })),
+    ...EMERGENCY_DRUGS.map(() => undefined),
     ...customDrugs
   ];

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:86:11
 
   const standardDrugCategories = [
     { id: 'induction', name: 'Induction Agents', icon: <Zap className="w-5 h-5" /> },
-    { id: 'relaxants', name: 'Muscle Relaxants', icon: <Dna className="w-5 h-5" /> },
+    { id: "", name: 'Muscle Relaxants', icon: <Dna className="w-5 h-5" /> },
     { id: 'emergency', name: 'Emergency Drugs', icon: <ShieldAlert className="w-5 h-5" /> },
     { id: 'analgesics', name: 'Analgesics', icon: <Thermometer className="w-5 h-5" /> },

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:86:30
 
   const standardDrugCategories = [
     { id: 'induction', name: 'Induction Agents', icon: <Zap className="w-5 h-5" /> },
-    { id: 'relaxants', name: 'Muscle Relaxants', icon: <Dna className="w-5 h-5" /> },
+    { id: 'relaxants', name: "", icon: <Dna className="w-5 h-5" /> },
     { id: 'emergency', name: 'Emergency Drugs', icon: <ShieldAlert className="w-5 h-5" /> },
     { id: 'analgesics', name: 'Analgesics', icon: <Thermometer className="w-5 h-5" /> },

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:87:30
   const standardDrugCategories = [
     { id: 'induction', name: 'Induction Agents', icon: <Zap className="w-5 h-5" /> },
     { id: 'relaxants', name: 'Muscle Relaxants', icon: <Dna className="w-5 h-5" /> },
-    { id: 'emergency', name: 'Emergency Drugs', icon: <ShieldAlert className="w-5 h-5" /> },
+    { id: 'emergency', name: "", icon: <ShieldAlert className="w-5 h-5" /> },
     { id: 'analgesics', name: 'Analgesics', icon: <Thermometer className="w-5 h-5" /> },
     { id: 'local_anaesthetics', name: 'Local Anaesthetics', icon: <Syringe className="w-5 h-5" /> },

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:87:11
   const standardDrugCategories = [
     { id: 'induction', name: 'Induction Agents', icon: <Zap className="w-5 h-5" /> },
     { id: 'relaxants', name: 'Muscle Relaxants', icon: <Dna className="w-5 h-5" /> },
-    { id: 'emergency', name: 'Emergency Drugs', icon: <ShieldAlert className="w-5 h-5" /> },
+    { id: "", name: 'Emergency Drugs', icon: <ShieldAlert className="w-5 h-5" /> },
     { id: 'analgesics', name: 'Analgesics', icon: <Thermometer className="w-5 h-5" /> },
     { id: 'local_anaesthetics', name: 'Local Anaesthetics', icon: <Syringe className="w-5 h-5" /> },

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:88:11
     { id: 'induction', name: 'Induction Agents', icon: <Zap className="w-5 h-5" /> },
     { id: 'relaxants', name: 'Muscle Relaxants', icon: <Dna className="w-5 h-5" /> },
     { id: 'emergency', name: 'Emergency Drugs', icon: <ShieldAlert className="w-5 h-5" /> },
-    { id: 'analgesics', name: 'Analgesics', icon: <Thermometer className="w-5 h-5" /> },
+    { id: "", name: 'Analgesics', icon: <Thermometer className="w-5 h-5" /> },
     { id: 'local_anaesthetics', name: 'Local Anaesthetics', icon: <Syringe className="w-5 h-5" /> },
     { id: 'antiemetics', name: 'Antiemetics', icon: <Droplets className="w-5 h-5" /> },

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:92:11
     { id: 'local_anaesthetics', name: 'Local Anaesthetics', icon: <Syringe className="w-5 h-5" /> },
     { id: 'antiemetics', name: 'Antiemetics', icon: <Droplets className="w-5 h-5" /> },
     { id: 'reversal', name: 'Reversal Agents', icon: <RotateCcw className="w-5 h-5" /> },
-    { id: 'other', name: 'Other / Custom', icon: <Plus className="w-5 h-5" /> }
+    { id: "", name: 'Other / Custom', icon: <Plus className="w-5 h-5" /> }
   ];
 

[NoCoverage] BlockStatement
components/AnaestheticsCCView.tsx:96:20
   ];
 
   const groupedDrugs = allDrugs.reduce(
-    (acc, drug) => {
-      const cat = (drug.category || 'other').toLowerCase().trim();
-      if (!acc[cat]) acc[cat] = [];
-      if (!acc[cat].find((d) => d.name === drug.name)) {
-        acc[cat].push(drug);
-      }
-      return acc;
-    },
+    (acc, drug) => {},
     {} as Record<string, AnaesthesiaDrug[]>
   );

[NoCoverage] MethodExpression
components/AnaestheticsCCView.tsx:97:19
 
   const groupedDrugs = allDrugs.reduce(
     (acc, drug) => {
-      const cat = (drug.category || 'other').toLowerCase().trim();
+      const cat = (drug.category || 'other').toLowerCase();
       if (!acc[cat]) acc[cat] = [];
       if (!acc[cat].find((d) => d.name === drug.name)) {

[NoCoverage] MethodExpression
components/AnaestheticsCCView.tsx:97:19
 
   const groupedDrugs = allDrugs.reduce(
     (acc, drug) => {
-      const cat = (drug.category || 'other').toLowerCase().trim();
+      const cat = (drug.category || 'other').toUpperCase().trim();
       if (!acc[cat]) acc[cat] = [];
       if (!acc[cat].find((d) => d.name === drug.name)) {

[NoCoverage] BooleanLiteral
components/AnaestheticsCCView.tsx:98:11
   const groupedDrugs = allDrugs.reduce(
     (acc, drug) => {
       const cat = (drug.category || 'other').toLowerCase().trim();
-      if (!acc[cat]) acc[cat] = [];
+      if (acc[cat]) acc[cat] = [];
       if (!acc[cat].find((d) => d.name === drug.name)) {
         acc[cat].push(drug);

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:98:11
   const groupedDrugs = allDrugs.reduce(
     (acc, drug) => {
       const cat = (drug.category || 'other').toLowerCase().trim();
-      if (!acc[cat]) acc[cat] = [];
+      if (true) acc[cat] = [];
       if (!acc[cat].find((d) => d.name === drug.name)) {
         acc[cat].push(drug);

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:99:11
     (acc, drug) => {
       const cat = (drug.category || 'other').toLowerCase().trim();
       if (!acc[cat]) acc[cat] = [];
-      if (!acc[cat].find((d) => d.name === drug.name)) {
+      if (true) {
         acc[cat].push(drug);
       }

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:99:11
     (acc, drug) => {
       const cat = (drug.category || 'other').toLowerCase().trim();
       if (!acc[cat]) acc[cat] = [];
-      if (!acc[cat].find((d) => d.name === drug.name)) {
+      if (false) {
         acc[cat].push(drug);
       }

[NoCoverage] ArrowFunction
components/AnaestheticsCCView.tsx:108:35
   );
 
   const drugCategories = [
-    ...standardDrugCategories.map((cat) => ({
-      ...cat,
-      drugs: groupedDrugs[cat.id] || []
-    })),
+    ...standardDrugCategories.map(() => undefined),
     ...Object.keys(groupedDrugs)
       .filter((id) => !standardDrugCategories.find((sc) => sc.id === id))

[NoCoverage] LogicalOperator
components/AnaestheticsCCView.tsx:110:14
   const drugCategories = [
     ...standardDrugCategories.map((cat) => ({
       ...cat,
-      drugs: groupedDrugs[cat.id] || []
+      drugs: groupedDrugs[cat.id] && []
     })),
     ...Object.keys(groupedDrugs)

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:110:14
   const drugCategories = [
     ...standardDrugCategories.map((cat) => ({
       ...cat,
-      drugs: groupedDrugs[cat.id] || []
+      drugs: false
     })),
     ...Object.keys(groupedDrugs)

[NoCoverage] MethodExpression
components/AnaestheticsCCView.tsx:112:8
       ...cat,
       drugs: groupedDrugs[cat.id] || []
     })),
-    ...Object.keys(groupedDrugs)
-      .filter((id) => !standardDrugCategories.find((sc) => sc.id === id))
+    ...Object.keys(groupedDrugs)
       .map((id) => ({
         id,

[NoCoverage] BooleanLiteral
components/AnaestheticsCCView.tsx:113:23
       drugs: groupedDrugs[cat.id] || []
     })),
     ...Object.keys(groupedDrugs)
-      .filter((id) => !standardDrugCategories.find((sc) => sc.id === id))
+      .filter((id) => standardDrugCategories.find(sc => sc.id === id))
       .map((id) => ({
         id,

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:113:60
       drugs: groupedDrugs[cat.id] || []
     })),
     ...Object.keys(groupedDrugs)
-      .filter((id) => !standardDrugCategories.find((sc) => sc.id === id))
+      .filter((id) => !standardDrugCategories.find((sc) => true))
       .map((id) => ({
         id,

[NoCoverage] ArrowFunction
components/AnaestheticsCCView.tsx:114:12
     })),
     ...Object.keys(groupedDrugs)
       .filter((id) => !standardDrugCategories.find((sc) => sc.id === id))
-      .map((id) => ({
-        id,
-        name: id.charAt(0).toUpperCase() + id.slice(1).replace(/_/g, ' '),
-        icon: <Pill className="w-5 h-5" />,
-        drugs: groupedDrugs[id] || []
-      }))
+      .map(() => undefined)
   ].filter(
     (cat) =>

[NoCoverage] MethodExpression
components/AnaestheticsCCView.tsx:116:15
       .filter((id) => !standardDrugCategories.find((sc) => sc.id === id))
       .map((id) => ({
         id,
-        name: id.charAt(0).toUpperCase() + id.slice(1).replace(/_/g, ' '),
+        name: id.charAt(0).toLowerCase() + id.slice(1).replace(/_/g, ' '),
         icon: <Pill className="w-5 h-5" />,
         drugs: groupedDrugs[id] || []

[NoCoverage] ArithmeticOperator
components/AnaestheticsCCView.tsx:116:15
       .filter((id) => !standardDrugCategories.find((sc) => sc.id === id))
       .map((id) => ({
         id,
-        name: id.charAt(0).toUpperCase() + id.slice(1).replace(/_/g, ' '),
+        name: id.charAt(0).toUpperCase() - id.slice(1).replace(/_/g, ' '),
         icon: <Pill className="w-5 h-5" />,
         drugs: groupedDrugs[id] || []

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:118:16
         id,
         name: id.charAt(0).toUpperCase() + id.slice(1).replace(/_/g, ' '),
         icon: <Pill className="w-5 h-5" />,
-        drugs: groupedDrugs[id] || []
+        drugs: false
       }))
   ].filter(

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:118:16
         id,
         name: id.charAt(0).toUpperCase() + id.slice(1).replace(/_/g, ' '),
         icon: <Pill className="w-5 h-5" />,
-        drugs: groupedDrugs[id] || []
+        drugs: true
       }))
   ].filter(

[NoCoverage] ArrowFunction
components/AnaestheticsCCView.tsx:121:5
         drugs: groupedDrugs[id] || []
       }))
   ].filter(
-    (cat) =>
-      cat.drugs.length > 0 ||
-      [
-        'induction',
-        'relaxants',
-        'emergency',
-        'analgesics',
-        'local_anaesthetics',
-        'antiemetics',
-        'reversal',
-        'other'
-      ].includes(cat.id)
+    () => undefined
   );
 

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:122:7
       }))
   ].filter(
     (cat) =>
-      cat.drugs.length > 0 ||
-      [
-        'induction',
-        'relaxants',
-        'emergency',
-        'analgesics',
-        'local_anaesthetics',
-        'antiemetics',
-        'reversal',
-        'other'
-      ].includes(cat.id)
+      false
   );
 

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:122:7
       }))
   ].filter(
     (cat) =>
-      cat.drugs.length > 0 ||
+      false ||
       [
         'induction',

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:124:9
     (cat) =>
       cat.drugs.length > 0 ||
       [
-        'induction',
+        "",
         'relaxants',
         'emergency',

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:129:9
         'emergency',
         'analgesics',
         'local_anaesthetics',
-        'antiemetics',
+        "",
         'reversal',
         'other'

[NoCoverage] ArrowFunction
components/AnaestheticsCCView.tsx:136:25
   );
 
   const { results: filteredDrugs, didYouMean } = useClinicalSearch(
-    drugCategories.find((c) => c.id === activeDrugCategory)?.drugs || [],
+    drugCategories.find(() => undefined)?.drugs || [],
     searchQuery,
     ['name', 'class']

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:136:32
   );
 
   const { results: filteredDrugs, didYouMean } = useClinicalSearch(
-    drugCategories.find((c) => c.id === activeDrugCategory)?.drugs || [],
+    drugCategories.find((c) => true)?.drugs || [],
     searchQuery,
     ['name', 'class']

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:138:14
   const { results: filteredDrugs, didYouMean } = useClinicalSearch(
     drugCategories.find((c) => c.id === activeDrugCategory)?.drugs || [],
     searchQuery,
-    ['name', 'class']
+    ['name', ""]
   );
 

[NoCoverage] BlockStatement
components/AnaestheticsCCView.tsx:141:38
     ['name', 'class']
   );
 
-  const handleAISearch = async () => {
-    if (!searchQuery.trim()) return;
-    setIsSearchingAI(true);
-    setError(null);
-    try {
-      const drug = await geminiService.generateAnaesthesiaDrug(searchQuery);
-      if (drug && drug.name) {
-        await storage.saveAnaesthesiaDrug(drug);
-        setCustomDrugs((prev) => [...prev.filter((d) => d.name !== drug.name), drug]);
-        setSelectedDrug(drug);
-        if (drug.category) {
-          setActiveDrugCategory(drug.category.toLowerCase().trim());
-        } else {
-          setActiveDrugCategory('other');
-        }
-      } else {
-        setError('Could not find detailed information for this drug.');
-      }
-    } catch (e) {
-      console.error('AI Drug Search failed:', e);
-      setError('Failed to fetch drug information. Please try again.');
-    } finally {
-      setIsSearchingAI(false);
-    }
-  };
+  const handleAISearch = async () => {};
 
   const mainTabs = [

[NoCoverage] BooleanLiteral
components/AnaestheticsCCView.tsx:142:9
   );
 
   const handleAISearch = async () => {
-    if (!searchQuery.trim()) return;
+    if (searchQuery.trim()) return;
     setIsSearchingAI(true);
     setError(null);

[NoCoverage] MethodExpression
components/AnaestheticsCCView.tsx:142:10
   );
 
   const handleAISearch = async () => {
-    if (!searchQuery.trim()) return;
+    if (!searchQuery) return;
     setIsSearchingAI(true);
     setError(null);

[NoCoverage] BooleanLiteral
components/AnaestheticsCCView.tsx:143:22
 
   const handleAISearch = async () => {
     if (!searchQuery.trim()) return;
-    setIsSearchingAI(true);
+    setIsSearchingAI(false);
     setError(null);
     try {

[NoCoverage] BlockStatement
components/AnaestheticsCCView.tsx:145:9
     if (!searchQuery.trim()) return;
     setIsSearchingAI(true);
     setError(null);
-    try {
-      const drug = await geminiService.generateAnaesthesiaDrug(searchQuery);
-      if (drug && drug.name) {
-        await storage.saveAnaesthesiaDrug(drug);
-        setCustomDrugs((prev) => [...prev.filter((d) => d.name !== drug.name), drug]);
-        setSelectedDrug(drug);
-        if (drug.category) {
-          setActiveDrugCategory(drug.category.toLowerCase().trim());
-        } else {
-          setActiveDrugCategory('other');
-        }
-      } else {
-        setError('Could not find detailed information for this drug.');
-      }
-    } catch (e) {
+    try {} catch (e) {
       console.error('AI Drug Search failed:', e);
       setError('Failed to fetch drug information. Please try again.');

[NoCoverage] LogicalOperator
components/AnaestheticsCCView.tsx:147:11
     setError(null);
     try {
       const drug = await geminiService.generateAnaesthesiaDrug(searchQuery);
-      if (drug && drug.name) {
+      if (drug || drug.name) {
         await storage.saveAnaesthesiaDrug(drug);
         setCustomDrugs((prev) => [...prev.filter((d) => d.name !== drug.name), drug]);

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:147:11
     setError(null);
     try {
       const drug = await geminiService.generateAnaesthesiaDrug(searchQuery);
-      if (drug && drug.name) {
+      if (true) {
         await storage.saveAnaesthesiaDrug(drug);
         setCustomDrugs((prev) => [...prev.filter((d) => d.name !== drug.name), drug]);

[NoCoverage] EqualityOperator
components/AnaestheticsCCView.tsx:149:57
       const drug = await geminiService.generateAnaesthesiaDrug(searchQuery);
       if (drug && drug.name) {
         await storage.saveAnaesthesiaDrug(drug);
-        setCustomDrugs((prev) => [...prev.filter((d) => d.name !== drug.name), drug]);
+        setCustomDrugs((prev) => [...prev.filter((d) => d.name === drug.name), drug]);
         setSelectedDrug(drug);
         if (drug.category) {

[NoCoverage] MethodExpression
components/AnaestheticsCCView.tsx:149:38
       const drug = await geminiService.generateAnaesthesiaDrug(searchQuery);
       if (drug && drug.name) {
         await storage.saveAnaesthesiaDrug(drug);
-        setCustomDrugs((prev) => [...prev.filter((d) => d.name !== drug.name), drug]);
+        setCustomDrugs((prev) => [...prev, drug]);
         setSelectedDrug(drug);
         if (drug.category) {

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:151:13
         await storage.saveAnaesthesiaDrug(drug);
         setCustomDrugs((prev) => [...prev.filter((d) => d.name !== drug.name), drug]);
         setSelectedDrug(drug);
-        if (drug.category) {
+        if (true) {
           setActiveDrugCategory(drug.category.toLowerCase().trim());
         } else {

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:151:13
         await storage.saveAnaesthesiaDrug(drug);
         setCustomDrugs((prev) => [...prev.filter((d) => d.name !== drug.name), drug]);
         setSelectedDrug(drug);
-        if (drug.category) {
+        if (false) {
           setActiveDrugCategory(drug.category.toLowerCase().trim());
         } else {

[NoCoverage] MethodExpression
components/AnaestheticsCCView.tsx:152:33
         setCustomDrugs((prev) => [...prev.filter((d) => d.name !== drug.name), drug]);
         setSelectedDrug(drug);
         if (drug.category) {
-          setActiveDrugCategory(drug.category.toLowerCase().trim());
+          setActiveDrugCategory(drug.category.toUpperCase().trim());
         } else {
           setActiveDrugCategory('other');

[NoCoverage] MethodExpression
components/AnaestheticsCCView.tsx:152:33
         setCustomDrugs((prev) => [...prev.filter((d) => d.name !== drug.name), drug]);
         setSelectedDrug(drug);
         if (drug.category) {
-          setActiveDrugCategory(drug.category.toLowerCase().trim());
+          setActiveDrugCategory(drug.category.toLowerCase());
         } else {
           setActiveDrugCategory('other');

[NoCoverage] BlockStatement
components/AnaestheticsCCView.tsx:153:16
         setSelectedDrug(drug);
         if (drug.category) {
           setActiveDrugCategory(drug.category.toLowerCase().trim());
-        } else {
-          setActiveDrugCategory('other');
-        }
+        } else {}
       } else {
         setError('Could not find detailed information for this drug.');

[NoCoverage] BlockStatement
components/AnaestheticsCCView.tsx:156:14
         } else {
           setActiveDrugCategory('other');
         }
-      } else {
-        setError('Could not find detailed information for this drug.');
-      }
+      } else {}
     } catch (e) {
       console.error('AI Drug Search failed:', e);

[NoCoverage] BlockStatement
components/AnaestheticsCCView.tsx:159:17
       } else {
         setError('Could not find detailed information for this drug.');
       }
-    } catch (e) {
-      console.error('AI Drug Search failed:', e);
-      setError('Failed to fetch drug information. Please try again.');
-    } finally {
+    } catch (e) {} finally {
       setIsSearchingAI(false);
     }

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:160:21
         setError('Could not find detailed information for this drug.');
       }
     } catch (e) {
-      console.error('AI Drug Search failed:', e);
+      console.error("", e);
       setError('Failed to fetch drug information. Please try again.');
     } finally {

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:161:16
       }
     } catch (e) {
       console.error('AI Drug Search failed:', e);
-      setError('Failed to fetch drug information. Please try again.');
+      setError("");
     } finally {
       setIsSearchingAI(false);

[NoCoverage] BlockStatement
components/AnaestheticsCCView.tsx:162:15
     } catch (e) {
       console.error('AI Drug Search failed:', e);
       setError('Failed to fetch drug information. Please try again.');
-    } finally {
-      setIsSearchingAI(false);
-    }
+    } finally {}
   };
 

[NoCoverage] BooleanLiteral
components/AnaestheticsCCView.tsx:163:24
       console.error('AI Drug Search failed:', e);
       setError('Failed to fetch drug information. Please try again.');
     } finally {
-      setIsSearchingAI(false);
+      setIsSearchingAI(true);
     }
   };

[NoCoverage] ObjectLiteral
components/AnaestheticsCCView.tsx:170:5
   const mainTabs = [
     { id: 'physiology', name: 'Physiology', icon: <Activity className="w-5 h-5" /> },
     { id: 'pharmacology', name: 'Pharmacology', icon: <Pill className="w-5 h-5" /> },
-    { id: 'airway', name: 'Airway & Sizing', icon: <Wind className="w-5 h-5" /> },
+    {},
     { id: 'mnemonics', name: 'Mnemonics', icon: <Lightbulb className="w-5 h-5" /> },
     { id: 'procedures', name: 'Procedures', icon: <Zap className="w-5 h-5" /> },

[NoCoverage] ObjectLiteral
components/AnaestheticsCCView.tsx:171:5
     { id: 'physiology', name: 'Physiology', icon: <Activity className="w-5 h-5" /> },
     { id: 'pharmacology', name: 'Pharmacology', icon: <Pill className="w-5 h-5" /> },
     { id: 'airway', name: 'Airway & Sizing', icon: <Wind className="w-5 h-5" /> },
-    { id: 'mnemonics', name: 'Mnemonics', icon: <Lightbulb className="w-5 h-5" /> },
+    {},
     { id: 'procedures', name: 'Procedures', icon: <Zap className="w-5 h-5" /> },
     { id: 'curriculum', name: 'Curriculum', icon: <FileText className="w-5 h-5" /> }

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:172:31
     { id: 'pharmacology', name: 'Pharmacology', icon: <Pill className="w-5 h-5" /> },
     { id: 'airway', name: 'Airway & Sizing', icon: <Wind className="w-5 h-5" /> },
     { id: 'mnemonics', name: 'Mnemonics', icon: <Lightbulb className="w-5 h-5" /> },
-    { id: 'procedures', name: 'Procedures', icon: <Zap className="w-5 h-5" /> },
+    { id: 'procedures', name: "", icon: <Zap className="w-5 h-5" /> },
     { id: 'curriculum', name: 'Curriculum', icon: <FileText className="w-5 h-5" /> }
   ];

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:178:32
 
   const physCategories = [
     { id: 'normal', name: 'Normal Physiology', icon: <Heart className="w-4 h-4" /> },
-    { id: 'populations', name: 'Special Populations', icon: <Users className="w-4 h-4" /> },
+    { id: 'populations', name: "", icon: <Users className="w-4 h-4" /> },
     { id: 'anaesthesia', name: 'Anaesthetic Alterations', icon: <Zap className="w-4 h-4" /> }
   ];

[NoCoverage] ObjectLiteral
components/AnaestheticsCCView.tsx:178:5
 
   const physCategories = [
     { id: 'normal', name: 'Normal Physiology', icon: <Heart className="w-4 h-4" /> },
-    { id: 'populations', name: 'Special Populations', icon: <Users className="w-4 h-4" /> },
+    {},
     { id: 'anaesthesia', name: 'Anaesthetic Alterations', icon: <Zap className="w-4 h-4" /> }
   ];

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:184:13
 
   const physTopics = {
     normal: [
-      { id: 'cvs', name: 'Cardiovascular', icon: <Heart className="w-4 h-4" /> },
+      { id: "", name: 'Cardiovascular', icon: <Heart className="w-4 h-4" /> },
       { id: 'resp', name: 'Respiratory', icon: <Wind className="w-4 h-4" /> },
       { id: 'renal', name: 'Renal', icon: <Droplets className="w-4 h-4" /> },

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:186:28
     normal: [
       { id: 'cvs', name: 'Cardiovascular', icon: <Heart className="w-4 h-4" /> },
       { id: 'resp', name: 'Respiratory', icon: <Wind className="w-4 h-4" /> },
-      { id: 'renal', name: 'Renal', icon: <Droplets className="w-4 h-4" /> },
+      { id: 'renal', name: "", icon: <Droplets className="w-4 h-4" /> },
       { id: 'neuro', name: 'Neurological', icon: <Brain className="w-4 h-4" /> },
       { id: 'hepatic', name: 'Hepatic', icon: <Activity className="w-4 h-4" /> }
