[NoCoverage] ArrowFunction
components/AnaestheticsCCView.tsx:460:54
                             Clinical Pearls
                           </h4>
                           <div className="grid grid-cols-1 md:grid-cols-2 gap-4">
-                            {selectedDrug.pearls.map((pearl, i) => (
-                              <div
-                                key={i}
-                                className="flex gap-4 p-4 bg-slate-950/20 rounded-2xl border border-white/5"
-                              >
-                                <Info className="w-5 h-5 text-indigo-500 shrink-0" />
-                                <p className="text-sm font-bold text-slate-350">{pearl}</p>
-                              </div>
-                            ))}
+                            {selectedDrug.pearls.map(() => undefined)}
                           </div>
                         </div>

[NoCoverage] ArrowFunction
components/AnaestheticsCCView.tsx:477:59
                             Side Effects
                           </h4>
                           <div className="flex flex-wrap gap-2">
-                            {selectedDrug.sideEffects.map((effect, i) => (
-                              <span
-                                key={i}
-                                className="px-4 py-2 bg-slate-950/40 border border-white/5 rounded-xl text-xs font-bold text-slate-400 shadow-sm"
-                              >
-                                {effect}
-                              </span>
-                            ))}
+                            {selectedDrug.sideEffects.map(() => undefined)}
                           </div>
                         </div>

[NoCoverage] EqualityOperator
components/AnaestheticsCCView.tsx:506:13
               </div>
             </div>
           </motion.div>
-        ) : activeTab === 'physiology' ? (
+        ) : activeTab !== 'physiology' ? (
           <motion.div
             key="physiology"

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:506:13
               </div>
             </div>
           </motion.div>
-        ) : activeTab === 'physiology' ? (
+        ) : true ? (
           <motion.div
             key="physiology"

[NoCoverage] ObjectLiteral
components/AnaestheticsCCView.tsx:509:22
         ) : activeTab === 'physiology' ? (
           <motion.div
             key="physiology"
-            initial={{ opacity: 0, y: 20 }}
+            initial={{}}
             animate={{ opacity: 1, y: 0 }}
             exit={{ opacity: 0, y: -20 }}

[NoCoverage] ArrowFunction
components/AnaestheticsCCView.tsx:516:35
           >
             {/* Physiology Sub-Navigation */}
             <div className="flex flex-wrap gap-3 bg-slate-950/20 p-2 rounded-[24px] border border-white/5">
-              {physCategories.map((cat) => (
-                <button
-                  key={cat.id}
-                  onClick={() => {
-                    setActivePhysCategory(cat.id as PhysCategory);
-                    setSelectedPhysTopic(null);
-                  }}
-                  className={`px-6 py-2.5 rounded-2xl text-[10px] font-black uppercase tracking-widest transition-all flex items-center gap-2 ${
-                    activePhysCategory === cat.id
-                      ? 'bg-slate-950/40 text-rose-600 shadow-sm border border-white/5'
-                      : 'text-slate-400 hover:text-slate-400'
-                  }`}
-                >
-                  {cat.icon}
-                  {cat.name}
-                </button>
-              ))}
+              {physCategories.map(() => undefined)}
             </div>
 

[NoCoverage] BlockStatement
components/AnaestheticsCCView.tsx:519:34
               {physCategories.map((cat) => (
                 <button
                   key={cat.id}
-                  onClick={() => {
-                    setActivePhysCategory(cat.id as PhysCategory);
-                    setSelectedPhysTopic(null);
-                  }}
+                  onClick={() => {}}
                   className={`px-6 py-2.5 rounded-2xl text-[10px] font-black uppercase tracking-widest transition-all flex items-center gap-2 ${
                     activePhysCategory === cat.id

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:524:21
                     setSelectedPhysTopic(null);
                   }}
                   className={`px-6 py-2.5 rounded-2xl text-[10px] font-black uppercase tracking-widest transition-all flex items-center gap-2 ${
-                    activePhysCategory === cat.id
+                    false
                       ? 'bg-slate-950/40 text-rose-600 shadow-sm border border-white/5'
                       : 'text-slate-400 hover:text-slate-400'

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:524:21
                     setSelectedPhysTopic(null);
                   }}
                   className={`px-6 py-2.5 rounded-2xl text-[10px] font-black uppercase tracking-widest transition-all flex items-center gap-2 ${
-                    activePhysCategory === cat.id
+                    true
                       ? 'bg-slate-950/40 text-rose-600 shadow-sm border border-white/5'
                       : 'text-slate-400 hover:text-slate-400'

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:526:25
                   className={`px-6 py-2.5 rounded-2xl text-[10px] font-black uppercase tracking-widest transition-all flex items-center gap-2 ${
                     activePhysCategory === cat.id
                       ? 'bg-slate-950/40 text-rose-600 shadow-sm border border-white/5'
-                      : 'text-slate-400 hover:text-slate-400'
+                      : ""
                   }`}
                 >

[NoCoverage] ArrowFunction
components/AnaestheticsCCView.tsx:538:53
             <div className="grid grid-cols-1 lg:grid-cols-4 gap-8">
               {/* Topic List */}
               <div className="lg:col-span-1 space-y-2">
-                {physTopics[activePhysCategory].map((topic) => (
-                  <button
-                    key={topic.id}
-                    onClick={() => setSelectedPhysTopic(topic.id)}
-                    className={`w-full p-4 rounded-2xl border transition-all text-left flex items-center gap-3 ${
-                      selectedPhysTopic === topic.id
-                        ? 'bg-rose-950/20 border-rose-200 text-rose-455 shadow-sm'
-                        : 'bg-slate-950/40 border-white/5 text-slate-400 hover:border-rose-950/30 hover:text-rose-600'
-                    }`}
-                  >
-                    {topic.icon}
-                    <span className="text-[10px] font-black uppercase tracking-widest truncate">
-                      {topic.name}
-                    </span>
-                  </button>
-                ))}
+                {physTopics[activePhysCategory].map(() => undefined)}
               </div>
 

[NoCoverage] ArrowFunction
components/AnaestheticsCCView.tsx:541:30
                 {physTopics[activePhysCategory].map((topic) => (
                   <button
                     key={topic.id}
-                    onClick={() => setSelectedPhysTopic(topic.id)}
+                    onClick={() => undefined}
                     className={`w-full p-4 rounded-2xl border transition-all text-left flex items-center gap-3 ${
                       selectedPhysTopic === topic.id

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:542:32
                   <button
                     key={topic.id}
                     onClick={() => setSelectedPhysTopic(topic.id)}
-                    className={`w-full p-4 rounded-2xl border transition-all text-left flex items-center gap-3 ${
-                      selectedPhysTopic === topic.id
-                        ? 'bg-rose-950/20 border-rose-200 text-rose-455 shadow-sm'
-                        : 'bg-slate-950/40 border-white/5 text-slate-400 hover:border-rose-950/30 hover:text-rose-600'
-                    }`}
+                    className={``}
                   >
                     {topic.icon}

[NoCoverage] EqualityOperator
components/AnaestheticsCCView.tsx:543:23
                     key={topic.id}
                     onClick={() => setSelectedPhysTopic(topic.id)}
                     className={`w-full p-4 rounded-2xl border transition-all text-left flex items-center gap-3 ${
-                      selectedPhysTopic === topic.id
+                      selectedPhysTopic !== topic.id
                         ? 'bg-rose-950/20 border-rose-200 text-rose-455 shadow-sm'
                         : 'bg-slate-950/40 border-white/5 text-slate-400 hover:border-rose-950/30 hover:text-rose-600'

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:543:23
                     key={topic.id}
                     onClick={() => setSelectedPhysTopic(topic.id)}
                     className={`w-full p-4 rounded-2xl border transition-all text-left flex items-center gap-3 ${
-                      selectedPhysTopic === topic.id
+                      false
                         ? 'bg-rose-950/20 border-rose-200 text-rose-455 shadow-sm'
                         : 'bg-slate-950/40 border-white/5 text-slate-400 hover:border-rose-950/30 hover:text-rose-600'

[NoCoverage] ObjectLiteral
components/AnaestheticsCCView.tsx:562:32
                   {selectedPhysTopic ? (
                     <motion.div
                       key={selectedPhysTopic}
-                      initial={{ opacity: 0, x: 20 }}
+                      initial={{}}
                       animate={{ opacity: 1, x: 0 }}
                       exit={{ opacity: 0, x: -20 }}

[NoCoverage] LogicalOperator
components/AnaestheticsCCView.tsx:569:28
                     >
                       <div className="flex items-center gap-4 mb-8">
                         <div className="w-12 h-12 bg-rose-950/20 rounded-2xl flex items-center justify-center text-rose-600">
-                          {physTopics[activePhysCategory].find((t) => t.id === selectedPhysTopic)
-                            ?.icon || <Activity className="w-6 h-6" />}
+                          {physTopics[activePhysCategory].find(t => t.id === selectedPhysTopic)?.icon && <Activity className="w-6 h-6" />}
                         </div>
                         <div>

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:569:28
                     >
                       <div className="flex items-center gap-4 mb-8">
                         <div className="w-12 h-12 bg-rose-950/20 rounded-2xl flex items-center justify-center text-rose-600">
-                          {physTopics[activePhysCategory].find((t) => t.id === selectedPhysTopic)
-                            ?.icon || <Activity className="w-6 h-6" />}
+                          {true}
                         </div>
                         <div>

[NoCoverage] ArrowFunction
components/AnaestheticsCCView.tsx:575:67
                         <div>
                           <h3 className="text-2xl font-black text-white uppercase tracking-tight">
                             {
-                              physTopics[activePhysCategory].find((t) => t.id === selectedPhysTopic)
+                              physTopics[activePhysCategory].find(() => undefined)
                                 ?.name
                             }

[NoCoverage] OptionalChaining
components/AnaestheticsCCView.tsx:575:31
                         <div>
                           <h3 className="text-2xl font-black text-white uppercase tracking-tight">
                             {
-                              physTopics[activePhysCategory].find((t) => t.id === selectedPhysTopic)
-                                ?.name
+                              physTopics[activePhysCategory].find(t => t.id === selectedPhysTopic).name
                             }
                           </h3>

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:591:67
                             <Info className="w-3 h-3" /> Core Concepts
                           </h4>
                           <p className="text-sm text-slate-400 font-medium leading-relaxed">
-                            Detailed physiological principles for{' '}
+                            Detailed physiological principles for{""}
                             {physTopics[activePhysCategory]
                               .find((t) => t.id === selectedPhysTopic)

[NoCoverage] MethodExpression
components/AnaestheticsCCView.tsx:592:30
                           </h4>
                           <p className="text-sm text-slate-400 font-medium leading-relaxed">
                             Detailed physiological principles for{' '}
-                            {physTopics[activePhysCategory]
-                              .find((t) => t.id === selectedPhysTopic)
-                              ?.name.toLowerCase()}{' '}
+                            {physTopics[activePhysCategory].find(t => t.id === selectedPhysTopic)?.name.toUpperCase()}{' '}
                             are being integrated.
                           </p>

[NoCoverage] OptionalChaining
components/AnaestheticsCCView.tsx:592:30
                           </h4>
                           <p className="text-sm text-slate-400 font-medium leading-relaxed">
                             Detailed physiological principles for{' '}
-                            {physTopics[activePhysCategory]
-                              .find((t) => t.id === selectedPhysTopic)
-                              ?.name.toLowerCase()}{' '}
+                            {physTopics[activePhysCategory].find(t => t.id === selectedPhysTopic).name.toLowerCase()}{' '}
                             are being integrated.
                           </p>

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:593:44
                           <p className="text-sm text-slate-400 font-medium leading-relaxed">
                             Detailed physiological principles for{' '}
                             {physTopics[activePhysCategory]
-                              .find((t) => t.id === selectedPhysTopic)
+                              .find((t) => true)
                               ?.name.toLowerCase()}{' '}
                             are being integrated.

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:593:44
                           <p className="text-sm text-slate-400 font-medium leading-relaxed">
                             Detailed physiological principles for{' '}
                             {physTopics[activePhysCategory]
-                              .find((t) => t.id === selectedPhysTopic)
+                              .find((t) => false)
                               ?.name.toLowerCase()}{' '}
                             are being integrated.

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:594:53
                             Detailed physiological principles for{' '}
                             {physTopics[activePhysCategory]
                               .find((t) => t.id === selectedPhysTopic)
-                              ?.name.toLowerCase()}{' '}
+                              ?.name.toLowerCase()}{""}
                             are being integrated.
                           </p>

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:605:31
                           <ul className="space-y-2">
                             {[
                               'Key equations',
-                              'Pressure-Volume relationships',
+                              "",
                               'Regulatory mechanisms'
                             ].map((item, i) => (

[NoCoverage] ArrowFunction
components/AnaestheticsCCView.tsx:607:35
                               'Key equations',
                               'Pressure-Volume relationships',
                               'Regulatory mechanisms'
-                            ].map((item, i) => (
-                              <li
-                                key={i}
-                                className="text-[11px] text-rose-900 font-bold flex items-center gap-2"
-                              >
-                                <div className="w-1 h-1 rounded-full bg-rose-400" />
-                                {item}
-                              </li>
-                            ))}
+                            ].map(() => undefined)}
                           </ul>
                         </div>

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:635:13
               </div>
             </div>
           </motion.div>
-        ) : activeTab === 'curriculum' ? (
+        ) : false ? (
           <motion.div
             key="curriculum"

[NoCoverage] EqualityOperator
components/AnaestheticsCCView.tsx:635:13
               </div>
             </div>
           </motion.div>
-        ) : activeTab === 'curriculum' ? (
+        ) : activeTab !== 'curriculum' ? (
           <motion.div
             key="curriculum"

[NoCoverage] ObjectLiteral
components/AnaestheticsCCView.tsx:666:25
                     </h3>
                     <div className="space-y-4">
                       {[
-                        {
-                          title: 'Cellular Physiology',
-                          desc: 'Transport mechanisms, resting membrane potential, and cellular signaling.'
-                        },
+                        {},
                         {
                           title: 'Cardiovascular',

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:680:33
                         },
                         {
                           title: 'Renal',
-                          desc: 'GFR, tubular function, acid-base balance, and electrolyte regulation.'
+                          desc: ""
                         },
                         {

[NoCoverage] ObjectLiteral
components/AnaestheticsCCView.tsx:682:25
                           title: 'Renal',
                           desc: 'GFR, tubular function, acid-base balance, and electrolyte regulation.'
                         },
-                        {
-                          title: 'Neurophysiology',
-                          desc: 'CSF, cerebral blood flow, ANS, and pain pathways.'
-                        },
+                        {},
                         {
                           title: 'Hepatic & GI',

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:684:33
                         },
                         {
                           title: 'Neurophysiology',
-                          desc: 'CSF, cerebral blood flow, ANS, and pain pathways.'
+                          desc: ""
                         },
                         {

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:687:34
                           desc: 'CSF, cerebral blood flow, ANS, and pain pathways.'
                         },
                         {
-                          title: 'Hepatic & GI',
+                          title: "",
                           desc: 'Liver function, metabolism, and gastric emptying.'
                         }

[NoCoverage] ArrowFunction
components/AnaestheticsCCView.tsx:690:29
                           title: 'Hepatic & GI',
                           desc: 'Liver function, metabolism, and gastric emptying.'
                         }
-                      ].map((obj, i) => (
-                        <div
-                          key={i}
-                          className="p-5 bg-slate-950/20 rounded-2xl border border-white/5 hover:border-rose-200 transition-colors group"
-                        >
-                          <h4 className="text-xs font-black text-white mb-1 group-hover:text-rose-600 transition-colors">
-                            {obj.title}
-                          </h4>
-                          <p className="text-[11px] text-slate-400 font-medium leading-relaxed">
-                            {obj.desc}
-                          </p>
-                        </div>
-                      ))}
+                      ].map(() => undefined)}
                     </div>
                   </div>

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:720:33
                         },
                         {
                           title: 'Induction Agents',
-                          desc: 'Propofol, Thiopentone, Ketamine: mechanisms and clinical effects.'
+                          desc: ""
                         },
                         {

[NoCoverage] ObjectLiteral
components/AnaestheticsCCView.tsx:722:25
                           title: 'Induction Agents',
                           desc: 'Propofol, Thiopentone, Ketamine: mechanisms and clinical effects.'
                         },
-                        {
-                          title: 'Inhalational Agents',
-                          desc: 'MAC, uptake/distribution, and organ-specific toxicity.'
-                        },
+                        {},
                         {
                           title: 'Muscle Relaxants',

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:723:34
                           desc: 'Propofol, Thiopentone, Ketamine: mechanisms and clinical effects.'
                         },
                         {
-                          title: 'Inhalational Agents',
+                          title: "",
                           desc: 'MAC, uptake/distribution, and organ-specific toxicity.'
                         },

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:724:33
                         },
                         {
                           title: 'Inhalational Agents',
-                          desc: 'MAC, uptake/distribution, and organ-specific toxicity.'
+                          desc: ""
                         },
                         {

[NoCoverage] ObjectLiteral
components/AnaestheticsCCView.tsx:726:25
                           title: 'Inhalational Agents',
                           desc: 'MAC, uptake/distribution, and organ-specific toxicity.'
                         },
-                        {
-                          title: 'Muscle Relaxants',
-                          desc: 'Neuromuscular blockade mechanisms and reversal (Sugammadex).'
-                        },
+                        {},
                         {
                           title: 'Analgesics',

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:727:34
                           desc: 'MAC, uptake/distribution, and organ-specific toxicity.'
                         },
                         {
-                          title: 'Muscle Relaxants',
+                          title: "",
                           desc: 'Neuromuscular blockade mechanisms and reversal (Sugammadex).'
                         },

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:731:34
                           desc: 'Neuromuscular blockade mechanisms and reversal (Sugammadex).'
                         },
                         {
-                          title: 'Analgesics',
+                          title: "",
                           desc: 'Opioids, NSAIDs, and multimodal analgesia principles.'
                         },

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:732:33
                         },
                         {
                           title: 'Analgesics',
-                          desc: 'Opioids, NSAIDs, and multimodal analgesia principles.'
+                          desc: ""
                         },
                         {

[NoCoverage] ArrowFunction
components/AnaestheticsCCView.tsx:738:29
                           title: 'Local Anaesthetics',
                           desc: 'Mechanism of action, LAST, and specific agent profiles.'
                         }
-                      ].map((obj, i) => (
-                        <div
-                          key={i}
-                          className="p-5 bg-slate-950/20 rounded-2xl border border-white/5 hover:border-indigo-200 transition-colors group"
-                        >
-                          <h4 className="text-xs font-black text-white mb-1 group-hover:text-indigo-600 transition-colors">
-                            {obj.title}
-                          </h4>
-                          <p className="text-[11px] text-slate-400 font-medium leading-relaxed">
-                            {obj.desc}
-                          </p>
-                        </div>
-                      ))}
+                      ].map(() => undefined)}
                     </div>
                   </div>

[NoCoverage] EqualityOperator
components/AnaestheticsCCView.tsx:778:37
             className="bg-slate-950/40 rounded-[48px] border border-white/5 shadow-xl p-10 min-h-[500px] flex flex-col items-center justify-center text-center"
           >
             <div className="w-24 h-24 bg-rose-950/20 rounded-[40px] flex items-center justify-center mb-8">
-              {mainTabs.find((t) => t.id === activeTab)?.icon}
+              {mainTabs.find((t) => t.id !== activeTab)?.icon}
             </div>
             <h2 className="text-3xl font-black text-white uppercase tracking-widest mb-4">

[NoCoverage] ArrowFunction
components/AnaestheticsCCView.tsx:778:30
             className="bg-slate-950/40 rounded-[48px] border border-white/5 shadow-xl p-10 min-h-[500px] flex flex-col items-center justify-center text-center"
           >
             <div className="w-24 h-24 bg-rose-950/20 rounded-[40px] flex items-center justify-center mb-8">
-              {mainTabs.find((t) => t.id === activeTab)?.icon}
+              {mainTabs.find(() => undefined)?.icon}
             </div>
             <h2 className="text-3xl font-black text-white uppercase tracking-widest mb-4">

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:781:37
               {mainTabs.find((t) => t.id === activeTab)?.icon}
             </div>
             <h2 className="text-3xl font-black text-white uppercase tracking-widest mb-4">
-              {mainTabs.find((t) => t.id === activeTab)?.name} Module
+              {mainTabs.find((t) => false)?.name} Module
             </h2>
             <p className="text-slate-400 max-w-lg font-medium text-lg">

[NoCoverage] EqualityOperator
components/AnaestheticsCCView.tsx:781:37
               {mainTabs.find((t) => t.id === activeTab)?.icon}
             </div>
             <h2 className="text-3xl font-black text-white uppercase tracking-widest mb-4">
-              {mainTabs.find((t) => t.id === activeTab)?.name} Module
+              {mainTabs.find((t) => t.id !== activeTab)?.name} Module
             </h2>
             <p className="text-slate-400 max-w-lg font-medium text-lg">

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:789:16
             </p>
 
             <div className="mt-12 grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-8 w-full text-left">
-              {activeTab === 'airway' && (
-                <>
-                  <div className="p-8 bg-slate-950/20 rounded-[32px] border border-white/5">
-                    <Ruler className="w-8 h-8 text-rose-500 mb-6" />
-                    <h4 className="font-black uppercase text-sm mb-3">ETT Sizing (Paediatric)</h4>
-                    <div className="space-y-2">
-                      <p className="text-xs text-slate-400 font-bold flex justify-between">
-                        <span>Uncuffed:</span> <span className="text-rose-600">(Age/4) + 4</span>
-                      </p>
-                      <p className="text-xs text-slate-400 font-bold flex justify-between">
-                        <span>Cuffed:</span> <span className="text-rose-600">(Age/4) + 3.5</span>
-                      </p>
-                    </div>
-                  </div>
-                  <div className="p-8 bg-slate-950/20 rounded-[32px] border border-white/5">
-                    <Box className="w-8 h-8 text-rose-500 mb-6" />
-                    <h4 className="font-black uppercase text-sm mb-3">Mallampati Score</h4>
-                    <p className="text-xs text-slate-400 font-bold leading-relaxed">
-                      Class I-IV visualization of soft palate, fauces, uvula, and pillars.
-                    </p>
-                  </div>
-                </>
-              )}
+              {true}
               {activeTab === 'mnemonics' && (
                 <div className="p-8 bg-slate-950/20 rounded-[32px] border border-white/5">

[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:789:16
             </p>
 
             <div className="mt-12 grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-8 w-full text-left">
-              {activeTab === 'airway' && (
+              {true && (
                 <>
                   <div className="p-8 bg-slate-950/20 rounded-[32px] border border-white/5">

[NoCoverage] EqualityOperator
components/AnaestheticsCCView.tsx:812:16
                   </div>
                 </>
               )}
-              {activeTab === 'mnemonics' && (
+              {activeTab !== 'mnemonics' && (
                 <div className="p-8 bg-slate-950/20 rounded-[32px] border border-white/5">
                   <Lightbulb className="w-8 h-8 text-amber-500 mb-6" />
