[NoCoverage] ConditionalExpression
components/AnaestheticsCCView.tsx:812:16
                   </div>
                 </>
               )}
-              {activeTab === 'mnemonics' && (
-                <div className="p-8 bg-slate-950/20 rounded-[32px] border border-white/5">
-                  <Lightbulb className="w-8 h-8 text-amber-500 mb-6" />
-                  <h4 className="font-black uppercase text-sm mb-4">LEMON (Airway)</h4>
-                  <ul className="space-y-2">
-                    {[
-                      'L: Look externally',
-                      'E: Evaluate 3-3-2',
-                      'M: Mallampati',
-                      'O: Obstruction',
-                      'N: Neck mobility'
-                    ].map((item, i) => (
-                      <li
-                        key={i}
-                        className="text-[11px] text-slate-400 font-bold flex items-center gap-2"
-                      >
-                        <div className="w-1 h-1 rounded-full bg-amber-400" />
-                        {item}
-                      </li>
-                    ))}
-                  </ul>
-                </div>
-              )}
+              {false}
             </div>
           </motion.div>

[NoCoverage] StringLiteral
components/AnaestheticsCCView.tsx:820:23
                     {[
                       'L: Look externally',
                       'E: Evaluate 3-3-2',
-                      'M: Mallampati',
+                      "",
                       'O: Obstruction',
                       'N: Neck mobility'

[NoCoverage] ArrowFunction
components/AnaestheticsCCView.tsx:823:27
                       'M: Mallampati',
                       'O: Obstruction',
                       'N: Neck mobility'
-                    ].map((item, i) => (
-                      <li
-                        key={i}
-                        className="text-[11px] text-slate-400 font-bold flex items-center gap-2"
-                      >
-                        <div className="w-1 h-1 rounded-full bg-amber-400" />
-                        {item}
-                      </li>
-                    ))}
+                    ].map(() => undefined)}
                   </ul>
                 </div>
