[NoCoverage] ObjectLiteral
components/ClinicalCalculatorsView.tsx:40:3
 }
 
 const CALCULATORS: CalculatorItem[] = [
-  {
-    id: 'gcs',
-    name: 'Glasgow Coma Scale',
-    category: 'Neurology',
-    description: 'Assess level of consciousness in trauma and acute illness.',
-    icon: Brain,
-    component: GCSCalculator
-  },
+  {},
   {
     id: 'wells-pe',

[NoCoverage] StringLiteral
components/ClinicalCalculatorsView.tsx:41:9
 
 const CALCULATORS: CalculatorItem[] = [
   {
-    id: 'gcs',
+    id: "",
     name: 'Glasgow Coma Scale',
     category: 'Neurology',

[NoCoverage] StringLiteral
components/ClinicalCalculatorsView.tsx:44:18
     id: 'gcs',
     name: 'Glasgow Coma Scale',
     category: 'Neurology',
-    description: 'Assess level of consciousness in trauma and acute illness.',
+    description: "",
     icon: Brain,
     component: GCSCalculator

[NoCoverage] StringLiteral
components/ClinicalCalculatorsView.tsx:50:11
   },
   {
     id: 'wells-pe',
-    name: 'Wells Score (PE)',
+    name: "",
     category: 'Respiratory',
     description: 'Clinical probability of Pulmonary Embolism.',

[NoCoverage] StringLiteral
components/ClinicalCalculatorsView.tsx:51:15
   {
     id: 'wells-pe',
     name: 'Wells Score (PE)',
-    category: 'Respiratory',
+    category: "",
     description: 'Clinical probability of Pulmonary Embolism.',
     icon: Wind,

[NoCoverage] StringLiteral
components/ClinicalCalculatorsView.tsx:52:18
     id: 'wells-pe',
     name: 'Wells Score (PE)',
     category: 'Respiratory',
-    description: 'Clinical probability of Pulmonary Embolism.',
+    description: "",
     icon: Wind,
     component: WellsPECalculator

[NoCoverage] StringLiteral
components/ClinicalCalculatorsView.tsx:66:11
   },
   {
     id: 'qsofa',
-    name: 'qSOFA Score',
+    name: "",
     category: 'Critical Care',
     description: 'Quick Sequential Organ Failure Assessment for sepsis risk.',

[NoCoverage] StringLiteral
components/ClinicalCalculatorsView.tsx:68:18
     id: 'qsofa',
     name: 'qSOFA Score',
     category: 'Critical Care',
-    description: 'Quick Sequential Organ Failure Assessment for sepsis risk.',
+    description: "",
     icon: AlertTriangle,
     component: QSOFACalculator

[NoCoverage] StringLiteral
components/ClinicalCalculatorsView.tsx:74:11
   },
   {
     id: 'bmi',
-    name: 'BMI Calculator',
+    name: "",
     category: 'General',
     description: 'Body Mass Index calculation for nutritional assessment.',

[NoCoverage] StringLiteral
components/ClinicalCalculatorsView.tsx:89:9
     component: CreatinineClearanceCalculator
   },
   {
-    id: 'chads-vasc',
+    id: "",
     name: 'CHA₂DS₂-VASc',
     category: 'Cardiology',

[NoCoverage] StringLiteral
components/ClinicalCalculatorsView.tsx:90:11
   },
   {
     id: 'chads-vasc',
-    name: 'CHA₂DS₂-VASc',
+    name: "",
     category: 'Cardiology',
     description: 'Stroke risk assessment in Atrial Fibrillation.',

[NoCoverage] StringLiteral
components/ClinicalCalculatorsView.tsx:92:18
     id: 'chads-vasc',
     name: 'CHA₂DS₂-VASc',
     category: 'Cardiology',
-    description: 'Stroke risk assessment in Atrial Fibrillation.',
+    description: "",
     icon: Heart,
     component: CHADSVAScCalculator

[NoCoverage] StringLiteral
components/ClinicalCalculatorsView.tsx:97:9
     component: CHADSVAScCalculator
   },
   {
-    id: 'map',
+    id: "",
     name: 'Mean Arterial Pressure',
     category: 'Cardiology',

[NoCoverage] ObjectLiteral
components/ClinicalCalculatorsView.tsx:104:3
     icon: Activity,
     component: MAPCalculator
   },
-  {
-    id: 'corrected-ca',
-    name: 'Corrected Calcium',
-    category: 'Biochemistry',
-    description: 'Adjust total calcium for albumin concentration.',
-    icon: Droplets,
-    component: CorrectedCalciumCalculator
-  },
+  {},
   {
     id: 'anion-gap',

[NoCoverage] StringLiteral
components/ClinicalCalculatorsView.tsx:107:15
   {
     id: 'corrected-ca',
     name: 'Corrected Calcium',
-    category: 'Biochemistry',
+    category: "",
     description: 'Adjust total calcium for albumin concentration.',
     icon: Droplets,

[NoCoverage] StringLiteral
components/ClinicalCalculatorsView.tsx:113:9
     component: CorrectedCalciumCalculator
   },
   {
-    id: 'anion-gap',
+    id: "",
     name: 'Anion Gap',
     category: 'Biochemistry',

[NoCoverage] StringLiteral
components/ClinicalCalculatorsView.tsx:114:11
   },
   {
     id: 'anion-gap',
-    name: 'Anion Gap',
+    name: "",
     category: 'Biochemistry',
     description: 'Calculate the difference between measured cations and anions.',

[NoCoverage] ArrayDeclaration
components/ClinicalCalculatorsView.tsx:126:94
   const [activeCalc, setActiveCalc] = useState<string | null>(null);
   const [searchQuery, setSearchQuery] = useState('');
 
-  const { results: filteredCalcs, didYouMean } = useClinicalSearch(CALCULATORS, searchQuery, [
-    'name',
-    'category'
-  ]);
+  const { results: filteredCalcs, didYouMean } = useClinicalSearch(CALCULATORS, searchQuery, []);
 
   const SelectedCalc = useMemo(() => {

[NoCoverage] BlockStatement
components/ClinicalCalculatorsView.tsx:131:38
     'category'
   ]);
 
-  const SelectedCalc = useMemo(() => {
-    return CALCULATORS.find((c) => c.id === activeCalc)?.component || null;
-  }, [activeCalc]);
+  const SelectedCalc = useMemo(() => {}, [activeCalc]);
 
   return (

[NoCoverage] ConditionalExpression
components/ClinicalCalculatorsView.tsx:132:12
   ]);
 
   const SelectedCalc = useMemo(() => {
-    return CALCULATORS.find((c) => c.id === activeCalc)?.component || null;
+    return true;
   }, [activeCalc]);
 

[NoCoverage] ArrowFunction
components/ClinicalCalculatorsView.tsx:132:29
   ]);
 
   const SelectedCalc = useMemo(() => {
-    return CALCULATORS.find((c) => c.id === activeCalc)?.component || null;
+    return CALCULATORS.find(() => undefined)?.component || null;
   }, [activeCalc]);
 

[NoCoverage] ArrayDeclaration
components/ClinicalCalculatorsView.tsx:133:6
 
   const SelectedCalc = useMemo(() => {
     return CALCULATORS.find((c) => c.id === activeCalc)?.component || null;
-  }, [activeCalc]);
+  }, []);
 
   return (

[NoCoverage] ConditionalExpression
components/ClinicalCalculatorsView.tsx:166:12
             />
           </div>
 
-          {didYouMean && (
-            <div className="flex justify-start">
-              <button
-                onClick={() => setSearchQuery(didYouMean)}
-                className="flex items-center gap-2 px-4 py-2 bg-indigo-950/20 hover:bg-indigo-100 text-indigo-600 rounded-xl transition-all shadow-sm w-full"
-              >
-                <span className="text-[10px] font-black uppercase tracking-widest text-indigo-400 shrink-0">
-                  Did you mean
-                </span>
-                <span className="text-xs font-bold border-b border-indigo-600 border-dashed truncate">
-                  {didYouMean}
-                </span>
-                <span className="text-[10px] font-black uppercase tracking-widest text-indigo-400 shrink-0">
-                  ?
-                </span>
-              </button>
-            </div>
-          )}
+          {false}
 
           <div className="space-y-2">

[NoCoverage] ConditionalExpression
components/ClinicalCalculatorsView.tsx:166:12
             />
           </div>
 
-          {didYouMean && (
-            <div className="flex justify-start">
-              <button
-                onClick={() => setSearchQuery(didYouMean)}
-                className="flex items-center gap-2 px-4 py-2 bg-indigo-950/20 hover:bg-indigo-100 text-indigo-600 rounded-xl transition-all shadow-sm w-full"
-              >
-                <span className="text-[10px] font-black uppercase tracking-widest text-indigo-400 shrink-0">
-                  Did you mean
-                </span>
-                <span className="text-xs font-bold border-b border-indigo-600 border-dashed truncate">
-                  {didYouMean}
-                </span>
-                <span className="text-[10px] font-black uppercase tracking-widest text-indigo-400 shrink-0">
-                  ?
-                </span>
-              </button>
-            </div>
-          )}
+          {true}
 
           <div className="space-y-2">

[NoCoverage] ArrowFunction
components/ClinicalCalculatorsView.tsx:189:26
             {filteredCalcs.map((calc) => (
               <button
                 key={calc.id}
-                onClick={() => setActiveCalc(calc.id)}
+                onClick={() => undefined}
                 className={`w-full flex items-center gap-4 p-4 rounded-2xl transition-all text-left ${
                   activeCalc === calc.id

[NoCoverage] EqualityOperator
components/ClinicalCalculatorsView.tsx:191:19
                 key={calc.id}
                 onClick={() => setActiveCalc(calc.id)}
                 className={`w-full flex items-center gap-4 p-4 rounded-2xl transition-all text-left ${
-                  activeCalc === calc.id
+                  activeCalc !== calc.id
                     ? 'bg-indigo-600 text-white shadow-lg shadow-indigo-950/40'
                     : 'bg-slate-950/40 border border-white/5 text-slate-400 hover:border-white/5'

[NoCoverage] ConditionalExpression
components/ClinicalCalculatorsView.tsx:191:19
                 key={calc.id}
                 onClick={() => setActiveCalc(calc.id)}
                 className={`w-full flex items-center gap-4 p-4 rounded-2xl transition-all text-left ${
-                  activeCalc === calc.id
+                  true
                     ? 'bg-indigo-600 text-white shadow-lg shadow-indigo-950/40'
                     : 'bg-slate-950/40 border border-white/5 text-slate-400 hover:border-white/5'

[NoCoverage] StringLiteral
components/ClinicalCalculatorsView.tsx:193:23
                 className={`w-full flex items-center gap-4 p-4 rounded-2xl transition-all text-left ${
                   activeCalc === calc.id
                     ? 'bg-indigo-600 text-white shadow-lg shadow-indigo-950/40'
-                    : 'bg-slate-950/40 border border-white/5 text-slate-400 hover:border-white/5'
+                    : ""
                 }`}
               >

[NoCoverage] EqualityOperator
components/ClinicalCalculatorsView.tsx:198:21
               >
                 <div
                   className={`w-10 h-10 rounded-xl flex items-center justify-center ${
-                    activeCalc === calc.id
+                    activeCalc !== calc.id
                       ? 'bg-slate-950/40/20'
                       : 'bg-indigo-950/20 text-indigo-600'

[NoCoverage] ConditionalExpression
components/ClinicalCalculatorsView.tsx:198:21
               >
                 <div
                   className={`w-10 h-10 rounded-xl flex items-center justify-center ${
-                    activeCalc === calc.id
+                    true
                       ? 'bg-slate-950/40/20'
                       : 'bg-indigo-950/20 text-indigo-600'

[NoCoverage] ConditionalExpression
components/ClinicalCalculatorsView.tsx:212:62
                   </div>
                 </div>
                 <ChevronRight
-                  className={`w-4 h-4 transition-transform ${activeCalc === calc.id ? 'rotate-90' : ''}`}
+                  className={`w-4 h-4 transition-transform ${true ? 'rotate-90' : ''}`}
                 />
               </button>

[NoCoverage] ConditionalExpression
components/ClinicalCalculatorsView.tsx:212:62
                   </div>
                 </div>
                 <ChevronRight
-                  className={`w-4 h-4 transition-transform ${activeCalc === calc.id ? 'rotate-90' : ''}`}
+                  className={`w-4 h-4 transition-transform ${false ? 'rotate-90' : ''}`}
                 />
               </button>

[NoCoverage] ObjectLiteral
components/ClinicalCalculatorsView.tsx:226:26
               <motion.div
                 key={activeCalc}
                 initial={{ opacity: 0, x: 20 }}
-                animate={{ opacity: 1, x: 0 }}
+                animate={{}}
                 exit={{ opacity: 0, x: -20 }}
                 className="bg-slate-950/40 rounded-[40px] border border-white/5 shadow-sm p-10"

[NoCoverage] BlockStatement
components/ClinicalCalculatorsView.tsx:232:29
               >
                 <div className="flex items-center gap-4 mb-10">
                   <div className="w-16 h-16 bg-indigo-950/20 rounded-3xl flex items-center justify-center">
-                    {(() => {
-                      const Icon = CALCULATORS.find((c) => c.id === activeCalc)?.icon || Calculator;
-                      return <Icon className="w-8 h-8 text-indigo-600" />;
-                    })()}
+                    {(() => {})()}
                   </div>
                   <div>

[NoCoverage] ArrowFunction
components/ClinicalCalculatorsView.tsx:233:53
                 <div className="flex items-center gap-4 mb-10">
                   <div className="w-16 h-16 bg-indigo-950/20 rounded-3xl flex items-center justify-center">
                     {(() => {
-                      const Icon = CALCULATORS.find((c) => c.id === activeCalc)?.icon || Calculator;
+                      const Icon = CALCULATORS.find(() => undefined)?.icon || Calculator;
                       return <Icon className="w-8 h-8 text-indigo-600" />;
                     })()}

[NoCoverage] ConditionalExpression
components/ClinicalCalculatorsView.tsx:233:36
                 <div className="flex items-center gap-4 mb-10">
                   <div className="w-16 h-16 bg-indigo-950/20 rounded-3xl flex items-center justify-center">
                     {(() => {
-                      const Icon = CALCULATORS.find((c) => c.id === activeCalc)?.icon || Calculator;
+                      const Icon = true;
                       return <Icon className="w-8 h-8 text-indigo-600" />;
                     })()}

[NoCoverage] EqualityOperator
components/ClinicalCalculatorsView.tsx:239:48
                   </div>
                   <div>
                     <h2 className="text-3xl font-black text-white uppercase tracking-tight">
-                      {CALCULATORS.find((c) => c.id === activeCalc)?.name}
+                      {CALCULATORS.find((c) => c.id !== activeCalc)?.name}
                     </h2>
                     <p className="text-slate-400 font-medium">

[NoCoverage] ConditionalExpression
components/ClinicalCalculatorsView.tsx:239:48
                   </div>
                   <div>
                     <h2 className="text-3xl font-black text-white uppercase tracking-tight">
-                      {CALCULATORS.find((c) => c.id === activeCalc)?.name}
+                      {CALCULATORS.find((c) => true)?.name}
                     </h2>
                     <p className="text-slate-400 font-medium">

[NoCoverage] EqualityOperator
components/ClinicalCalculatorsView.tsx:242:48
                       {CALCULATORS.find((c) => c.id === activeCalc)?.name}
                     </h2>
                     <p className="text-slate-400 font-medium">
-                      {CALCULATORS.find((c) => c.id === activeCalc)?.description}
+                      {CALCULATORS.find((c) => c.id !== activeCalc)?.description}
                     </p>
                   </div>

[NoCoverage] ConditionalExpression
components/ClinicalCalculatorsView.tsx:242:48
                       {CALCULATORS.find((c) => c.id === activeCalc)?.name}
                     </h2>
                     <p className="text-slate-400 font-medium">
-                      {CALCULATORS.find((c) => c.id === activeCalc)?.description}
+                      {CALCULATORS.find((c) => false)?.description}
                     </p>
                   </div>

[NoCoverage] ConditionalExpression
components/ClinicalCalculatorsView.tsx:247:18
                   </div>
                 </div>
 
-                {SelectedCalc && <SelectedCalc />}
+                {false}
 
                 <div className="mt-10 p-6 bg-slate-950/20 rounded-2xl border border-white/5 flex items-start gap-4">

[NoCoverage] ConditionalExpression
components/ClinicalCalculatorsView.tsx:247:18
                   </div>
                 </div>
 
-                {SelectedCalc && <SelectedCalc />}
+                {true}
 
                 <div className="mt-10 p-6 bg-slate-950/20 rounded-2xl border border-white/5 flex items-start gap-4">
