[NoCoverage] ConditionalExpression
components/ClinicalCorrelationView.tsx:629:8
         </div>
       )}
 
-      {loading && !correlation && !synthesis && (
-        <div className="flex flex-col items-center justify-center py-24 space-y-6">
-          <div className="relative">
-            <div className={`w-20 h-20 border-4 border-rose-955 rounded-full`}></div>
-            <div
-              className={`w-20 h-20 border-4 border-rose-600 border-t-transparent rounded-full animate-spin absolute top-0`}
-            ></div>
-            <Activity className="w-8 h-8 text-rose-600 absolute top-1/2 left-1/2 -translate-x-1/2 -translate-y-1/2" />
-          </div>
-          <div className="text-center">
-            <p className="text-[11px] font-black uppercase text-slate-400 tracking-[0.4em] mb-2">
-              Neural Mapping Phase
-            </p>
-            <p className="text-[9px] font-bold text-slate-400 italic">
-              Synthesizing multi-modal medical diagrams...
-            </p>
-          </div>
-        </div>
-      )}
+      {false}
 
       {correlation && mode === 'correlation' && (

[NoCoverage] LogicalOperator
components/ClinicalCorrelationView.tsx:629:8
         </div>
       )}
 
-      {loading && !correlation && !synthesis && (
+      {loading || !correlation && !synthesis && (
         <div className="flex flex-col items-center justify-center py-24 space-y-6">
           <div className="relative">

[NoCoverage] StringLiteral
components/ClinicalCorrelationView.tsx:632:29
       {loading && !correlation && !synthesis && (
         <div className="flex flex-col items-center justify-center py-24 space-y-6">
           <div className="relative">
-            <div className={`w-20 h-20 border-4 border-rose-955 rounded-full`}></div>
+            <div className={``}></div>
             <div
               className={`w-20 h-20 border-4 border-rose-600 border-t-transparent rounded-full animate-spin absolute top-0`}

[NoCoverage] ConditionalExpression
components/ClinicalCorrelationView.tsx:649:23
         </div>
       )}
 
-      {correlation && mode === 'correlation' && (
+      {correlation && true && (
         <CorrelationTab
           correlation={correlation}

[NoCoverage] LogicalOperator
components/ClinicalCorrelationView.tsx:649:8
         </div>
       )}
 
-      {correlation && mode === 'correlation' && (
+      {correlation || mode === 'correlation' && (
         <CorrelationTab
           correlation={correlation}

[NoCoverage] ConditionalExpression
components/ClinicalCorrelationView.tsx:662:8
         />
       )}
 
-      {synthesis && mode === 'synthesis' && (
-        <SynthesisTab
-          synthesis={synthesis}
-          loading={loading}
-          isRefined={isRefined}
-          isProMode={isProMode}
-          clarifyingQuestions={clarifyingQuestions}
-          clarifyingResponses={clarifyingResponses}
-          isGeneratingQuestions={isGeneratingQuestions}
-          findings={findings}
-          patientContext={patientContext}
-          handleSearch={handleSearch}
-          handleGenerateClarifyingQuestions={handleGenerateClarifyingQuestions}
-          handleResponseChange={handleResponseChange}
-          handleSubmitResponses={handleSubmitResponses}
-          setSynthesis={setSynthesis}
-          setFindings={setFindings}
-          setQuery={setQuery}
-          setClarifyingQuestions={setClarifyingQuestions}
-          setClarifyingResponses={setClarifyingResponses}
-          setPatientContext={setPatientContext}
-          setShowContext={setShowContext}
-          onNavigateToInvestigations={onNavigateToInvestigations}
-        />
-      )}
+      {true}
 
       {enlargedImage && (

[NoCoverage] ConditionalExpression
components/ClinicalCorrelationView.tsx:662:8
         />
       )}
 
-      {synthesis && mode === 'synthesis' && (
+      {true && (
         <SynthesisTab
           synthesis={synthesis}

[NoCoverage] ConditionalExpression
components/ClinicalCorrelationView.tsx:688:8
         />
       )}
 
-      {enlargedImage && (
-        <ImageModal
-          src={enlargedImage.src}
-          alt={enlargedImage.alt}
-          onClose={() => setEnlargedImage(null)}
-        />
-      )}
+      {true}
     </div>
   );
