[NoCoverage] BooleanLiteral
components/ClinicalFinder.tsx:23:42
 
 const ClinicalFinder: React.FC<ClinicalFinderProps> = ({ onNavigateToGlossary }) => {
   const [query, setQuery] = useState('');
-  const [loading, setLoading] = useState(false);
+  const [loading, setLoading] = useState(true);
   const [condition, setCondition] = useState<ClinicalCondition | null>(null);
   const [error, setError] = useState<string | null>(null);

[NoCoverage] BlockStatement
components/ClinicalFinder.tsx:29:55
 
   const gemini = new GeminiService();
 
-  const handleSearch = async (e?: React.FormEvent) => {
-    e?.preventDefault();
-    if (!query.trim()) return;
-
-    setLoading(true);
-    setError(null);
-    try {
-      const result = await gemini.getFindingsForCondition(query);
-      setCondition(result);
-    } catch (err) {
-      setError('Condition analysis failed. Please try a common clinical term.');
-      console.error(err);
-    } finally {
-      setLoading(false);
-    }
-  };
+  const handleSearch = async (e?: React.FormEvent) => {};
 
   return (

[NoCoverage] OptionalChaining
components/ClinicalFinder.tsx:30:5
   const gemini = new GeminiService();
 
   const handleSearch = async (e?: React.FormEvent) => {
-    e?.preventDefault();
+    e.preventDefault();
     if (!query.trim()) return;
 

[NoCoverage] BooleanLiteral
components/ClinicalFinder.tsx:31:9
 
   const handleSearch = async (e?: React.FormEvent) => {
     e?.preventDefault();
-    if (!query.trim()) return;
+    if (query.trim()) return;
 
     setLoading(true);

[NoCoverage] MethodExpression
components/ClinicalFinder.tsx:31:10
 
   const handleSearch = async (e?: React.FormEvent) => {
     e?.preventDefault();
-    if (!query.trim()) return;
+    if (!query) return;
 
     setLoading(true);

[NoCoverage] BlockStatement
components/ClinicalFinder.tsx:35:9
 
     setLoading(true);
     setError(null);
-    try {
-      const result = await gemini.getFindingsForCondition(query);
-      setCondition(result);
-    } catch (err) {
+    try {} catch (err) {
       setError('Condition analysis failed. Please try a common clinical term.');
       console.error(err);

[NoCoverage] BlockStatement
components/ClinicalFinder.tsx:38:19
     try {
       const result = await gemini.getFindingsForCondition(query);
       setCondition(result);
-    } catch (err) {
-      setError('Condition analysis failed. Please try a common clinical term.');
-      console.error(err);
-    } finally {
+    } catch (err) {} finally {
       setLoading(false);
     }

[NoCoverage] StringLiteral
components/ClinicalFinder.tsx:39:16
       const result = await gemini.getFindingsForCondition(query);
       setCondition(result);
     } catch (err) {
-      setError('Condition analysis failed. Please try a common clinical term.');
+      setError("");
       console.error(err);
     } finally {

[NoCoverage] BlockStatement
components/ClinicalFinder.tsx:41:15
     } catch (err) {
       setError('Condition analysis failed. Please try a common clinical term.');
       console.error(err);
-    } finally {
-      setLoading(false);
-    }
+    } finally {}
   };
 

[NoCoverage] ConditionalExpression
components/ClinicalFinder.tsx:87:8
         </button>
       </form>
 
-      {error && (
-        <div className="p-6 bg-red-950/40 border border-red-500/25 rounded-3xl text-red-400 text-[11px] font-black uppercase tracking-widest flex items-center gap-3">
-          <Zap className="w-4 h-4" />
-          {error}
-        </div>
-      )}
+      {true}
 
       {loading && !condition && (

[NoCoverage] ConditionalExpression
components/ClinicalFinder.tsx:87:8
         </button>
       </form>
 
-      {error && (
-        <div className="p-6 bg-red-950/40 border border-red-500/25 rounded-3xl text-red-400 text-[11px] font-black uppercase tracking-widest flex items-center gap-3">
-          <Zap className="w-4 h-4" />
-          {error}
-        </div>
-      )}
+      {false}
 
       {loading && !condition && (

[NoCoverage] BooleanLiteral
components/ClinicalFinder.tsx:94:19
         </div>
       )}
 
-      {loading && !condition && (
+      {loading && condition && (
         <div className="flex flex-col items-center justify-center py-20 space-y-4">
           <div className="relative">

[NoCoverage] LogicalOperator
components/ClinicalFinder.tsx:94:8
         </div>
       )}
 
-      {loading && !condition && (
-        <div className="flex flex-col items-center justify-center py-20 space-y-4">
-          <div className="relative">
-            <div className="w-16 h-16 border-4 border-indigo-950/40 rounded-full"></div>
-            <div className="w-16 h-16 border-4 border-indigo-600 border-t-transparent rounded-full animate-spin absolute top-0"></div>
-          </div>
-          <p className="text-[10px] font-black uppercase text-slate-400 tracking-[0.2em] animate-pulse">
-            Deep Mapping Condition Stigmata...
-          </p>
-        </div>
-      )}
+      {loading && !condition || <div className="flex flex-col items-center justify-center py-20 space-y-4">
+          <div className="relative">
+            <div className="w-16 h-16 border-4 border-indigo-950/40 rounded-full"></div>
+            <div className="w-16 h-16 border-4 border-indigo-600 border-t-transparent rounded-full animate-spin absolute top-0"></div>
+          </div>
+          <p className="text-[10px] font-black uppercase text-slate-400 tracking-[0.2em] animate-pulse">
+            Deep Mapping Condition Stigmata...
+          </p>
+        </div>}
 
       {condition && (

[NoCoverage] ConditionalExpression
components/ClinicalFinder.tsx:130:24
 
           <div className="grid grid-cols-1 md:grid-cols-2 gap-6">
             {Array.from(
-              new Set((condition.findings || []).map((f) => f.category || 'General'))
+              new Set((true).map((f) => f.category || 'General'))
             ).map((cat, catIdx) => (
               <div

[NoCoverage] LogicalOperator
components/ClinicalFinder.tsx:130:24
 
           <div className="grid grid-cols-1 md:grid-cols-2 gap-6">
             {Array.from(
-              new Set((condition.findings || []).map((f) => f.category || 'General'))
+              new Set((condition.findings && []).map((f) => f.category || 'General'))
             ).map((cat, catIdx) => (
               <div

[NoCoverage] ConditionalExpression
components/ClinicalFinder.tsx:141:21
                   {cat}
                 </h3>
                 <div className="space-y-4">
-                  {(condition.findings || [])
+                  {(false)
                     .filter((f) => (f.category || 'General') === cat)
                     .map((f, i) => (

[NoCoverage] LogicalOperator
components/ClinicalFinder.tsx:141:21
                   {cat}
                 </h3>
                 <div className="space-y-4">
-                  {(condition.findings || [])
+                  {(condition.findings && [])
                     .filter((f) => (f.category || 'General') === cat)
                     .map((f, i) => (

[NoCoverage] ArrowFunction
components/ClinicalFinder.tsx:142:29
                 </h3>
                 <div className="space-y-4">
                   {(condition.findings || [])
-                    .filter((f) => (f.category || 'General') === cat)
+                    .filter(() => undefined)
                     .map((f, i) => (
                       <div key={`${cat}-${f.sign}-${i}`} className="flex gap-4 group/item">

[NoCoverage] LogicalOperator
components/ClinicalFinder.tsx:142:37
                 </h3>
                 <div className="space-y-4">
                   {(condition.findings || [])
-                    .filter((f) => (f.category || 'General') === cat)
+                    .filter((f) => (f.category && 'General') === cat)
                     .map((f, i) => (
                       <div key={`${cat}-${f.sign}-${i}`} className="flex gap-4 group/item">

[NoCoverage] ArrowFunction
components/ClinicalFinder.tsx:194:24
 
           <div className="p-10 text-center">
             <button
-              onClick={() => setCondition(null)}
+              onClick={() => undefined}
             >
