[NoCoverage] ArrayDeclaration
components/CommandPalette.tsx:33:82
 const CommandPalette: React.FC<CommandPaletteProps> = ({ isOpen, onClose, onNavigate, exams }) => {
   const [query, setQuery] = useState('');
   const [selectedIndex, setSelectedIndex] = useState(0);
-  const [foundationalResults, setFoundationalResults] = useState<SearchResult[]>([]);
+  const [foundationalResults, setFoundationalResults] = useState<SearchResult[]>(["Stryker was here"]);
   const [currentPage, setCurrentPage] = useState(1);
   const [totalResults, setTotalResults] = useState(0);

[NoCoverage] BooleanLiteral
components/CommandPalette.tsx:36:42
   const [foundationalResults, setFoundationalResults] = useState<SearchResult[]>([]);
   const [currentPage, setCurrentPage] = useState(1);
   const [totalResults, setTotalResults] = useState(0);
-  const [hasMore, setHasMore] = useState(false);
+  const [hasMore, setHasMore] = useState(true);
   const [selectedDoc, setSelectedDoc] = useState<SearchDocument | null>(null);
   const inputRef = useRef<HTMLInputElement>(null);

[NoCoverage] ObjectLiteral
components/CommandPalette.tsx:41:5
   const inputRef = useRef<HTMLInputElement>(null);
 
   const views = [
-    {
-      id: 'library',
-      label: 'Repository',
-      icon: <BookOpen className="w-4 h-4" />,
-      view: 'library' as AppView
-    },
+    {},
     {
       id: 'dashboard',

[NoCoverage] ObjectLiteral
components/CommandPalette.tsx:53:5
       icon: <GraduationCap className="w-4 h-4" />,
       view: 'dashboard' as AppView
     },
-    {
-      id: 'vault',
-      label: 'Knowledge Vault',
-      icon: <FolderArchive className="w-4 h-4" />,
-      view: 'vault' as AppView
-    },
+    {},
     {
       id: 'glossary',

[NoCoverage] StringLiteral
components/CommandPalette.tsx:54:11
       view: 'dashboard' as AppView
     },
     {
-      id: 'vault',
+      id: "",
       label: 'Knowledge Vault',
       icon: <FolderArchive className="w-4 h-4" />,

[NoCoverage] StringLiteral
components/CommandPalette.tsx:60:11
       view: 'vault' as AppView
     },
     {
-      id: 'glossary',
+      id: "",
       label: 'Glossary',
       icon: <Terminal className="w-4 h-4" />,

[NoCoverage] StringLiteral
components/CommandPalette.tsx:72:11
       view: 'correlation' as AppView
     },
     {
-      id: 'finder',
+      id: "",
       label: 'Clinical Finder',
       icon: <Microscope className="w-4 h-4" />,

[NoCoverage] StringLiteral
components/CommandPalette.tsx:84:11
       view: 'investigations' as AppView
     },
     {
-      id: 'therapeuticNavigator',
+      id: "",
       label: 'Therapeutics',
       icon: <Zap className="w-4 h-4" />,

[NoCoverage] ObjectLiteral
components/CommandPalette.tsx:89:5
       icon: <Zap className="w-4 h-4" />,
       view: 'therapeuticNavigator' as AppView
     },
-    {
-      id: 'pharmacology',
-      label: 'Pharmacology',
-      icon: <Pill className="w-4 h-4" />,
-      view: 'pharmacology' as AppView
-    },
+    {},
     {
       id: 'dermRevisor',

[NoCoverage] StringLiteral
components/CommandPalette.tsx:91:14
     },
     {
       id: 'pharmacology',
-      label: 'Pharmacology',
+      label: "",
       icon: <Pill className="w-4 h-4" />,
       view: 'pharmacology' as AppView

[NoCoverage] MethodExpression
components/CommandPalette.tsx:103:25
     }
   ];
 
-  const filteredViews = views.filter((v) => v.label.toLowerCase().includes(query.toLowerCase()));
+  const filteredViews = views;
   const filteredExams = exams
     .filter((e) => e.name.toLowerCase().includes(query.toLowerCase()))

[NoCoverage] MethodExpression
components/CommandPalette.tsx:103:76
     }
   ];
 
-  const filteredViews = views.filter((v) => v.label.toLowerCase().includes(query.toLowerCase()));
+  const filteredViews = views.filter((v) => v.label.toLowerCase().includes(query.toUpperCase()));
   const filteredExams = exams
     .filter((e) => e.name.toLowerCase().includes(query.toLowerCase()))

[NoCoverage] MethodExpression
components/CommandPalette.tsx:104:25
   ];
 
   const filteredViews = views.filter((v) => v.label.toLowerCase().includes(query.toLowerCase()));
-  const filteredExams = exams
-    .filter((e) => e.name.toLowerCase().includes(query.toLowerCase()))
-    .slice(0, 5);
+  const filteredExams = exams.filter(e => e.name.toLowerCase().includes(query.toLowerCase()));
 
   // Combine standard navigation items

[NoCoverage] MethodExpression
components/CommandPalette.tsx:104:25
   ];
 
   const filteredViews = views.filter((v) => v.label.toLowerCase().includes(query.toLowerCase()));
-  const filteredExams = exams
-    .filter((e) => e.name.toLowerCase().includes(query.toLowerCase()))
+  const filteredExams = exams
     .slice(0, 5);
 

[NoCoverage] ArrowFunction
components/CommandPalette.tsx:105:13
 
   const filteredViews = views.filter((v) => v.label.toLowerCase().includes(query.toLowerCase()));
   const filteredExams = exams
-    .filter((e) => e.name.toLowerCase().includes(query.toLowerCase()))
+    .filter(() => undefined)
     .slice(0, 5);
 

[NoCoverage] MethodExpression
components/CommandPalette.tsx:105:20
 
   const filteredViews = views.filter((v) => v.label.toLowerCase().includes(query.toLowerCase()));
   const filteredExams = exams
-    .filter((e) => e.name.toLowerCase().includes(query.toLowerCase()))
+    .filter((e) => e.name.toUpperCase().includes(query.toLowerCase()))
     .slice(0, 5);
 

[NoCoverage] BooleanLiteral
components/CommandPalette.tsx:109:91
     .slice(0, 5);
 
   // Combine standard navigation items
-  const standardResults = [...filteredViews, ...filteredExams.map((e) => ({ ...e, isExam: true }))];
+  const standardResults = [...filteredViews, ...filteredExams.map((e) => ({ ...e, isExam: false }))];
 
   // We keep keyboard navigation focused on standard results + loaded foundational results

[NoCoverage] ArrowFunction
components/CommandPalette.tsx:109:67
     .slice(0, 5);
 
   // Combine standard navigation items
-  const standardResults = [...filteredViews, ...filteredExams.map((e) => ({ ...e, isExam: true }))];
+  const standardResults = [...filteredViews, ...filteredExams.map(() => undefined)];
 
   // We keep keyboard navigation focused on standard results + loaded foundational results

[NoCoverage] ArrowFunction
components/CommandPalette.tsx:114:32
   // We keep keyboard navigation focused on standard results + loaded foundational results
   const results = [
     ...standardResults,
-    ...foundationalResults.map((r) => ({ ...r.document, isFoundational: true }))
+    ...foundationalResults.map(() => undefined)
   ];
 

[NoCoverage] BooleanLiteral
components/CommandPalette.tsx:114:73
   // We keep keyboard navigation focused on standard results + loaded foundational results
   const results = [
     ...standardResults,
-    ...foundationalResults.map((r) => ({ ...r.document, isFoundational: true }))
+    ...foundationalResults.map((r) => ({ ...r.document, isFoundational: false }))
   ];
 

[NoCoverage] BlockStatement
components/CommandPalette.tsx:118:19
   ];
 
   // Run search query
-  useEffect(() => {
-    if (query.trim().length > 1) {
-      const res = localSearchService.search(query, 1, PAGE_SIZE);
-      setFoundationalResults(res.results);
-      setCurrentPage(1);
-      setTotalResults(res.totalResults);
-      setHasMore(res.hasMore);
-    } else {
-      setFoundationalResults([]);
-      setTotalResults(0);
-      setHasMore(false);
-    }
-  }, [query]);
+  useEffect(() => {}, [query]);
 
   // Load next page

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:119:9
 
   // Run search query
   useEffect(() => {
-    if (query.trim().length > 1) {
+    if (false) {
       const res = localSearchService.search(query, 1, PAGE_SIZE);
       setFoundationalResults(res.results);

[NoCoverage] EqualityOperator
components/CommandPalette.tsx:119:9
 
   // Run search query
   useEffect(() => {
-    if (query.trim().length > 1) {
+    if (query.trim().length <= 1) {
       const res = localSearchService.search(query, 1, PAGE_SIZE);
       setFoundationalResults(res.results);

[NoCoverage] BlockStatement
components/CommandPalette.tsx:125:12
       setCurrentPage(1);
       setTotalResults(res.totalResults);
       setHasMore(res.hasMore);
-    } else {
-      setFoundationalResults([]);
-      setTotalResults(0);
-      setHasMore(false);
-    }
+    } else {}
   }, [query]);
 

[NoCoverage] BooleanLiteral
components/CommandPalette.tsx:128:18
     } else {
       setFoundationalResults([]);
       setTotalResults(0);
-      setHasMore(false);
+      setHasMore(true);
     }
   }, [query]);

[NoCoverage] BlockStatement
components/CommandPalette.tsx:133:30
   }, [query]);
 
   // Load next page
-  const loadNextPage = () => {
-    if (!hasMore) return;
-    const nextPage = currentPage + 1;
-    const res = localSearchService.search(query, nextPage, PAGE_SIZE);
-    setFoundationalResults((prev) => [...prev, ...res.results]);
-    setCurrentPage(nextPage);
-    setHasMore(res.hasMore);
-  };
+  const loadNextPage = () => {};
 
   useEffect(() => {

[NoCoverage] BooleanLiteral
components/CommandPalette.tsx:134:9
 
   // Load next page
   const loadNextPage = () => {
-    if (!hasMore) return;
+    if (hasMore) return;
     const nextPage = currentPage + 1;
     const res = localSearchService.search(query, nextPage, PAGE_SIZE);

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:134:9
 
   // Load next page
   const loadNextPage = () => {
-    if (!hasMore) return;
+    if (false) return;
     const nextPage = currentPage + 1;
     const res = localSearchService.search(query, nextPage, PAGE_SIZE);

[NoCoverage] ArithmeticOperator
components/CommandPalette.tsx:135:22
   // Load next page
   const loadNextPage = () => {
     if (!hasMore) return;
-    const nextPage = currentPage + 1;
+    const nextPage = currentPage - 1;
     const res = localSearchService.search(query, nextPage, PAGE_SIZE);
     setFoundationalResults((prev) => [...prev, ...res.results]);

[NoCoverage] ArrowFunction
components/CommandPalette.tsx:137:28
     if (!hasMore) return;
     const nextPage = currentPage + 1;
     const res = localSearchService.search(query, nextPage, PAGE_SIZE);
-    setFoundationalResults((prev) => [...prev, ...res.results]);
+    setFoundationalResults(() => undefined);
     setCurrentPage(nextPage);
     setHasMore(res.hasMore);

[NoCoverage] BlockStatement
components/CommandPalette.tsx:142:19
     setHasMore(res.hasMore);
   };
 
-  useEffect(() => {
-    if (isOpen) {
-      setQuery('');
-      setSelectedIndex(0);
-      setFoundationalResults([]);
-      setSelectedDoc(null);
-      setTimeout(() => inputRef.current?.focus(), 100);
-    }
-  }, [isOpen]);
+  useEffect(() => {}, [isOpen]);
 
   useEffect(() => {

[NoCoverage] BlockStatement
components/CommandPalette.tsx:143:17
   };
 
   useEffect(() => {
-    if (isOpen) {
-      setQuery('');
-      setSelectedIndex(0);
-      setFoundationalResults([]);
-      setSelectedDoc(null);
-      setTimeout(() => inputRef.current?.focus(), 100);
-    }
+    if (isOpen) {}
   }, [isOpen]);
 

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:143:9
   };
 
   useEffect(() => {
-    if (isOpen) {
+    if (true) {
       setQuery('');
       setSelectedIndex(0);

[NoCoverage] OptionalChaining
components/CommandPalette.tsx:148:24
       setSelectedIndex(0);
       setFoundationalResults([]);
       setSelectedDoc(null);
-      setTimeout(() => inputRef.current?.focus(), 100);
+      setTimeout(() => inputRef.current.focus(), 100);
     }
   }, [isOpen]);

[NoCoverage] ArrowFunction
components/CommandPalette.tsx:148:18
       setSelectedIndex(0);
       setFoundationalResults([]);
       setSelectedDoc(null);
-      setTimeout(() => inputRef.current?.focus(), 100);
+      setTimeout(() => undefined, 100);
     }
   }, [isOpen]);

[NoCoverage] ArrayDeclaration
components/CommandPalette.tsx:150:6
       setSelectedDoc(null);
       setTimeout(() => inputRef.current?.focus(), 100);
     }
-  }, [isOpen]);
+  }, []);
 
   useEffect(() => {

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:154:11
 
   useEffect(() => {
     const handleKeyDown = (e: KeyboardEvent) => {
-      if (!isOpen || selectedDoc) return; // Ignore if detail modal is open
+      if (false) return; // Ignore if detail modal is open
 
       if (e.key === 'ArrowDown') {

[NoCoverage] BooleanLiteral
components/CommandPalette.tsx:154:11
 
   useEffect(() => {
     const handleKeyDown = (e: KeyboardEvent) => {
-      if (!isOpen || selectedDoc) return; // Ignore if detail modal is open
+      if (isOpen || selectedDoc) return; // Ignore if detail modal is open
 
       if (e.key === 'ArrowDown') {

[NoCoverage] EqualityOperator
components/CommandPalette.tsx:156:11
     const handleKeyDown = (e: KeyboardEvent) => {
       if (!isOpen || selectedDoc) return; // Ignore if detail modal is open
 
-      if (e.key === 'ArrowDown') {
+      if (e.key !== 'ArrowDown') {
         e.preventDefault();
         setSelectedIndex((prev) => (prev + 1) % results.length);

[NoCoverage] BlockStatement
components/CommandPalette.tsx:156:34
     const handleKeyDown = (e: KeyboardEvent) => {
       if (!isOpen || selectedDoc) return; // Ignore if detail modal is open
 
-      if (e.key === 'ArrowDown') {
-        e.preventDefault();
-        setSelectedIndex((prev) => (prev + 1) % results.length);
-      } else if (e.key === 'ArrowUp') {
+      if (e.key === 'ArrowDown') {} else if (e.key === 'ArrowUp') {
         e.preventDefault();
         setSelectedIndex((prev) => (prev - 1 + results.length) % results.length);

[NoCoverage] ArithmeticOperator
components/CommandPalette.tsx:158:37
 
       if (e.key === 'ArrowDown') {
         e.preventDefault();
-        setSelectedIndex((prev) => (prev + 1) % results.length);
+        setSelectedIndex((prev) => (prev - 1) % results.length);
       } else if (e.key === 'ArrowUp') {
         e.preventDefault();

[NoCoverage] ArrowFunction
components/CommandPalette.tsx:158:26
 
       if (e.key === 'ArrowDown') {
         e.preventDefault();
-        setSelectedIndex((prev) => (prev + 1) % results.length);
+        setSelectedIndex(() => undefined);
       } else if (e.key === 'ArrowUp') {
         e.preventDefault();

[NoCoverage] EqualityOperator
components/CommandPalette.tsx:159:18
       if (e.key === 'ArrowDown') {
         e.preventDefault();
         setSelectedIndex((prev) => (prev + 1) % results.length);
-      } else if (e.key === 'ArrowUp') {
+      } else if (e.key !== 'ArrowUp') {
         e.preventDefault();
         setSelectedIndex((prev) => (prev - 1 + results.length) % results.length);

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:159:18
       if (e.key === 'ArrowDown') {
         e.preventDefault();
         setSelectedIndex((prev) => (prev + 1) % results.length);
-      } else if (e.key === 'ArrowUp') {
+      } else if (false) {
         e.preventDefault();
         setSelectedIndex((prev) => (prev - 1 + results.length) % results.length);

[NoCoverage] ArithmeticOperator
components/CommandPalette.tsx:161:37
         setSelectedIndex((prev) => (prev + 1) % results.length);
       } else if (e.key === 'ArrowUp') {
         e.preventDefault();
-        setSelectedIndex((prev) => (prev - 1 + results.length) % results.length);
+        setSelectedIndex((prev) => (prev + 1 + results.length) % results.length);
       } else if (e.key === 'Enter') {
         e.preventDefault();

[NoCoverage] ArrowFunction
components/CommandPalette.tsx:161:26
         setSelectedIndex((prev) => (prev + 1) % results.length);
       } else if (e.key === 'ArrowUp') {
         e.preventDefault();
-        setSelectedIndex((prev) => (prev - 1 + results.length) % results.length);
+        setSelectedIndex(() => undefined);
       } else if (e.key === 'Enter') {
         e.preventDefault();

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:162:18
       } else if (e.key === 'ArrowUp') {
         e.preventDefault();
         setSelectedIndex((prev) => (prev - 1 + results.length) % results.length);
-      } else if (e.key === 'Enter') {
+      } else if (true) {
         e.preventDefault();
         const selected = results[selectedIndex];

[NoCoverage] EqualityOperator
components/CommandPalette.tsx:162:18
       } else if (e.key === 'ArrowUp') {
         e.preventDefault();
         setSelectedIndex((prev) => (prev - 1 + results.length) % results.length);
-      } else if (e.key === 'Enter') {
+      } else if (e.key !== 'Enter') {
         e.preventDefault();
         const selected = results[selectedIndex];

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:165:13
       } else if (e.key === 'Enter') {
         e.preventDefault();
         const selected = results[selectedIndex];
-        if (selected) {
+        if (true) {
           if ('isExam' in selected) {
             onNavigate('library', null, selected as unknown as Examination);

[NoCoverage] BlockStatement
components/CommandPalette.tsx:165:23
       } else if (e.key === 'Enter') {
         e.preventDefault();
         const selected = results[selectedIndex];
-        if (selected) {
-          if ('isExam' in selected) {
-            onNavigate('library', null, selected as unknown as Examination);
-            onClose();
-          } else if ('isFoundational' in selected) {
-            setSelectedDoc(selected as unknown as SearchDocument);
-          } else {
-            onNavigate((selected as any).view);
-            onClose();
-          }
-        }
+        if (selected) {}
       } else if (e.key === 'Escape') {
         onClose();

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:166:15
         e.preventDefault();
         const selected = results[selectedIndex];
         if (selected) {
-          if ('isExam' in selected) {
+          if (true) {
             onNavigate('library', null, selected as unknown as Examination);
             onClose();

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:166:15
         e.preventDefault();
         const selected = results[selectedIndex];
         if (selected) {
-          if ('isExam' in selected) {
+          if (false) {
             onNavigate('library', null, selected as unknown as Examination);
             onClose();

[NoCoverage] StringLiteral
components/CommandPalette.tsx:167:24
         const selected = results[selectedIndex];
         if (selected) {
           if ('isExam' in selected) {
-            onNavigate('library', null, selected as unknown as Examination);
+            onNavigate("", null, selected as unknown as Examination);
             onClose();
           } else if ('isFoundational' in selected) {

[NoCoverage] BlockStatement
components/CommandPalette.tsx:169:52
           if ('isExam' in selected) {
             onNavigate('library', null, selected as unknown as Examination);
             onClose();
-          } else if ('isFoundational' in selected) {
-            setSelectedDoc(selected as unknown as SearchDocument);
-          } else {
+          } else if ('isFoundational' in selected) {} else {
             onNavigate((selected as any).view);
             onClose();

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:169:22
           if ('isExam' in selected) {
             onNavigate('library', null, selected as unknown as Examination);
             onClose();
-          } else if ('isFoundational' in selected) {
+          } else if (false) {
             setSelectedDoc(selected as unknown as SearchDocument);
           } else {

[NoCoverage] BlockStatement
components/CommandPalette.tsx:171:18
             onClose();
           } else if ('isFoundational' in selected) {
             setSelectedDoc(selected as unknown as SearchDocument);
-          } else {
-            onNavigate((selected as any).view);
-            onClose();
-          }
+          } else {}
         }
       } else if (e.key === 'Escape') {

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:176:18
             onClose();
           }
         }
-      } else if (e.key === 'Escape') {
+      } else if (true) {
         onClose();
       }

[NoCoverage] EqualityOperator
components/CommandPalette.tsx:176:18
             onClose();
           }
         }
-      } else if (e.key === 'Escape') {
+      } else if (e.key !== 'Escape') {
         onClose();
       }

[NoCoverage] ArrowFunction
components/CommandPalette.tsx:182:12
     };
 
     window.addEventListener('keydown', handleKeyDown);
-    return () => window.removeEventListener('keydown', handleKeyDown);
+    return () => undefined;
   }, [isOpen, results, selectedIndex, onNavigate, onClose, selectedDoc]);
 

[NoCoverage] BlockStatement
components/CommandPalette.tsx:203:32
               ref={inputRef}
               type="text"
               value={query}
-              onChange={(e) => {
-                setQuery(e.target.value);
-                setSelectedIndex(0);
-              }}
+              onChange={(e) => {}}
               placeholder="Search pages, protocols, or foundational sciences (e.g. AcetylCoa)..."
               className="flex-1 bg-transparent border-none outline-none text-lg font-medium text-slate-100 placeholder:text-slate-400"

[NoCoverage] EqualityOperator
components/CommandPalette.tsx:217:14
 
           {/* Results Container */}
           <div className="flex-1 overflow-y-auto p-4 custom-scrollbar bg-slate-900">
-            {results.length > 0 ? (
+            {results.length <= 0 ? (
               <div className="space-y-6">
                 {/* Navigation and Tools */}

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:217:14
 
           {/* Results Container */}
           <div className="flex-1 overflow-y-auto p-4 custom-scrollbar bg-slate-900">
-            {results.length > 0 ? (
+            {false ? (
               <div className="space-y-6">
                 {/* Navigation and Tools */}

[NoCoverage] EqualityOperator
components/CommandPalette.tsx:220:18
             {results.length > 0 ? (
               <div className="space-y-6">
                 {/* Navigation and Tools */}
-                {filteredViews.length > 0 && (
+                {filteredViews.length <= 0 && (
                   <div>
                     <p className="px-4 text-[10px] font-black text-slate-400 uppercase tracking-[0.2em] mb-3">

[NoCoverage] EqualityOperator
components/CommandPalette.tsx:220:18
             {results.length > 0 ? (
               <div className="space-y-6">
                 {/* Navigation and Tools */}
-                {filteredViews.length > 0 && (
+                {filteredViews.length >= 0 && (
                   <div>
                     <p className="px-4 text-[10px] font-black text-slate-400 uppercase tracking-[0.2em] mb-3">

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:227:44
                     </p>
                     <div className="space-y-1">
                       {filteredViews.map((view, idx) => {
-                        const isSelected = idx === selectedIndex;
+                        const isSelected = false;
                         return (
                           <button

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:227:44
                     </p>
                     <div className="space-y-1">
                       {filteredViews.map((view, idx) => {
-                        const isSelected = idx === selectedIndex;
+                        const isSelected = true;
                         return (
                           <button

[NoCoverage] BlockStatement
components/CommandPalette.tsx:231:44
                         return (
                           <button
                             key={view.id}
-                            onClick={() => {
-                              onNavigate(view.view);
-                              onClose();
-                            }}
+                            onClick={() => {}}
                             onMouseEnter={() => setSelectedIndex(idx)}
                             className={`w-full flex items-center justify-between px-4 py-3 rounded-xl transition-all ${

[NoCoverage] ArrowFunction
components/CommandPalette.tsx:235:43
                               onNavigate(view.view);
                               onClose();
                             }}
-                            onMouseEnter={() => setSelectedIndex(idx)}
+                            onMouseEnter={() => undefined}
                             className={`w-full flex items-center justify-between px-4 py-3 rounded-xl transition-all ${
                               isSelected

[NoCoverage] StringLiteral
components/CommandPalette.tsx:236:40
                               onClose();
                             }}
                             onMouseEnter={() => setSelectedIndex(idx)}
-                            className={`w-full flex items-center justify-between px-4 py-3 rounded-xl transition-all ${
-                              isSelected
-                                ? 'bg-blue-600 text-white shadow-lg'
-                                : 'text-slate-400 hover:bg-slate-800/40 hover:text-white'
-                            }`}
+                            className={``}
                           >
                             <div className="flex items-center gap-4">

[NoCoverage] StringLiteral
components/CommandPalette.tsx:239:35
                             className={`w-full flex items-center justify-between px-4 py-3 rounded-xl transition-all ${
                               isSelected
                                 ? 'bg-blue-600 text-white shadow-lg'
-                                : 'text-slate-400 hover:bg-slate-800/40 hover:text-white'
+                                : ""
                             }`}
                           >

[NoCoverage] StringLiteral
components/CommandPalette.tsx:244:135
                           >
                             <div className="flex items-center gap-4">
                               <div
-                                className={`w-8 h-8 rounded-xl flex items-center justify-center ${isSelected ? 'bg-slate-950/40/20' : 'bg-slate-800 border border-slate-700/50 text-slate-400'}`}
+                                className={`w-8 h-8 rounded-xl flex items-center justify-center ${isSelected ? 'bg-slate-950/40/20' : ""}`}
                               >
                                 {view.icon}

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:250:30
                               </div>
                               <span className="font-bold text-sm tracking-tight">{view.label}</span>
                             </div>
-                            {isSelected && <Command className="w-3.5 h-3.5 opacity-60" />}
+                            {true}
                           </button>
                         );

[NoCoverage] LogicalOperator
components/CommandPalette.tsx:250:30
                               </div>
                               <span className="font-bold text-sm tracking-tight">{view.label}</span>
                             </div>
-                            {isSelected && <Command className="w-3.5 h-3.5 opacity-60" />}
+                            {isSelected || <Command className="w-3.5 h-3.5 opacity-60" />}
                           </button>
                         );

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:259:18
                 )}
 
                 {/* Protocols */}
-                {filteredExams.length > 0 && (
+                {true && (
                   <div>
                     <p className="px-4 text-[10px] font-black text-slate-400 uppercase tracking-[0.2em] mb-3">

[NoCoverage] EqualityOperator
components/CommandPalette.tsx:259:18
                 )}
 
                 {/* Protocols */}
-                {filteredExams.length > 0 && (
+                {filteredExams.length >= 0 && (
                   <div>
                     <p className="px-4 text-[10px] font-black text-slate-400 uppercase tracking-[0.2em] mb-3">

[NoCoverage] ArithmeticOperator
components/CommandPalette.tsx:266:43
                     </p>
                     <div className="space-y-1">
                       {filteredExams.map((exam, idx) => {
-                        const actualIdx = filteredViews.length + idx;
+                        const actualIdx = filteredViews.length - idx;
                         const isSelected = actualIdx === selectedIndex;
                         return (

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:267:44
                     <div className="space-y-1">
                       {filteredExams.map((exam, idx) => {
                         const actualIdx = filteredViews.length + idx;
-                        const isSelected = actualIdx === selectedIndex;
+                        const isSelected = true;
                         return (
                           <button

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:267:44
                     <div className="space-y-1">
                       {filteredExams.map((exam, idx) => {
                         const actualIdx = filteredViews.length + idx;
-                        const isSelected = actualIdx === selectedIndex;
+                        const isSelected = false;
                         return (
                           <button
