[NoCoverage] BlockStatement
components/CommandPalette.tsx:271:44
                         return (
                           <button
                             key={exam.id}
-                            onClick={() => {
-                              onNavigate('library', null, exam);
-                              onClose();
-                            }}
+                            onClick={() => {}}
                             onMouseEnter={() => setSelectedIndex(actualIdx)}
                             className={`w-full flex items-center justify-between px-4 py-3 rounded-xl transition-all ${

[NoCoverage] ArrowFunction
components/CommandPalette.tsx:275:43
                               onNavigate('library', null, exam);
                               onClose();
                             }}
-                            onMouseEnter={() => setSelectedIndex(actualIdx)}
+                            onMouseEnter={() => undefined}
                             className={`w-full flex items-center justify-between px-4 py-3 rounded-xl transition-all ${
                               isSelected

[NoCoverage] StringLiteral
components/CommandPalette.tsx:278:35
                             onMouseEnter={() => setSelectedIndex(actualIdx)}
                             className={`w-full flex items-center justify-between px-4 py-3 rounded-xl transition-all ${
                               isSelected
-                                ? 'bg-blue-600 text-white shadow-lg'
+                                ? ""
                                 : 'text-slate-400 hover:bg-slate-800/40 hover:text-white'
                             }`}

[NoCoverage] StringLiteral
components/CommandPalette.tsx:293:110
                                   {exam.name}
                                 </span>
                                 <span
-                                  className={`text-[10px] font-medium block ${isSelected ? 'text-white/60' : 'text-slate-400'}`}
+                                  className={`text-[10px] font-medium block ${isSelected ? 'text-white/60' : ""}`}
                                 >
                                   {exam.system}

[NoCoverage] StringLiteral
components/CommandPalette.tsx:293:46
                                   {exam.name}
                                 </span>
                                 <span
-                                  className={`text-[10px] font-medium block ${isSelected ? 'text-white/60' : 'text-slate-400'}`}
+                                  className={``}
                                 >
                                   {exam.system}

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:299:30
                                 </span>
                               </div>
                             </div>
-                            {isSelected && <Command className="w-3.5 h-3.5 opacity-60" />}
+                            {false}
                           </button>
                         );

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:308:18
                 )}
 
                 {/* Foundational Sciences (Layer 1 & 2 JSON files) */}
-                {foundationalResults.length > 0 && (
+                {true && (
                   <div>
                     <div className="px-4 flex items-center justify-between mb-3">

[NoCoverage] EqualityOperator
components/CommandPalette.tsx:308:18
                 )}
 
                 {/* Foundational Sciences (Layer 1 & 2 JSON files) */}
-                {foundationalResults.length > 0 && (
+                {foundationalResults.length >= 0 && (
                   <div>
                     <div className="px-4 flex items-center justify-between mb-3">

[NoCoverage] ArithmeticOperator
components/CommandPalette.tsx:320:43
                     </div>
                     <div className="space-y-1">
                       {foundationalResults.map((res, idx) => {
-                        const actualIdx = standardResults.length + idx;
+                        const actualIdx = standardResults.length - idx;
                         const isSelected = actualIdx === selectedIndex;
                         const doc = res.document;

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:321:44
                     <div className="space-y-1">
                       {foundationalResults.map((res, idx) => {
                         const actualIdx = standardResults.length + idx;
-                        const isSelected = actualIdx === selectedIndex;
+                        const isSelected = false;
                         const doc = res.document;
                         return (

[NoCoverage] EqualityOperator
components/CommandPalette.tsx:321:44
                     <div className="space-y-1">
                       {foundationalResults.map((res, idx) => {
                         const actualIdx = standardResults.length + idx;
-                        const isSelected = actualIdx === selectedIndex;
+                        const isSelected = actualIdx !== selectedIndex;
                         const doc = res.document;
                         return (

[NoCoverage] ArrowFunction
components/CommandPalette.tsx:326:38
                         return (
                           <button
                             key={doc.id}
-                            onClick={() => setSelectedDoc(doc)}
+                            onClick={() => undefined}
                             onMouseEnter={() => setSelectedIndex(actualIdx)}
                             className={`w-full flex items-center justify-between px-4 py-3 rounded-xl transition-all text-left ${

[NoCoverage] ArrowFunction
components/CommandPalette.tsx:327:43
                           <button
                             key={doc.id}
                             onClick={() => setSelectedDoc(doc)}
-                            onMouseEnter={() => setSelectedIndex(actualIdx)}
+                            onMouseEnter={() => undefined}
                             className={`w-full flex items-center justify-between px-4 py-3 rounded-xl transition-all text-left ${
                               isSelected

[NoCoverage] StringLiteral
components/CommandPalette.tsx:328:40
                             key={doc.id}
                             onClick={() => setSelectedDoc(doc)}
                             onMouseEnter={() => setSelectedIndex(actualIdx)}
-                            className={`w-full flex items-center justify-between px-4 py-3 rounded-xl transition-all text-left ${
-                              isSelected
-                                ? 'bg-blue-600 text-white shadow-lg'
-                                : 'text-slate-400 hover:bg-slate-800/40 hover:text-white'
-                            }`}
+                            className={``}
                           >
                             <div className="flex items-center gap-4 overflow-hidden">

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:342:34
                                     : 'bg-slate-800 border border-slate-700/50 text-slate-400'
                                 }`}
                               >
-                                {doc.type === 'concept' ? (
+                                {true ? (
                                   <Activity className="w-4 h-4 text-indigo-400" />
                                 ) : doc.type === 'structure' ? (

[NoCoverage] EqualityOperator
components/CommandPalette.tsx:342:34
                                     : 'bg-slate-800 border border-slate-700/50 text-slate-400'
                                 }`}
                               >
-                                {doc.type === 'concept' ? (
+                                {doc.type !== 'concept' ? (
                                   <Activity className="w-4 h-4 text-indigo-400" />
                                 ) : doc.type === 'structure' ? (

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:344:37
                               >
                                 {doc.type === 'concept' ? (
                                   <Activity className="w-4 h-4 text-indigo-400" />
-                                ) : doc.type === 'structure' ? (
+                                ) : true ? (
                                   <Layers className="w-4 h-4 text-emerald-400" />
                                 ) : doc.type === 'correlation' ? (

[NoCoverage] EqualityOperator
components/CommandPalette.tsx:344:37
                               >
                                 {doc.type === 'concept' ? (
                                   <Activity className="w-4 h-4 text-indigo-400" />
-                                ) : doc.type === 'structure' ? (
+                                ) : doc.type !== 'structure' ? (
                                   <Layers className="w-4 h-4 text-emerald-400" />
                                 ) : doc.type === 'correlation' ? (

[NoCoverage] EqualityOperator
components/CommandPalette.tsx:346:37
                                   <Activity className="w-4 h-4 text-indigo-400" />
                                 ) : doc.type === 'structure' ? (
                                   <Layers className="w-4 h-4 text-emerald-400" />
-                                ) : doc.type === 'correlation' ? (
+                                ) : doc.type !== 'correlation' ? (
                                   <Zap className="w-4 h-4 text-rose-400" />
                                 ) : (

[NoCoverage] ConditionalExpression
components/CommandPalette.tsx:346:37
                                   <Activity className="w-4 h-4 text-indigo-400" />
                                 ) : doc.type === 'structure' ? (
                                   <Layers className="w-4 h-4 text-emerald-400" />
-                                ) : doc.type === 'correlation' ? (
+                                ) : false ? (
                                   <Zap className="w-4 h-4 text-rose-400" />
                                 ) : (

[NoCoverage] ArithmeticOperator
components/CommandPalette.tsx:376:47
                           onClick={loadNextPage}
                         >
-                          Load More Results ({totalResults - foundationalResults.length} remaining)
+                          Load More Results ({totalResults + foundationalResults.length} remaining)
                         </button>
                       </div>

[NoCoverage] ArrowFunction
components/CommandPalette.tsx:421:64
       </div>
 
       {/* Foundational Science Detail Modal */}
-      <FoundationalDetailModal document={selectedDoc} onClose={() => setSelectedDoc(null)} />
+      <FoundationalDetailModal document={selectedDoc} onClose={() => undefined} />
     </>
   );
