[NoCoverage] ConditionalExpression
components/DashboardView.tsx:359:63
                 : stats.toReview > 0
                   ? `You have ${stats.toReview} protocol${stats.toReview === 1 ? '' : 's'} to review. Keeping up with reviews ensures long-term retention.`
                   : stats.inProgress > 0
-                    ? `You have ${stats.inProgress} protocol${stats.inProgress === 1 ? '' : 's'} in progress. Keep up the good work and master them today!`
+                    ? `You have ${stats.inProgress} protocol${true ? '' : 's'} in progress. Keep up the good work and master them today!`
                     : "Great job! You've mastered all your downloaded protocols. Explore the repository for more."}
             </p>

[NoCoverage] StringLiteral
components/DashboardView.tsx:360:23
                   ? `You have ${stats.toReview} protocol${stats.toReview === 1 ? '' : 's'} to review. Keeping up with reviews ensures long-term retention.`
                   : stats.inProgress > 0
                     ? `You have ${stats.inProgress} protocol${stats.inProgress === 1 ? '' : 's'} in progress. Keep up the good work and master them today!`
-                    : "Great job! You've mastered all your downloaded protocols. Explore the repository for more."}
+                    : ""}
             </p>

[NoCoverage] ConditionalExpression
components/DashboardView.tsx:363:16
                     : "Great job! You've mastered all your downloaded protocols. Explore the repository for more."}
             </p>
-              {stats.total === 0 ? 'Open Repository' : 'Go to Repository'}{' '}
+              {false ? 'Open Repository' : 'Go to Repository'}{' '}
               <ArrowRight className="w-3 h-3 group-hover:translate-x-1 transition-transform" />
             </div>

[NoCoverage] ConditionalExpression
components/DashboardView.tsx:363:16
                     : "Great job! You've mastered all your downloaded protocols. Explore the repository for more."}
             </p>
-              {stats.total === 0 ? 'Open Repository' : 'Go to Repository'}{' '}
+              {true ? 'Open Repository' : 'Go to Repository'}{' '}
               <ArrowRight className="w-3 h-3 group-hover:translate-x-1 transition-transform" />
             </div>

[NoCoverage] ArrowFunction
components/DashboardView.tsx:370:22
 
           <div
-            onClick={() => onNavigate('diagnosticReasoning')}
+            onClick={() => undefined}
           >
             <div className="absolute -bottom-10 -right-10 w-40 h-40 bg-slate-950/40/10 blur-3xl rounded-full pointer-events-none group-hover:scale-150 transition-transform duration-700" />

[NoCoverage] StringLiteral
components/DashboardView.tsx:397:33
               </h2>
             </div>
             <p className="text-sm font-medium text-amber-100/80 italic leading-relaxed relative z-10">
-              "{quotes[0].split(' - ')[0]}"
+              "{quotes[0].split("")[0]}"
             </p>
             <p className="text-[10px] font-black text-amber-400/70 uppercase tracking-widest mt-4 relative z-10">

[NoCoverage] StringLiteral
components/DashboardView.tsx:400:34
               "{quotes[0].split(' - ')[0]}"
             </p>
             <p className="text-[10px] font-black text-amber-400/70 uppercase tracking-widest mt-4 relative z-10">
-              — {quotes[0].split(' - ')[1]}
+              — {quotes[0].split("")[1]}
             </p>
           </div>

[NoCoverage] EqualityOperator
components/DashboardView.tsx:420:14
             </button>
           </div>
           <div className="grid grid-cols-1 sm:grid-cols-2 gap-4">
-            {recentActivity.length > 0 ? (
+            {recentActivity.length >= 0 ? (
               recentActivity.map((activity) => {
                 const theme = SYSTEM_THEMES[activity.system] || DEFAULT_STYLE;

[NoCoverage] ConditionalExpression
components/DashboardView.tsx:420:14
             </button>
           </div>
           <div className="grid grid-cols-1 sm:grid-cols-2 gap-4">
-            {recentActivity.length > 0 ? (
+            {true ? (
               recentActivity.map((activity) => {
                 const theme = SYSTEM_THEMES[activity.system] || DEFAULT_STYLE;

[NoCoverage] ConditionalExpression
components/DashboardView.tsx:422:31
           <div className="grid grid-cols-1 sm:grid-cols-2 gap-4">
             {recentActivity.length > 0 ? (
               recentActivity.map((activity) => {
-                const theme = SYSTEM_THEMES[activity.system] || DEFAULT_STYLE;
+                const theme = false;
                 return (
                   <div

[NoCoverage] LogicalOperator
components/DashboardView.tsx:422:31
           <div className="grid grid-cols-1 sm:grid-cols-2 gap-4">
             {recentActivity.length > 0 ? (
               recentActivity.map((activity) => {
-                const theme = SYSTEM_THEMES[activity.system] || DEFAULT_STYLE;
+                const theme = SYSTEM_THEMES[activity.system] && DEFAULT_STYLE;
                 return (
                   <div

[NoCoverage] ArrowFunction
components/DashboardView.tsx:427:30
                   <div
                     key={activity.id}
-                    onClick={() => onSelectExam(activity.exam)}
+                    onClick={() => undefined}
                   >
                     <div className="flex items-center gap-4">

[NoCoverage] ConditionalExpression
components/DashboardView.tsx:433:26
                       <div
                         className={`w-10 h-10 rounded-xl flex items-center justify-center ${theme.bg} ${theme.text} shadow-sm group-hover:scale-110 transition-transform`}
                       >
-                        {activity.type === 'completion' ? (
+                        {true ? (
                           <Star className="w-4 h-4" />
                         ) : (

[NoCoverage] ConditionalExpression
components/DashboardView.tsx:433:26
                       <div
                         className={`w-10 h-10 rounded-xl flex items-center justify-center ${theme.bg} ${theme.text} shadow-sm group-hover:scale-110 transition-transform`}
                       >
-                        {activity.type === 'completion' ? (
+                        {false ? (
                           <Star className="w-4 h-4" />
                         ) : (

[NoCoverage] ConditionalExpression
components/DashboardView.tsx:471:16
               </h2>
             </div>
             <div className="space-y-4">
-              {stats.systemProgress.length > 0 ? (
+              {false ? (
                 stats.systemProgress.map((item: any) => (
                   <div

[NoCoverage] ConditionalExpression
components/DashboardView.tsx:471:16
               </h2>
             </div>
             <div className="space-y-4">
-              {stats.systemProgress.length > 0 ? (
+              {true ? (
                 stats.systemProgress.map((item: any) => (
                   <div

[NoCoverage] ArrowFunction
components/DashboardView.tsx:472:42
             </div>
             <div className="space-y-4">
               {stats.systemProgress.length > 0 ? (
-                stats.systemProgress.map((item: any) => (
-                  <div
-                    key={item.system}
-                    className="flex flex-col gap-2 p-4 bg-slate-950/50 rounded-2xl border border-white/5"
-                  >
-                    <div className="flex items-center justify-between">
-                      <span className="text-[11px] font-black text-slate-300 uppercase tracking-widest">
-                        {item.system}
-                      </span>
-                      <span className="text-[11px] font-black text-slate-200">
-                        {item.learned} / {item.total}
-                      </span>
-                    </div>
-                    <div className="w-full h-1.5 bg-slate-800 rounded-full overflow-hidden">
-                      <div
-                        className="h-full bg-emerald-950/200 rounded-full transition-all"
-                        style={{ width: `${item.percentage}%` }}
-                      />
-                    </div>
-                  </div>
-                ))
+                stats.systemProgress.map(() => undefined)
               ) : (
                 <div className="p-8 text-center bg-slate-950/40 rounded-3xl border border-white/5 border-dashed">

[NoCoverage] ArrowFunction
components/DashboardView.tsx:511:26
                 Study Mastery
               </h2>
               <button
-                onClick={() => onNavigate('studyHub')}
+                onClick={() => undefined}
                 className="text-[10px] font-black text-slate-400 hover:text-indigo-400 uppercase tracking-widest transition-colors"
               >

[NoCoverage] ConditionalExpression
components/DashboardView.tsx:518:16
               </button>
             </div>
             <div className="space-y-4">
-              {studyProgress.length > 0 ? (
+              {false ? (
                 studyProgress.slice(0, 4).map((item) => (
                   <div

[NoCoverage] ConditionalExpression
components/DashboardView.tsx:518:16
               </button>
             </div>
             <div className="space-y-4">
-              {studyProgress.length > 0 ? (
+              {true ? (
                 studyProgress.slice(0, 4).map((item) => (
                   <div

[NoCoverage] MethodExpression
components/DashboardView.tsx:519:17
             </div>
             <div className="space-y-4">
               {studyProgress.length > 0 ? (
-                studyProgress.slice(0, 4).map((item) => (
+                studyProgress.map((item) => (
                   <div
                     key={item.topic}

[NoCoverage] ArrowFunction
components/DashboardView.tsx:519:47
             </div>
             <div className="space-y-4">
               {studyProgress.length > 0 ? (
-                studyProgress.slice(0, 4).map((item) => (
-                  <div
-                    key={item.topic}
-                    className="flex flex-col gap-2 p-4 bg-slate-950/50 rounded-2xl border border-white/5"
-                  >
-                    <div className="flex items-center justify-between">
-                      <span className="text-[11px] font-black text-slate-300 uppercase tracking-widest truncate max-w-[150px]">
-                        {item.topic}
-                      </span>
-                      <span className="text-[11px] font-black text-indigo-400">
-                        {item.masteryLevel}%
-                      </span>
-                    </div>
-                    <div className="w-full h-1.5 bg-slate-800 rounded-full overflow-hidden">
-                      <div
-                        className="h-full bg-indigo-950/200 rounded-full transition-all"
-                        style={{ width: `${item.masteryLevel}%` }}
-                      />
-                    </div>
-                  </div>
-                ))
+                studyProgress.slice(0, 4).map(() => undefined)
               ) : (
                 <div className="p-8 text-center bg-slate-950/40 rounded-3xl border border-white/5 border-dashed">

[NoCoverage] StringLiteral
components/DashboardView.tsx:535:41
                     <div className="w-full h-1.5 bg-slate-800 rounded-full overflow-hidden">
                       <div
                         className="h-full bg-indigo-950/200 rounded-full transition-all"
-                        style={{ width: `${item.masteryLevel}%` }}
+                        style={{ width: `` }}
                       />
                     </div>

[NoCoverage] ObjectLiteral
components/DashboardView.tsx:535:32
                     <div className="w-full h-1.5 bg-slate-800 rounded-full overflow-hidden">
                       <div
                         className="h-full bg-indigo-950/200 rounded-full transition-all"
-                        style={{ width: `${item.masteryLevel}%` }}
+                        style={{}}
                       />
                     </div>
