[NoCoverage] StringLiteral
components/DermatologyRevisor.tsx:19:11
 
 const DERM_TERMS = [
   {
-    term: 'Macule',
+    term: "",
     definition:
       'A flat, circumscribed area of skin discoloration < 1cm in diameter, without any change in texture or thickness.'

[NoCoverage] StringLiteral
components/DermatologyRevisor.tsx:21:7
   {
     term: 'Macule',
     definition:
-      'A flat, circumscribed area of skin discoloration < 1cm in diameter, without any change in texture or thickness.'
+      ""
   },
   {

[NoCoverage] StringLiteral
components/DermatologyRevisor.tsx:24:11
       'A flat, circumscribed area of skin discoloration < 1cm in diameter, without any change in texture or thickness.'
   },
   {
-    term: 'Patch',
+    term: "",
     definition:
       'A flat, non-palpable area of skin discoloration > 1cm in diameter (essentially a large macule).'

[NoCoverage] StringLiteral
components/DermatologyRevisor.tsx:28:11
     definition:
       'A flat, non-palpable area of skin discoloration > 1cm in diameter (essentially a large macule).'
   },
-  { term: 'Papule', definition: 'A small, solid, elevated lesion < 1cm in diameter.' },
+  { term: "", definition: 'A small, solid, elevated lesion < 1cm in diameter.' },
   {
     term: 'Plaque',

[NoCoverage] ObjectLiteral
components/DermatologyRevisor.tsx:41:3
   },
   { term: 'Vesicle', definition: 'A small, fluid-filled blister < 1cm in diameter.' },
   { term: 'Bulla', definition: 'A large, fluid-filled blister > 1cm in diameter.' },
-  {
-    term: 'Pustule',
-    definition: 'A small, circumscribed elevation of the skin containing purulent material (pus).'
-  },
+  {},
   {
     term: 'Wheal',

[NoCoverage] StringLiteral
components/DermatologyRevisor.tsx:42:11
   { term: 'Vesicle', definition: 'A small, fluid-filled blister < 1cm in diameter.' },
   { term: 'Bulla', definition: 'A large, fluid-filled blister > 1cm in diameter.' },
   {
-    term: 'Pustule',
+    term: "",
     definition: 'A small, circumscribed elevation of the skin containing purulent material (pus).'
   },

[NoCoverage] StringLiteral
components/DermatologyRevisor.tsx:46:11
     definition: 'A small, circumscribed elevation of the skin containing purulent material (pus).'
   },
   {
-    term: 'Wheal',
+    term: "",
     definition:
       'An evanescent, edematous, circumscribed elevation of the skin, often with a central pallor and erythematous rim (e.g., hives).'

[NoCoverage] ObjectLiteral
components/DermatologyRevisor.tsx:58:3
     term: 'Crust',
     definition: 'Dried exudate (serum, blood, or pus) on the skin surface; "scab".'
   },
-  { term: 'Erosion', definition: 'A partial loss of the epidermis that heals without scarring.' },
+  {},
   {
     term: 'Ulcer',

[NoCoverage] StringLiteral
components/DermatologyRevisor.tsx:67:7
   {
     term: 'Lichenification',
     definition:
-      'Thickening of the epidermis with accentuation of normal skin markings, usually due to chronic rubbing or scratching.'
+      ""
   },
   { term: 'Excoriation', definition: 'A linear or punctate erosion caused by scratching.' },

[NoCoverage] ObjectLiteral
components/DermatologyRevisor.tsx:70:3
       'Thickening of the epidermis with accentuation of normal skin markings, usually due to chronic rubbing or scratching.'
   },
   { term: 'Excoriation', definition: 'A linear or punctate erosion caused by scratching.' },
-  {
-    term: 'Atrophy',
-    definition:
-      'Thinning of the epidermis, dermis, or subcutaneous fat, often resulting in a translucent or depressed appearance.'
-  },
+  {},
   {
     term: 'Telangiectasia',

[NoCoverage] StringLiteral
components/DermatologyRevisor.tsx:73:7
   {
     term: 'Atrophy',
     definition:
-      'Thinning of the epidermis, dermis, or subcutaneous fat, often resulting in a translucent or depressed appearance.'
+      ""
   },
   {

[NoCoverage] StringLiteral
components/DermatologyRevisor.tsx:76:11
       'Thinning of the epidermis, dermis, or subcutaneous fat, often resulting in a translucent or depressed appearance.'
   },
   {
-    term: 'Telangiectasia',
+    term: "",
     definition:
       'Permanent dilation of small blood vessels (capillaries, arterioles, or venules) near the skin surface.'

[NoCoverage] StringLiteral
components/DermatologyRevisor.tsx:78:7
   {
     term: 'Telangiectasia',
     definition:
-      'Permanent dilation of small blood vessels (capillaries, arterioles, or venules) near the skin surface.'
+      ""
   },
   {

[NoCoverage] ObjectLiteral
components/DermatologyRevisor.tsx:80:3
     definition:
       'Permanent dilation of small blood vessels (capillaries, arterioles, or venules) near the skin surface.'
   },
-  {
-    term: 'Purpura',
-    definition:
-      'Discoloration of the skin or mucous membranes due to hemorrhage from small blood vessels; does not blanch on pressure.'
-  }
+  {}
 ];
 

[NoCoverage] BooleanLiteral
components/DermatologyRevisor.tsx:93:56
   const [searchQuery, setSearchQuery] = useState('');
   const [selectedTerm, setSelectedTerm] = useState<(typeof DERM_TERMS)[0] | null>(null);
   const [illustration, setIllustration] = useState<string | null>(null);
-  const [isLoadingImage, setIsLoadingImage] = useState(false);
+  const [isLoadingImage, setIsLoadingImage] = useState(true);
   const [enlargedImage, setEnlargedImage] = useState<{ src: string; alt: string } | null>(null);
 

[NoCoverage] BlockStatement
components/DermatologyRevisor.tsx:101:71
     'definition'
   ]);
 
-  const handleSelectTerm = async (termObj: (typeof DERM_TERMS)[0]) => {
-    setSelectedTerm(termObj);
-    setIllustration(null);
-    setIsLoadingImage(true);
-
-    try {
-      const img = await gemini.generateIllustration(
-        `Dermatological morphology: ${termObj.term}. ${termObj.definition}. Clear medical diagram style.`,
-        false
-      );
-      setIllustration(img || null);
-    } catch (error) {
-      console.error('Failed to load illustration:', error);
-    } finally {
-      setIsLoadingImage(false);
-    }
-  };
+  const handleSelectTerm = async (termObj: (typeof DERM_TERMS)[0]) => {};
 
   return (

[NoCoverage] BooleanLiteral
components/DermatologyRevisor.tsx:104:23
   const handleSelectTerm = async (termObj: (typeof DERM_TERMS)[0]) => {
     setSelectedTerm(termObj);
     setIllustration(null);
-    setIsLoadingImage(true);
+    setIsLoadingImage(false);
 
     try {

[NoCoverage] BlockStatement
components/DermatologyRevisor.tsx:106:9
     setIllustration(null);
     setIsLoadingImage(true);
 
-    try {
-      const img = await gemini.generateIllustration(
-        `Dermatological morphology: ${termObj.term}. ${termObj.definition}. Clear medical diagram style.`,
-        false
-      );
-      setIllustration(img || null);
-    } catch (error) {
+    try {} catch (error) {
       console.error('Failed to load illustration:', error);
     } finally {

[NoCoverage] BooleanLiteral
components/DermatologyRevisor.tsx:109:9
     try {
       const img = await gemini.generateIllustration(
         `Dermatological morphology: ${termObj.term}. ${termObj.definition}. Clear medical diagram style.`,
-        false
+        true
       );
       setIllustration(img || null);

[NoCoverage] ConditionalExpression
components/DermatologyRevisor.tsx:111:23
         `Dermatological morphology: ${termObj.term}. ${termObj.definition}. Clear medical diagram style.`,
         false
       );
-      setIllustration(img || null);
+      setIllustration(true);
     } catch (error) {
       console.error('Failed to load illustration:', error);

[NoCoverage] LogicalOperator
components/DermatologyRevisor.tsx:111:23
         `Dermatological morphology: ${termObj.term}. ${termObj.definition}. Clear medical diagram style.`,
         false
       );
-      setIllustration(img || null);
+      setIllustration(img && null);
     } catch (error) {
       console.error('Failed to load illustration:', error);

[NoCoverage] BlockStatement
components/DermatologyRevisor.tsx:112:21
         false
       );
       setIllustration(img || null);
-    } catch (error) {
-      console.error('Failed to load illustration:', error);
-    } finally {
+    } catch (error) {} finally {
       setIsLoadingImage(false);
     }

[NoCoverage] BlockStatement
components/DermatologyRevisor.tsx:114:15
       setIllustration(img || null);
     } catch (error) {
       console.error('Failed to load illustration:', error);
-    } finally {
-      setIsLoadingImage(false);
-    }
+    } finally {}
   };
 

[NoCoverage] BooleanLiteral
components/DermatologyRevisor.tsx:115:25
     } catch (error) {
       console.error('Failed to load illustration:', error);
     } finally {
-      setIsLoadingImage(false);
+      setIsLoadingImage(true);
     }
   };

[NoCoverage] ArrowFunction
components/DermatologyRevisor.tsx:178:34
             )}
 
             <div className="bg-slate-900/50 border border-white/5 rounded-3xl overflow-hidden shadow-sm max-h-[600px] overflow-y-auto custom-scrollbar">
-              {filteredTerms.map((t, idx) => (
-                <button
-                  key={t.term}
-                  onClick={() => handleSelectTerm(t)}
-                  className={`w-full text-left px-6 py-4 border-b border-white/5 last:border-0 transition-all flex items-center justify-between group cursor-pointer ${
-                    selectedTerm?.term === t.term
-                      ? 'bg-orange-950/30 text-orange-400'
-                      : 'hover:bg-slate-800/40 text-slate-400'
-                  }`}
-                >
-                  <span className="text-xs font-black uppercase tracking-widest">{t.term}</span>
-                  <div
-                    className={`w-1.5 h-1.5 rounded-full transition-all ${selectedTerm?.term === t.term ? 'bg-orange-500 scale-125' : 'bg-slate-800 group-hover:bg-orange-500/60'}`}
-                  />
-                </button>
-              ))}
+              {filteredTerms.map(() => undefined)}
             </div>
           </div>

[NoCoverage] ArrowFunction
components/DermatologyRevisor.tsx:181:28
               {filteredTerms.map((t, idx) => (
                 <button
                   key={t.term}
-                  onClick={() => handleSelectTerm(t)}
+                  onClick={() => undefined}
                   className={`w-full text-left px-6 py-4 border-b border-white/5 last:border-0 transition-all flex items-center justify-between group cursor-pointer ${
                     selectedTerm?.term === t.term

[NoCoverage] StringLiteral
components/DermatologyRevisor.tsx:182:30
                 <button
                   key={t.term}
                   onClick={() => handleSelectTerm(t)}
-                  className={`w-full text-left px-6 py-4 border-b border-white/5 last:border-0 transition-all flex items-center justify-between group cursor-pointer ${
-                    selectedTerm?.term === t.term
-                      ? 'bg-orange-950/30 text-orange-400'
-                      : 'hover:bg-slate-800/40 text-slate-400'
-                  }`}
+                  className={``}
                 >
                   <span className="text-xs font-black uppercase tracking-widest">{t.term}</span>

[NoCoverage] OptionalChaining
components/DermatologyRevisor.tsx:183:21
                   key={t.term}
                   onClick={() => handleSelectTerm(t)}
                   className={`w-full text-left px-6 py-4 border-b border-white/5 last:border-0 transition-all flex items-center justify-between group cursor-pointer ${
-                    selectedTerm?.term === t.term
+                    selectedTerm.term === t.term
                       ? 'bg-orange-950/30 text-orange-400'
                       : 'hover:bg-slate-800/40 text-slate-400'

[NoCoverage] ConditionalExpression
components/DermatologyRevisor.tsx:183:21
                   key={t.term}
                   onClick={() => handleSelectTerm(t)}
                   className={`w-full text-left px-6 py-4 border-b border-white/5 last:border-0 transition-all flex items-center justify-between group cursor-pointer ${
-                    selectedTerm?.term === t.term
+                    false
                       ? 'bg-orange-950/30 text-orange-400'
                       : 'hover:bg-slate-800/40 text-slate-400'

[NoCoverage] StringLiteral
components/DermatologyRevisor.tsx:185:25
                   className={`w-full text-left px-6 py-4 border-b border-white/5 last:border-0 transition-all flex items-center justify-between group cursor-pointer ${
                     selectedTerm?.term === t.term
                       ? 'bg-orange-950/30 text-orange-400'
-                      : 'hover:bg-slate-800/40 text-slate-400'
+                      : ""
                   }`}
                 >

[NoCoverage] ConditionalExpression
components/DermatologyRevisor.tsx:190:75
                 >
                   <span className="text-xs font-black uppercase tracking-widest">{t.term}</span>
                   <div
-                    className={`w-1.5 h-1.5 rounded-full transition-all ${selectedTerm?.term === t.term ? 'bg-orange-500 scale-125' : 'bg-slate-800 group-hover:bg-orange-500/60'}`}
+                    className={`w-1.5 h-1.5 rounded-full transition-all ${true ? 'bg-orange-500 scale-125' : 'bg-slate-800 group-hover:bg-orange-500/60'}`}
                   />
                 </button>

[NoCoverage] ConditionalExpression
components/DermatologyRevisor.tsx:190:75
                 >
                   <span className="text-xs font-black uppercase tracking-widest">{t.term}</span>
                   <div
-                    className={`w-1.5 h-1.5 rounded-full transition-all ${selectedTerm?.term === t.term ? 'bg-orange-500 scale-125' : 'bg-slate-800 group-hover:bg-orange-500/60'}`}
+                    className={`w-1.5 h-1.5 rounded-full transition-all ${false ? 'bg-orange-500 scale-125' : 'bg-slate-800 group-hover:bg-orange-500/60'}`}
                   />
                 </button>

[NoCoverage] ObjectLiteral
components/DermatologyRevisor.tsx:205:25
                   key={selectedTerm.term}
                   initial={{ opacity: 0, y: 20 }}
                   animate={{ opacity: 1, y: 0 }}
-                  exit={{ opacity: 0, y: -20 }}
+                  exit={{}}
                   className="space-y-8"
                 >

[NoCoverage] ArrowFunction
components/DermatologyRevisor.tsx:248:38
                           src={illustration}
                           alt={selectedTerm.term}
                           label="Dermatology Synthesis"
-                          onEnlarge={(src, alt) => setEnlargedImage({ src, alt })}
+                          onEnlarge={() => undefined}
                           config={{ size: 'full', position: 'top' }}
                         />

[NoCoverage] ObjectLiteral
components/DermatologyRevisor.tsx:248:69
                           src={illustration}
                           alt={selectedTerm.term}
                           label="Dermatology Synthesis"
-                          onEnlarge={(src, alt) => setEnlargedImage({ src, alt })}
+                          onEnlarge={(src, alt) => setEnlargedImage({})}
                           config={{ size: 'full', position: 'top' }}
                         />

[NoCoverage] StringLiteral
components/DermatologyRevisor.tsx:249:43
                           alt={selectedTerm.term}
                           label="Dermatology Synthesis"
                           onEnlarge={(src, alt) => setEnlargedImage({ src, alt })}
-                          config={{ size: 'full', position: 'top' }}
+                          config={{ size: "", position: 'top' }}
                         />
                         <div className="absolute inset-x-0 bottom-0 p-8 bg-linear-to-t from-black/80 via-transparent to-transparent pointer-events-none">

[NoCoverage] StringLiteral
components/DermatologyRevisor.tsx:249:61
                           alt={selectedTerm.term}
                           label="Dermatology Synthesis"
                           onEnlarge={(src, alt) => setEnlargedImage({ src, alt })}
-                          config={{ size: 'full', position: 'top' }}
+                          config={{ size: 'full', position: "" }}
                         />
                         <div className="absolute inset-x-0 bottom-0 p-8 bg-linear-to-t from-black/80 via-transparent to-transparent pointer-events-none">

[NoCoverage] MethodExpression
components/DermatologyRevisor.tsx:260:30
                           </div>
                           <p className="text-white/40 text-[9px] font-medium leading-relaxed max-w-md">
                             This illustration represents the typical morphological features of a{' '}
-                            {selectedTerm.term.toLowerCase()} for educational purposes.
+                            {selectedTerm.term.toUpperCase()} for educational purposes.
                           </p>
                         </div>
