[NoCoverage] BooleanLiteral
components/DifferentialPanel.tsx:20:42
   isOnline
 }) => {
   const [differentials, setDifferentials] = useState<DiagnosisSuggestion[]>([]);
-  const [loading, setLoading] = useState(false);
+  const [loading, setLoading] = useState(true);
   const gemini = new GeminiService();
 

[NoCoverage] BlockStatement
components/DifferentialPanel.tsx:23:32
   const [loading, setLoading] = useState(false);
   const gemini = new GeminiService();
 
-  const generate = async () => {
-    if ((findings || []).length === 0 || !isOnline) return;
-    setLoading(true);
-    try {
-      const suggestions = await gemini.getDifferentialDiagnosis(findings, system);
-      setDifferentials(suggestions);
-    } catch (e) {
-      console.error('Differential Analysis Error:', e);
-    } finally {
-      setLoading(false);
-    }
-  };
+  const generate = async () => {};
 
   useEffect(() => {

[NoCoverage] BooleanLiteral
components/DifferentialPanel.tsx:24:42
   const gemini = new GeminiService();
 
   const generate = async () => {
-    if ((findings || []).length === 0 || !isOnline) return;
+    if ((findings || []).length === 0 || isOnline) return;
     setLoading(true);
     try {

[NoCoverage] LogicalOperator
components/DifferentialPanel.tsx:24:9
   const gemini = new GeminiService();
 
   const generate = async () => {
-    if ((findings || []).length === 0 || !isOnline) return;
+    if ((findings || []).length === 0 && !isOnline) return;
     setLoading(true);
     try {

[NoCoverage] BooleanLiteral
components/DifferentialPanel.tsx:25:16
 
   const generate = async () => {
     if ((findings || []).length === 0 || !isOnline) return;
-    setLoading(true);
+    setLoading(false);
     try {
       const suggestions = await gemini.getDifferentialDiagnosis(findings, system);

[NoCoverage] BlockStatement
components/DifferentialPanel.tsx:26:9
   const generate = async () => {
     if ((findings || []).length === 0 || !isOnline) return;
     setLoading(true);
-    try {
-      const suggestions = await gemini.getDifferentialDiagnosis(findings, system);
-      setDifferentials(suggestions);
-    } catch (e) {
+    try {} catch (e) {
       console.error('Differential Analysis Error:', e);
     } finally {

[NoCoverage] BlockStatement
components/DifferentialPanel.tsx:29:17
     try {
       const suggestions = await gemini.getDifferentialDiagnosis(findings, system);
       setDifferentials(suggestions);
-    } catch (e) {
-      console.error('Differential Analysis Error:', e);
-    } finally {
+    } catch (e) {} finally {
       setLoading(false);
     }

[NoCoverage] BlockStatement
components/DifferentialPanel.tsx:31:15
       setDifferentials(suggestions);
     } catch (e) {
       console.error('Differential Analysis Error:', e);
-    } finally {
-      setLoading(false);
-    }
+    } finally {}
   };
 

[NoCoverage] BlockStatement
components/DifferentialPanel.tsx:36:19
     }
   };
 
-  useEffect(() => {
-    generate();
-  }, [(findings || []).length]); // Re-run if finding count changes substantially
+  useEffect(() => {}, [(findings || []).length]); // Re-run if finding count changes substantially
 
   return (

[NoCoverage] LogicalOperator
components/DifferentialPanel.tsx:38:8
 
   useEffect(() => {
     generate();
-  }, [(findings || []).length]); // Re-run if finding count changes substantially
+  }, [(findings && []).length]); // Re-run if finding count changes substantially
 
   return (

[NoCoverage] ConditionalExpression
components/DifferentialPanel.tsx:38:8
 
   useEffect(() => {
     generate();
-  }, [(findings || []).length]); // Re-run if finding count changes substantially
+  }, [(false).length]); // Re-run if finding count changes substantially
 
   return (

[NoCoverage] ConditionalExpression
components/DifferentialPanel.tsx:60:13
               Correlating Findings...
             </p>
           </div>
-        ) : (differentials || []).length > 0 ? (
+        ) : true ? (
           (differentials || []).map((d, i) => (
             <div

[NoCoverage] ConditionalExpression
components/DifferentialPanel.tsx:60:14
               Correlating Findings...
             </p>
           </div>
-        ) : (differentials || []).length > 0 ? (
+        ) : (false).length > 0 ? (
           (differentials || []).map((d, i) => (
             <div

[NoCoverage] ConditionalExpression
components/DifferentialPanel.tsx:61:12
             </p>
           </div>
         ) : (differentials || []).length > 0 ? (
-          (differentials || []).map((d, i) => (
+          (false).map((d, i) => (
             <div
               key={i}

[NoCoverage] ConditionalExpression
components/DifferentialPanel.tsx:61:12
             </p>
           </div>
         ) : (differentials || []).length > 0 ? (
-          (differentials || []).map((d, i) => (
+          (true).map((d, i) => (
             <div
               key={i}

[NoCoverage] StringLiteral
components/DifferentialPanel.tsx:69:30
               <div className="flex items-center justify-between mb-2">
                 <h4 className="text-[11px] font-black text-white leading-tight">{d.condition}</h4>
                 <span
-                  className={`text-[7px] font-black px-1.5 py-0.5 rounded-full uppercase ${
-                    d.probability === 'High'
-                      ? 'bg-red-100 text-red-600'
-                      : d.probability === 'Moderate'
-                        ? 'bg-amber-100 text-amber-600'
-                        : 'bg-blue-100 text-blue-600'
-                  }`}
+                  className={``}
                 >
                   {d.probability}

[NoCoverage] ConditionalExpression
components/DifferentialPanel.tsx:70:21
                 <h4 className="text-[11px] font-black text-white leading-tight">{d.condition}</h4>
                 <span
                   className={`text-[7px] font-black px-1.5 py-0.5 rounded-full uppercase ${
-                    d.probability === 'High'
+                    true
                       ? 'bg-red-100 text-red-600'
                       : d.probability === 'Moderate'

[NoCoverage] EqualityOperator
components/DifferentialPanel.tsx:70:21
                 <h4 className="text-[11px] font-black text-white leading-tight">{d.condition}</h4>
                 <span
                   className={`text-[7px] font-black px-1.5 py-0.5 rounded-full uppercase ${
-                    d.probability === 'High'
+                    d.probability !== 'High'
                       ? 'bg-red-100 text-red-600'
                       : d.probability === 'Moderate'

[NoCoverage] StringLiteral
components/DifferentialPanel.tsx:71:25
                 <span
                   className={`text-[7px] font-black px-1.5 py-0.5 rounded-full uppercase ${
                     d.probability === 'High'
-                      ? 'bg-red-100 text-red-600'
+                      ? ""
                       : d.probability === 'Moderate'
                         ? 'bg-amber-100 text-amber-600'

[NoCoverage] ConditionalExpression
components/DifferentialPanel.tsx:72:25
                   className={`text-[7px] font-black px-1.5 py-0.5 rounded-full uppercase ${
                     d.probability === 'High'
                       ? 'bg-red-100 text-red-600'
-                      : d.probability === 'Moderate'
+                      : false
                         ? 'bg-amber-100 text-amber-600'
                         : 'bg-blue-100 text-blue-600'

[NoCoverage] ConditionalExpression
components/DifferentialPanel.tsx:72:25
                   className={`text-[7px] font-black px-1.5 py-0.5 rounded-full uppercase ${
                     d.probability === 'High'
                       ? 'bg-red-100 text-red-600'
-                      : d.probability === 'Moderate'
+                      : true
                         ? 'bg-amber-100 text-amber-600'
                         : 'bg-blue-100 text-blue-600'

[NoCoverage] ConditionalExpression
components/DifferentialPanel.tsx:82:19
               </div>
               <p className="text-[10px] text-slate-400 leading-relaxed mb-3">{d.reasoning}</p>
               <div className="flex flex-wrap gap-1">
-                {(d.keyFindings || []).map((f, fi) => (
+                {(true).map((f, fi) => (
                   <span
                     key={fi}

[NoCoverage] LogicalOperator
components/DifferentialPanel.tsx:82:19
               </div>
               <p className="text-[10px] text-slate-400 leading-relaxed mb-3">{d.reasoning}</p>
               <div className="flex flex-wrap gap-1">
-                {(d.keyFindings || []).map((f, fi) => (
+                {(d.keyFindings && []).map((f, fi) => (
                   <span
                     key={fi}

[NoCoverage] LogicalOperator
components/DifferentialPanel.tsx:103:31
 
       <button
         onClick={generate}
-        disabled={loading || (findings || []).length === 0}
+        disabled={loading || (findings && []).length === 0}
       >

[NoCoverage] LogicalOperator
components/DifferentialPanel.tsx:103:19
 
       <button
         onClick={generate}
-        disabled={loading || (findings || []).length === 0}
+        disabled={loading && (findings || []).length === 0}
       >

[NoCoverage] StringLiteral
components/DifferentialPanel.tsx:106:69
         disabled={loading || (findings || []).length === 0}
       >
-        <RefreshCw className={`w-3 h-3 ${loading ? 'animate-spin' : ''}`} />
+        <RefreshCw className={`w-3 h-3 ${loading ? 'animate-spin' : "Stryker was here!"}`} />
         Refresh Analysis
       </button>
