[NoCoverage] BooleanLiteral
components/DownloadManager.tsx:23:44
 
 const DownloadManager: React.FC = () => {
   const [tasks, setTasks] = useState<DownloadTask[]>([]);
-  const [isPaused, setIsPaused] = useState(false);
+  const [isPaused, setIsPaused] = useState(true);
   const [isDraggingOverTrash, setIsDraggingOverTrash] = useState(false);
 

[NoCoverage] BooleanLiteral
components/DownloadManager.tsx:24:66
 const DownloadManager: React.FC = () => {
   const [tasks, setTasks] = useState<DownloadTask[]>([]);
   const [isPaused, setIsPaused] = useState(false);
-  const [isDraggingOverTrash, setIsDraggingOverTrash] = useState(false);
+  const [isDraggingOverTrash, setIsDraggingOverTrash] = useState(true);
 
   useEffect(() => {

[NoCoverage] BlockStatement
components/DownloadManager.tsx:26:19
   const [isPaused, setIsPaused] = useState(false);
   const [isDraggingOverTrash, setIsDraggingOverTrash] = useState(false);
 
-  useEffect(() => {
-    const unsub = downloadManager.subscribe((newTasks) => {
-      setTasks(newTasks);
-      setIsPaused(downloadManager.getPauseState());
-    });
-    return () => {
-      unsub();
-    };
-  }, []);
+  useEffect(() => {}, []);
 
   const stats = useMemo(() => {

[NoCoverage] BlockStatement
components/DownloadManager.tsx:27:59
   const [isDraggingOverTrash, setIsDraggingOverTrash] = useState(false);
 
   useEffect(() => {
-    const unsub = downloadManager.subscribe((newTasks) => {
-      setTasks(newTasks);
-      setIsPaused(downloadManager.getPauseState());
-    });
+    const unsub = downloadManager.subscribe((newTasks) => {});
     return () => {
       unsub();

[NoCoverage] BlockStatement
components/DownloadManager.tsx:31:18
       setTasks(newTasks);
       setIsPaused(downloadManager.getPauseState());
     });
-    return () => {
-      unsub();
-    };
+    return () => {};
   }, []);
 

[NoCoverage] BlockStatement
components/DownloadManager.tsx:36:31
     };
   }, []);
 
-  const stats = useMemo(() => {
-    const completed = tasks.filter((t) => t.status === 'completed').length;
-    const active = tasks.filter((t) => t.status === 'downloading').length;
-    const queued = tasks.filter((t) => t.status === 'pending').length;
-    const failed = tasks.filter((t) => t.status === 'failed').length;
-    return { completed, active, queued, failed, total: tasks.length };
-  }, [tasks]);
+  const stats = useMemo(() => {}, [tasks]);
 
   const getStatusIcon = (status: DownloadTask['status']) => {

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:37:43
   }, []);
 
   const stats = useMemo(() => {
-    const completed = tasks.filter((t) => t.status === 'completed').length;
+    const completed = tasks.filter((t) => true).length;
     const active = tasks.filter((t) => t.status === 'downloading').length;
     const queued = tasks.filter((t) => t.status === 'pending').length;

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:37:43
   }, []);
 
   const stats = useMemo(() => {
-    const completed = tasks.filter((t) => t.status === 'completed').length;
+    const completed = tasks.filter((t) => false).length;
     const active = tasks.filter((t) => t.status === 'downloading').length;
     const queued = tasks.filter((t) => t.status === 'pending').length;

[NoCoverage] EqualityOperator
components/DownloadManager.tsx:38:40
 
   const stats = useMemo(() => {
     const completed = tasks.filter((t) => t.status === 'completed').length;
-    const active = tasks.filter((t) => t.status === 'downloading').length;
+    const active = tasks.filter((t) => t.status !== 'downloading').length;
     const queued = tasks.filter((t) => t.status === 'pending').length;
     const failed = tasks.filter((t) => t.status === 'failed').length;

[NoCoverage] ArrowFunction
components/DownloadManager.tsx:38:33
 
   const stats = useMemo(() => {
     const completed = tasks.filter((t) => t.status === 'completed').length;
-    const active = tasks.filter((t) => t.status === 'downloading').length;
+    const active = tasks.filter(() => undefined).length;
     const queued = tasks.filter((t) => t.status === 'pending').length;
     const failed = tasks.filter((t) => t.status === 'failed').length;

[NoCoverage] MethodExpression
components/DownloadManager.tsx:39:20
   const stats = useMemo(() => {
     const completed = tasks.filter((t) => t.status === 'completed').length;
     const active = tasks.filter((t) => t.status === 'downloading').length;
-    const queued = tasks.filter((t) => t.status === 'pending').length;
+    const queued = tasks.length;
     const failed = tasks.filter((t) => t.status === 'failed').length;
     return { completed, active, queued, failed, total: tasks.length };

[NoCoverage] ArrowFunction
components/DownloadManager.tsx:39:33
   const stats = useMemo(() => {
     const completed = tasks.filter((t) => t.status === 'completed').length;
     const active = tasks.filter((t) => t.status === 'downloading').length;
-    const queued = tasks.filter((t) => t.status === 'pending').length;
+    const queued = tasks.filter(() => undefined).length;
     const failed = tasks.filter((t) => t.status === 'failed').length;
     return { completed, active, queued, failed, total: tasks.length };

[NoCoverage] EqualityOperator
components/DownloadManager.tsx:40:40
     const completed = tasks.filter((t) => t.status === 'completed').length;
     const active = tasks.filter((t) => t.status === 'downloading').length;
     const queued = tasks.filter((t) => t.status === 'pending').length;
-    const failed = tasks.filter((t) => t.status === 'failed').length;
+    const failed = tasks.filter((t) => t.status !== 'failed').length;
     return { completed, active, queued, failed, total: tasks.length };
   }, [tasks]);

[NoCoverage] MethodExpression
components/DownloadManager.tsx:40:20
     const completed = tasks.filter((t) => t.status === 'completed').length;
     const active = tasks.filter((t) => t.status === 'downloading').length;
     const queued = tasks.filter((t) => t.status === 'pending').length;
-    const failed = tasks.filter((t) => t.status === 'failed').length;
+    const failed = tasks.length;
     return { completed, active, queued, failed, total: tasks.length };
   }, [tasks]);

[NoCoverage] BlockStatement
components/DownloadManager.tsx:44:61
     return { completed, active, queued, failed, total: tasks.length };
   }, [tasks]);
 
-  const getStatusIcon = (status: DownloadTask['status']) => {
-    switch (status) {
-      case 'completed':
-        return <CheckCircle2 className="w-4 h-4 text-green-500" />;
-      case 'failed':
-        return <AlertCircle className="w-4 h-4 text-red-500" />;
-      case 'downloading':
-        return <Loader2 className="w-4 h-4 text-blue-500 animate-spin" />;
-      case 'paused':
-        return <Pause className="w-4 h-4 text-slate-400" />;
-      default:
-        return <RefreshCw className="w-4 h-4 text-slate-300" />;
-    }
-  };
+  const getStatusIcon = (status: DownloadTask['status']) => {};
 
   const getSubTaskStatus = (progress: number, start: number, end: number) => {

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:46:7
 
   const getStatusIcon = (status: DownloadTask['status']) => {
     switch (status) {
-      case 'completed':
-        return <CheckCircle2 className="w-4 h-4 text-green-500" />;
+      case 'completed':
       case 'failed':
         return <AlertCircle className="w-4 h-4 text-red-500" />;

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:48:7
     switch (status) {
       case 'completed':
         return <CheckCircle2 className="w-4 h-4 text-green-500" />;
-      case 'failed':
-        return <AlertCircle className="w-4 h-4 text-red-500" />;
+      case 'failed':
       case 'downloading':
         return <Loader2 className="w-4 h-4 text-blue-500 animate-spin" />;

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:50:7
         return <CheckCircle2 className="w-4 h-4 text-green-500" />;
       case 'failed':
         return <AlertCircle className="w-4 h-4 text-red-500" />;
-      case 'downloading':
-        return <Loader2 className="w-4 h-4 text-blue-500 animate-spin" />;
+      case 'downloading':
       case 'paused':
         return <Pause className="w-4 h-4 text-slate-400" />;

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:52:7
         return <AlertCircle className="w-4 h-4 text-red-500" />;
       case 'downloading':
         return <Loader2 className="w-4 h-4 text-blue-500 animate-spin" />;
-      case 'paused':
-        return <Pause className="w-4 h-4 text-slate-400" />;
+      case 'paused':
       default:
         return <RefreshCw className="w-4 h-4 text-slate-300" />;

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:54:7
         return <Loader2 className="w-4 h-4 text-blue-500 animate-spin" />;
       case 'paused':
         return <Pause className="w-4 h-4 text-slate-400" />;
-      default:
-        return <RefreshCw className="w-4 h-4 text-slate-300" />;
+      default:
     }
   };

[NoCoverage] BlockStatement
components/DownloadManager.tsx:59:78
     }
   };
 
-  const getSubTaskStatus = (progress: number, start: number, end: number) => {
-    if (progress >= end) return 'completed';
-    if (progress >= start) return 'active';
-    return 'pending';
-  };
+  const getSubTaskStatus = (progress: number, start: number, end: number) => {};
 
   const SubTaskPip: React.FC<{

[NoCoverage] EqualityOperator
components/DownloadManager.tsx:60:9
   };
 
   const getSubTaskStatus = (progress: number, start: number, end: number) => {
-    if (progress >= end) return 'completed';
+    if (progress > end) return 'completed';
     if (progress >= start) return 'active';
     return 'pending';

[NoCoverage] EqualityOperator
components/DownloadManager.tsx:60:9
   };
 
   const getSubTaskStatus = (progress: number, start: number, end: number) => {
-    if (progress >= end) return 'completed';
+    if (progress < end) return 'completed';
     if (progress >= start) return 'active';
     return 'pending';

[NoCoverage] EqualityOperator
components/DownloadManager.tsx:61:9
 
   const getSubTaskStatus = (progress: number, start: number, end: number) => {
     if (progress >= end) return 'completed';
-    if (progress >= start) return 'active';
+    if (progress > start) return 'active';
     return 'pending';
   };

[NoCoverage] EqualityOperator
components/DownloadManager.tsx:61:9
 
   const getSubTaskStatus = (progress: number, start: number, end: number) => {
     if (progress >= end) return 'completed';
-    if (progress >= start) return 'active';
+    if (progress < start) return 'active';
     return 'pending';
   };

[NoCoverage] StringLiteral
components/DownloadManager.tsx:62:12
   const getSubTaskStatus = (progress: number, start: number, end: number) => {
     if (progress >= end) return 'completed';
     if (progress >= start) return 'active';
-    return 'pending';
+    return "";
   };
 

[NoCoverage] ObjectLiteral
components/DownloadManager.tsx:71:20
     status: 'completed' | 'active' | 'pending';
     error?: boolean;
   }> = ({ label, icon, status, error }) => {
-    const colors = {
-      completed: 'text-emerald-500 border-emerald-950/30 bg-emerald-950/20',
-      active: 'text-blue-600 border-blue-200 bg-blue-950/20 animate-pulse',
-      pending: 'text-slate-300 border-slate-50 bg-slate-950/20'
-    };
+    const colors = {};
 
     return (

[NoCoverage] StringLiteral
components/DownloadManager.tsx:74:16
     const colors = {
       completed: 'text-emerald-500 border-emerald-950/30 bg-emerald-950/20',
       active: 'text-blue-600 border-blue-200 bg-blue-950/20 animate-pulse',
-      pending: 'text-slate-300 border-slate-50 bg-slate-950/20'
+      pending: ""
     };
 

[NoCoverage] EqualityOperator
components/DownloadManager.tsx:82:12
       >
         <div className="shrink-0">
-          {status === 'completed' ? <CheckCircle2 className="w-3.5 h-3.5" /> : icon}
+          {status !== 'completed' ? <CheckCircle2 className="w-3.5 h-3.5" /> : icon}
         </div>
         <span className="text-[7px] font-black uppercase tracking-tighter text-center">

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:82:12
       >
         <div className="shrink-0">
-          {status === 'completed' ? <CheckCircle2 className="w-3.5 h-3.5" /> : icon}
+          {true ? <CheckCircle2 className="w-3.5 h-3.5" /> : icon}
         </div>
         <span className="text-[7px] font-black uppercase tracking-tighter text-center">

[NoCoverage] ArrowFunction
components/DownloadManager.tsx:111:24
         <div className="flex items-center gap-3">
           <Tooltip content="Purge all downloaded data">
             <button
-              onClick={() => downloadManager.clearArchive()}
+              onClick={() => undefined}
               className="p-3 bg-slate-950/40 border border-white/5 text-slate-400 hover:text-red-500 hover:border-red-200 rounded-xl transition-all shadow-sm"
             >

[NoCoverage] ArrowFunction
components/DownloadManager.tsx:119:22
           </Tooltip>
 
           <button
-            onClick={() => downloadManager.downloadAll()}
+            onClick={() => undefined}
             className="px-6 py-2.5 bg-slate-900 text-white rounded-xl font-black uppercase tracking-widest text-[10px] transition-all hover:bg-slate-800 shadow-xl flex items-center gap-2"
           >

[NoCoverage] ArrowFunction
components/DownloadManager.tsx:127:24
 
           <Tooltip content={isPaused ? 'Resume Pipeline' : 'Pause Queue'}>
             <button
-              onClick={() => downloadManager.togglePause()}
+              onClick={() => undefined}
             >

[NoCoverage] StringLiteral
components/DownloadManager.tsx:130:38
               onClick={() => downloadManager.togglePause()}
             >
-              {isPaused ? 'Resume' : 'Pause'}
+              {isPaused ? 'Resume' : ""}
             </button>
           </Tooltip>

[NoCoverage] EqualityOperator
components/DownloadManager.tsx:139:14
       <div className="grid grid-cols-1 lg:grid-cols-4 gap-8 flex-1 min-h-0">
         <div className="lg:col-span-3 flex flex-col min-h-0">
           <div className="flex-1 bg-slate-950/20 rounded-[40px] border border-white/5 overflow-y-auto p-6 space-y-4 custom-scrollbar">
-            {tasks.length === 0 ? (
+            {tasks.length !== 0 ? (
               <div className="h-full flex flex-col items-center justify-center text-slate-300 animate-in fade-in duration-1000">
                 <div className="p-6 bg-slate-950/40 rounded-full shadow-inner border border-slate-50 mb-4">

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:139:14
       <div className="grid grid-cols-1 lg:grid-cols-4 gap-8 flex-1 min-h-0">
         <div className="lg:col-span-3 flex flex-col min-h-0">
           <div className="flex-1 bg-slate-950/20 rounded-[40px] border border-white/5 overflow-y-auto p-6 space-y-4 custom-scrollbar">
-            {tasks.length === 0 ? (
+            {false ? (
               <div className="h-full flex flex-col items-center justify-center text-slate-300 animate-in fade-in duration-1000">
                 <div className="p-6 bg-slate-950/40 rounded-full shadow-inner border border-slate-50 mb-4">

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:154:34
             ) : (
               tasks.map((task, idx) => {
                 const p = task.progress;
-                const isFailed = task.status === 'failed';
+                const isFailed = false;
                 const isQueued = task.status === 'pending';
 

[NoCoverage] EqualityOperator
components/DownloadManager.tsx:154:34
             ) : (
               tasks.map((task, idx) => {
                 const p = task.progress;
-                const isFailed = task.status === 'failed';
+                const isFailed = task.status !== 'failed';
                 const isQueued = task.status === 'pending';
 

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:155:34
               tasks.map((task, idx) => {
                 const p = task.progress;
                 const isFailed = task.status === 'failed';
-                const isQueued = task.status === 'pending';
+                const isQueued = true;
 
                 return (

[NoCoverage] EqualityOperator
components/DownloadManager.tsx:155:34
               tasks.map((task, idx) => {
                 const p = task.progress;
                 const isFailed = task.status === 'failed';
-                const isQueued = task.status === 'pending';
+                const isQueued = task.status !== 'pending';
 
                 return (

[NoCoverage] ArrowFunction
components/DownloadManager.tsx:161:34
                   <div
                     key={task.id}
                     draggable
-                    onDragStart={(e) => e.dataTransfer.setData('taskId', task.id)}
+                    onDragStart={() => undefined}
                     className={`p-6 bg-slate-950/40 rounded-[32px] border transition-all duration-500 animate-in slide-in-from-right-4 group/task ${
                       isQueued

[NoCoverage] StringLiteral
components/DownloadManager.tsx:165:27
                     className={`p-6 bg-slate-950/40 rounded-[32px] border transition-all duration-500 animate-in slide-in-from-right-4 group/task ${
                       isQueued
                         ? 'opacity-60 grayscale-[0.5] border-slate-50'
-                        : 'border-white/5 shadow-sm hover:shadow-md'
+                        : ""
                     }`}
                     style={{ animationDelay: `${idx * 100}ms` }}

[NoCoverage] ArithmeticOperator
components/DownloadManager.tsx:167:49
                         ? 'opacity-60 grayscale-[0.5] border-slate-50'
                         : 'border-white/5 shadow-sm hover:shadow-md'
                     }`}
-                    style={{ animationDelay: `${idx * 100}ms` }}
+                    style={{ animationDelay: `${idx / 100}ms` }}
                   >
                     <div className="flex items-center justify-between gap-4 mb-6">

[NoCoverage] StringLiteral
components/DownloadManager.tsx:167:46
                         ? 'opacity-60 grayscale-[0.5] border-slate-50'
                         : 'border-white/5 shadow-sm hover:shadow-md'
                     }`}
-                    style={{ animationDelay: `${idx * 100}ms` }}
+                    style={{ animationDelay: `` }}
                   >
                     <div className="flex items-center justify-between gap-4 mb-6">

[NoCoverage] StringLiteral
components/DownloadManager.tsx:172:110
                     <div className="flex items-center justify-between gap-4 mb-6">
                       <div className="flex items-center gap-4">
                         <div
-                          className={`p-3 rounded-2xl transition-all duration-500 ${isFailed ? 'bg-red-50' : 'bg-slate-950/20'}`}
+                          className={`p-3 rounded-2xl transition-all duration-500 ${isFailed ? 'bg-red-50' : ""}`}
                         >
                           {getStatusIcon(task.status)}

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:181:30
                             <h4 className="text-sm font-black text-white leading-none">
                               {task.examName}
                             </h4>
-                            {isFailed && (
-                              <button
-                                onClick={() => downloadManager.retryTask(task.id)}
-                                className="flex items-center gap-1.5 px-2 py-0.5 bg-red-100 text-red-600 rounded-md text-[8px] font-black uppercase hover:bg-red-600 hover:text-white transition-all"
-                              >
-                                <RefreshCw className="w-2.5 h-2.5" /> Retry
-                              </button>
-                            )}
+                            {false}
                           </div>
                           <div className="flex items-center gap-2 mt-1">

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:181:30
                             <h4 className="text-sm font-black text-white leading-none">
                               {task.examName}
                             </h4>
-                            {isFailed && (
-                              <button
-                                onClick={() => downloadManager.retryTask(task.id)}
-                                className="flex items-center gap-1.5 px-2 py-0.5 bg-red-100 text-red-600 rounded-md text-[8px] font-black uppercase hover:bg-red-600 hover:text-white transition-all"
-                              >
-                                <RefreshCw className="w-2.5 h-2.5" /> Retry
-                              </button>
-                            )}
+                            {true}
                           </div>
                           <div className="flex items-center gap-2 mt-1">

[NoCoverage] ArrowFunction
components/DownloadManager.tsx:183:42
                             </h4>
                             {isFailed && (
                               <button
-                                onClick={() => downloadManager.retryTask(task.id)}
+                                onClick={() => undefined}
                                 className="flex items-center gap-1.5 px-2 py-0.5 bg-red-100 text-red-600 rounded-md text-[8px] font-black uppercase hover:bg-red-600 hover:text-white transition-all"
                               >

[NoCoverage] StringLiteral
components/DownloadManager.tsx:196:84
                             </span>
                             <span className="w-1 h-1 rounded-full bg-slate-200" />
                             <span
-                              className={`text-[9px] font-bold italic ${isFailed ? 'text-red-500' : isQueued ? 'text-slate-400' : 'text-blue-500'}`}
+                              className={`text-[9px] font-bold italic ${isFailed ? "" : isQueued ? 'text-slate-400' : 'text-blue-500'}`}
                             >
                               {task.error ||

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:198:32
                             <span
                               className={`text-[9px] font-bold italic ${isFailed ? 'text-red-500' : isQueued ? 'text-slate-400' : 'text-blue-500'}`}
                             >
-                              {task.error ||
-                                (task.status === 'completed'
-                                  ? 'Stored'
-                                  : isQueued
-                                    ? 'Waiting in Queue...'
-                                    : 'Syncing Assets...')}
+                              {true}
                             </span>
                           </div>

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:198:32
                             <span
                               className={`text-[9px] font-bold italic ${isFailed ? 'text-red-500' : isQueued ? 'text-slate-400' : 'text-blue-500'}`}
                             >
-                              {task.error ||
-                                (task.status === 'completed'
-                                  ? 'Stored'
-                                  : isQueued
-                                    ? 'Waiting in Queue...'
-                                    : 'Syncing Assets...')}
+                              {false}
                             </span>
                           </div>

[NoCoverage] EqualityOperator
components/DownloadManager.tsx:199:34
                               className={`text-[9px] font-bold italic ${isFailed ? 'text-red-500' : isQueued ? 'text-slate-400' : 'text-blue-500'}`}
                             >
                               {task.error ||
-                                (task.status === 'completed'
+                                (task.status !== 'completed'
                                   ? 'Stored'
                                   : isQueued

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:199:34
                               className={`text-[9px] font-bold italic ${isFailed ? 'text-red-500' : isQueued ? 'text-slate-400' : 'text-blue-500'}`}
                             >
                               {task.error ||
-                                (task.status === 'completed'
+                                (false
                                   ? 'Stored'
                                   : isQueued

[NoCoverage] StringLiteral
components/DownloadManager.tsx:200:37
                             >
                               {task.error ||
                                 (task.status === 'completed'
-                                  ? 'Stored'
+                                  ? ""
                                   : isQueued
                                     ? 'Waiting in Queue...'

[NoCoverage] ObjectLiteral
components/DownloadManager.tsx:247:32
                     <div className="mt-4 w-full h-1 bg-slate-950/20 rounded-full overflow-hidden">
                       <div
                         className={`h-full transition-all duration-1000 ${isFailed ? 'bg-red-500' : 'bg-blue-600'}`}
-                        style={{ width: `${p}%` }}
+                        style={{}}
                       />
                     </div>

[NoCoverage] BlockStatement
components/DownloadManager.tsx:259:28
 
         <div className="space-y-6 flex flex-col">
           <div
-            onDrop={(e) => {
-              e.preventDefault();
-              const id = e.dataTransfer.getData('taskId');
-              if (id) downloadManager.cancelTask(id);
-              setIsDraggingOverTrash(false);
-            }}
+            onDrop={(e) => {}}
             onDragOver={(e) => {
               e.preventDefault();

[NoCoverage] StringLiteral
components/DownloadManager.tsx:261:49
           <div
             onDrop={(e) => {
               e.preventDefault();
-              const id = e.dataTransfer.getData('taskId');
+              const id = e.dataTransfer.getData("");
               if (id) downloadManager.cancelTask(id);
               setIsDraggingOverTrash(false);

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:262:19
             onDrop={(e) => {
               e.preventDefault();
               const id = e.dataTransfer.getData('taskId');
-              if (id) downloadManager.cancelTask(id);
+              if (false) downloadManager.cancelTask(id);
               setIsDraggingOverTrash(false);
             }}

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:262:19
             onDrop={(e) => {
               e.preventDefault();
               const id = e.dataTransfer.getData('taskId');
-              if (id) downloadManager.cancelTask(id);
+              if (true) downloadManager.cancelTask(id);
               setIsDraggingOverTrash(false);
             }}

[NoCoverage] BooleanLiteral
components/DownloadManager.tsx:263:38
               e.preventDefault();
               const id = e.dataTransfer.getData('taskId');
               if (id) downloadManager.cancelTask(id);
-              setIsDraggingOverTrash(false);
+              setIsDraggingOverTrash(true);
             }}
             onDragOver={(e) => {

[NoCoverage] BlockStatement
components/DownloadManager.tsx:265:32
               if (id) downloadManager.cancelTask(id);
               setIsDraggingOverTrash(false);
             }}
-            onDragOver={(e) => {
-              e.preventDefault();
-              setIsDraggingOverTrash(true);
-            }}
+            onDragOver={(e) => {}}
             onDragLeave={() => setIsDraggingOverTrash(false)}

[NoCoverage] BooleanLiteral
components/DownloadManager.tsx:267:38
             }}
             onDragOver={(e) => {
               e.preventDefault();
-              setIsDraggingOverTrash(true);
+              setIsDraggingOverTrash(false);
             }}
             onDragLeave={() => setIsDraggingOverTrash(false)}

[NoCoverage] ArrowFunction
components/DownloadManager.tsx:269:26
               e.preventDefault();
               setIsDraggingOverTrash(true);
             }}
-            onDragLeave={() => setIsDraggingOverTrash(false)}
+            onDragLeave={() => undefined}
           >

[NoCoverage] BooleanLiteral
components/DownloadManager.tsx:269:55
               e.preventDefault();
               setIsDraggingOverTrash(true);
             }}
-            onDragLeave={() => setIsDraggingOverTrash(false)}
+            onDragLeave={() => setIsDraggingOverTrash(true)}
           >

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:292:20
                 <p className="text-3xl font-black tracking-tighter tabular-nums">
                   {stats.completed}
                   <span className="text-slate-400 mx-1">/</span>
-                  {stats.total || '0'}
+                  {true}
                 </p>
                 <p className="text-[10px] font-bold text-slate-400 uppercase tracking-widest">

[NoCoverage] LogicalOperator
components/DownloadManager.tsx:292:20
                 <p className="text-3xl font-black tracking-tighter tabular-nums">
                   {stats.completed}
                   <span className="text-slate-400 mx-1">/</span>
-                  {stats.total || '0'}
+                  {stats.total && '0'}
                 </p>
                 <p className="text-[10px] font-bold text-slate-400 uppercase tracking-widest">
