[NoCoverage] ObjectLiteral
components/DownloadManager.tsx:302:28
                 <div className="flex-1 h-1.5 bg-slate-800 rounded-full overflow-hidden">
                   <div
                     className="h-full bg-blue-950/200 transition-all duration-1000"
-                    style={{
-                      width: `${stats.total > 0 ? (stats.completed / stats.total) * 100 : 0}%`
-                    }}
+                    style={{}}
                   />
                 </div>

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:303:33
                   <div
                     className="h-full bg-blue-950/200 transition-all duration-1000"
                     style={{
-                      width: `${stats.total > 0 ? (stats.completed / stats.total) * 100 : 0}%`
+                      width: `${true ? (stats.completed / stats.total) * 100 : 0}%`
                     }}
                   />

[NoCoverage] ArithmeticOperator
components/DownloadManager.tsx:303:51
                   <div
                     className="h-full bg-blue-950/200 transition-all duration-1000"
                     style={{
-                      width: `${stats.total > 0 ? (stats.completed / stats.total) * 100 : 0}%`
+                      width: `${stats.total > 0 ? stats.completed / stats.total / 100 : 0}%`
                     }}
                   />

[NoCoverage] EqualityOperator
components/DownloadManager.tsx:308:16
                   />
                 </div>
               </div>
-              {stats.failed > 0 && (
+              {stats.failed <= 0 && (
                 <p className="text-[8px] font-black text-red-400 uppercase tracking-widest mt-2 flex items-center gap-1">
                   <AlertCircle className="w-2.5 h-2.5" /> {stats.failed} Pipeline Disruptions

[NoCoverage] EqualityOperator
components/DownloadManager.tsx:308:16
                   />
                 </div>
               </div>
-              {stats.failed > 0 && (
+              {stats.failed >= 0 && (
                 <p className="text-[8px] font-black text-red-400 uppercase tracking-widest mt-2 flex items-center gap-1">
                   <AlertCircle className="w-2.5 h-2.5" /> {stats.failed} Pipeline Disruptions

[NoCoverage] LogicalOperator
components/DownloadManager.tsx:313:16
                   <AlertCircle className="w-2.5 h-2.5" /> {stats.failed} Pipeline Disruptions
                 </p>
               )}
-              {stats.queued > 0 && (
-                <p className="text-[8px] font-black text-blue-400 uppercase tracking-widest mt-1">
-                  {stats.queued} Sequential Tasks Pending
-                </p>
-              )}
+              {stats.queued > 0 || <p className="text-[8px] font-black text-blue-400 uppercase tracking-widest mt-1">
+                  {stats.queued} Sequential Tasks Pending
+                </p>}
             </div>
           </div>

[NoCoverage] ConditionalExpression
components/DownloadManager.tsx:313:16
                   <AlertCircle className="w-2.5 h-2.5" /> {stats.failed} Pipeline Disruptions
                 </p>
               )}
-              {stats.queued > 0 && (
-                <p className="text-[8px] font-black text-blue-400 uppercase tracking-widest mt-1">
-                  {stats.queued} Sequential Tasks Pending
-                </p>
-              )}
+              {false}
             </div>
           </div>
