[NoCoverage] StringLiteral
components/ECGView.tsx:30:9
 
 const DEFAULT_PATTERNS: ECGPattern[] = [
   {
-    id: 'stemi',
+    id: "",
     name: 'STEMI',
     category: 'Ischemia',

[NoCoverage] StringLiteral
components/ECGView.tsx:33:18
     id: 'stemi',
     name: 'STEMI',
     category: 'Ischemia',
-    description: 'ST-segment elevation myocardial infarction indicating acute transmural ischemia.',
+    description: "",
     criteria: [
       'New ST elevation at the J point in at least 2 contiguous leads',

[NoCoverage] StringLiteral
components/ECGView.tsx:37:7
     criteria: [
       'New ST elevation at the J point in at least 2 contiguous leads',
       '≥ 2 mm in men ≥ 40 yr, ≥ 2.5 mm in men < 40 yr, or ≥ 1.5 mm in women in V2-V3',
-      '≥ 1 mm in all other leads'
+      ""
     ],
     clinicalSignificance:

[NoCoverage] StringLiteral
components/ECGView.tsx:44:7
     management: [
       'Aspirin 300mg',
       'Clopidogrel/Ticagrelor',
-      'Heparin/Enoxaparin',
+      "",
       'Immediate Cardiology consult for PCI'
     ]

[NoCoverage] StringLiteral
components/ECGView.tsx:45:7
       'Aspirin 300mg',
       'Clopidogrel/Ticagrelor',
       'Heparin/Enoxaparin',
-      'Immediate Cardiology consult for PCI'
+      ""
     ]
   },

[NoCoverage] StringLiteral
components/ECGView.tsx:50:11
   },
   {
     id: 'lbbb',
-    name: 'Left Bundle Branch Block',
+    name: "",
     category: 'Conduction',
     description: 'Delayed activation of the left ventricle.',

[NoCoverage] StringLiteral
components/ECGView.tsx:51:15
   {
     id: 'lbbb',
     name: 'Left Bundle Branch Block',
-    category: 'Conduction',
+    category: "",
     description: 'Delayed activation of the left ventricle.',
     criteria: [

[NoCoverage] StringLiteral
components/ECGView.tsx:54:7
     category: 'Conduction',
     description: 'Delayed activation of the left ventricle.',
     criteria: [
-      'QRS duration > 120 ms',
+      "",
       'Dominant S wave in V1',
       'Broad monophasic R wave in lateral leads (I, aVL, V5-V6)',

[NoCoverage] StringLiteral
components/ECGView.tsx:55:7
     description: 'Delayed activation of the left ventricle.',
     criteria: [
       'QRS duration > 120 ms',
-      'Dominant S wave in V1',
+      "",
       'Broad monophasic R wave in lateral leads (I, aVL, V5-V6)',
       'Absence of Q waves in lateral leads'

[NoCoverage] StringLiteral
components/ECGView.tsx:56:7
     criteria: [
       'QRS duration > 120 ms',
       'Dominant S wave in V1',
-      'Broad monophasic R wave in lateral leads (I, aVL, V5-V6)',
+      "",
       'Absence of Q waves in lateral leads'
     ],

[NoCoverage] ArrayDeclaration
components/ECGView.tsx:61:17
     ],
     clinicalSignificance:
       'Can mask STEMI. New LBBB with chest pain is treated as STEMI equivalent.',
-    management: [
-      'Assess for underlying heart disease',
-      'Compare with old ECG',
-      'Sgarbossa criteria if ischemia suspected'
-    ]
+    management: []
   },
   {

[NoCoverage] StringLiteral
components/ECGView.tsx:63:7
       'Can mask STEMI. New LBBB with chest pain is treated as STEMI equivalent.',
     management: [
       'Assess for underlying heart disease',
-      'Compare with old ECG',
+      "",
       'Sgarbossa criteria if ischemia suspected'
     ]

[NoCoverage] StringLiteral
components/ECGView.tsx:71:18
     id: 'hyperkalemia',
     name: 'Hyperkalemia',
     category: 'Metabolic',
-    description: 'ECG changes associated with elevated serum potassium.',
+    description: "",
     criteria: [
       'Peaked T waves (narrow-based, "tented")',

[NoCoverage] StringLiteral
components/ECGView.tsx:75:7
     criteria: [
       'Peaked T waves (narrow-based, "tented")',
       'P wave flattening/loss',
-      'PR prolongation',
+      "",
       'QRS widening',
       'Sine wave pattern (pre-arrest)'

[NoCoverage] StringLiteral
components/ECGView.tsx:76:7
       'Peaked T waves (narrow-based, "tented")',
       'P wave flattening/loss',
       'PR prolongation',
-      'QRS widening',
+      "",
       'Sine wave pattern (pre-arrest)'
     ],

[NoCoverage] ArrayDeclaration
components/ECGView.tsx:80:17
       'Sine wave pattern (pre-arrest)'
     ],
     clinicalSignificance: 'Medical emergency. Risk of ventricular fibrillation and asystole.',
-    management: [
-      'Calcium gluconate/chloride (stabilize membrane)',
-      'Insulin/Dextrose',
-      'Salbutamol',
-      'Resonium/Dialysis'
-    ]
+    management: []
   },
   {

[NoCoverage] StringLiteral
components/ECGView.tsx:94:7
     description: 'Irregularly irregular rhythm with absent P waves.',
     criteria: [
       'Irregularly irregular ventricular rhythm',
-      'No discernible P waves',
+      "",
       'Fibrillatory waves (f-waves) may be present'
     ],

[NoCoverage] ArrayDeclaration
components/ECGView.tsx:98:17
       'Fibrillatory waves (f-waves) may be present'
     ],
     clinicalSignificance: 'Risk of thromboembolism (stroke) and heart failure.',
-    management: [
-      'Rate control (Beta-blockers/CCB)',
-      'Rhythm control (Amiodarone/DCCV)',
-      'Anticoagulation (CHA2DS2-VASc)'
-    ]
+    management: []
   }
 ];

[NoCoverage] ArrayDeclaration
components/ECGView.tsx:109:70
 export const ECGView: React.FC = () => {
   const [activePattern, setActivePattern] = useState<string | null>(null);
   const [searchQuery, setSearchQuery] = useState('');
-  const [customPatterns, setCustomPatterns] = useState<ECGPattern[]>([]);
+  const [customPatterns, setCustomPatterns] = useState<ECGPattern[]>(["Stryker was here"]);
   const [enlargedImage, setEnlargedImage] = useState<{ src: string; alt: string } | null>(null);
   const [isFetchingAI, setIsFetchingAI] = useState(false);

[NoCoverage] BooleanLiteral
components/ECGView.tsx:111:52
   const [searchQuery, setSearchQuery] = useState('');
   const [customPatterns, setCustomPatterns] = useState<ECGPattern[]>([]);
   const [enlargedImage, setEnlargedImage] = useState<{ src: string; alt: string } | null>(null);
-  const [isFetchingAI, setIsFetchingAI] = useState(false);
+  const [isFetchingAI, setIsFetchingAI] = useState(true);
   const [fetchError, setFetchError] = useState<string | null>(null);
 

[NoCoverage] BlockStatement
components/ECGView.tsx:114:25
   const [isFetchingAI, setIsFetchingAI] = useState(false);
   const [fetchError, setFetchError] = useState<string | null>(null);
 
-  React.useEffect(() => {
-    const loadCustom = async () => {
-      const saved = await storage.getAllECGPatterns();
-      setCustomPatterns(saved);
-    };
-    loadCustom();
-  }, []);
+  React.useEffect(() => {}, []);
 
   const allPatterns = useMemo(() => {

[NoCoverage] BlockStatement
components/ECGView.tsx:115:36
   const [fetchError, setFetchError] = useState<string | null>(null);
 
   React.useEffect(() => {
-    const loadCustom = async () => {
-      const saved = await storage.getAllECGPatterns();
-      setCustomPatterns(saved);
-    };
+    const loadCustom = async () => {};
     loadCustom();
   }, []);

[NoCoverage] ArrayDeclaration
components/ECGView.tsx:120:6
       setCustomPatterns(saved);
     };
     loadCustom();
-  }, []);
+  }, ["Stryker was here"]);
 
   const allPatterns = useMemo(() => {

[NoCoverage] BlockStatement
components/ECGView.tsx:122:37
     loadCustom();
   }, []);
 
-  const allPatterns = useMemo(() => {
-    return [...DEFAULT_PATTERNS, ...customPatterns];
-  }, [customPatterns]);
+  const allPatterns = useMemo(() => {}, [customPatterns]);
 
   const { results: filteredPatterns, didYouMean } = useClinicalSearch(allPatterns, searchQuery, [

[NoCoverage] BlockStatement
components/ECGView.tsx:131:41
     'category'
   ]);
 
-  const selectedPattern = useMemo(() => {
-    return allPatterns.find((p) => p.id === activePattern);
-  }, [activePattern, allPatterns]);
+  const selectedPattern = useMemo(() => {}, [activePattern, allPatterns]);
 
   const handleAIFetch = async () => {

[NoCoverage] ConditionalExpression
components/ECGView.tsx:132:36
   ]);
 
   const selectedPattern = useMemo(() => {
-    return allPatterns.find((p) => p.id === activePattern);
+    return allPatterns.find((p) => false);
   }, [activePattern, allPatterns]);
 

[NoCoverage] ConditionalExpression
components/ECGView.tsx:132:36
   ]);
 
   const selectedPattern = useMemo(() => {
-    return allPatterns.find((p) => p.id === activePattern);
+    return allPatterns.find((p) => true);
   }, [activePattern, allPatterns]);
 

[NoCoverage] ConditionalExpression
components/ECGView.tsx:136:9
   }, [activePattern, allPatterns]);
 
   const handleAIFetch = async () => {
-    if (!searchQuery.trim()) return;
+    if (true) return;
 
     setIsFetchingAI(true);

[NoCoverage] ConditionalExpression
components/ECGView.tsx:136:9
   }, [activePattern, allPatterns]);
 
   const handleAIFetch = async () => {
-    if (!searchQuery.trim()) return;
+    if (false) return;
 
     setIsFetchingAI(true);

[NoCoverage] BooleanLiteral
components/ECGView.tsx:138:21
   const handleAIFetch = async () => {
     if (!searchQuery.trim()) return;
 
-    setIsFetchingAI(true);
+    setIsFetchingAI(false);
     setFetchError(null);
     try {

[NoCoverage] BlockStatement
components/ECGView.tsx:140:9
 
     setIsFetchingAI(true);
     setFetchError(null);
-    try {
-      const pattern = await gemini.generateECGPattern(searchQuery);
-
-      // Save to storage
-      await storage.saveECGPattern(pattern);
-
-      // Update local state
-      setCustomPatterns((prev) => {
-        const exists = prev.find((p) => p.id === pattern.id);
-        if (exists) return prev.map((p) => (p.id === pattern.id ? pattern : p));
-        return [...prev, pattern];
-      });
-
-      setActivePattern(pattern.id);
-      setSearchQuery('');
-    } catch (err: any) {
+    try {} catch (err: any) {
       console.error('AI Fetch Error:', err);
       setFetchError(

[NoCoverage] BlockStatement
components/ECGView.tsx:147:35
       await storage.saveECGPattern(pattern);
 
       // Update local state
-      setCustomPatterns((prev) => {
-        const exists = prev.find((p) => p.id === pattern.id);
-        if (exists) return prev.map((p) => (p.id === pattern.id ? pattern : p));
-        return [...prev, pattern];
-      });
+      setCustomPatterns((prev) => {});
 
       setActivePattern(pattern.id);

[NoCoverage] EqualityOperator
components/ECGView.tsx:148:41
 
       // Update local state
       setCustomPatterns((prev) => {
-        const exists = prev.find((p) => p.id === pattern.id);
+        const exists = prev.find((p) => p.id !== pattern.id);
         if (exists) return prev.map((p) => (p.id === pattern.id ? pattern : p));
         return [...prev, pattern];

[NoCoverage] ConditionalExpression
components/ECGView.tsx:148:41
 
       // Update local state
       setCustomPatterns((prev) => {
-        const exists = prev.find((p) => p.id === pattern.id);
+        const exists = prev.find((p) => true);
         if (exists) return prev.map((p) => (p.id === pattern.id ? pattern : p));
         return [...prev, pattern];

[NoCoverage] ArrowFunction
components/ECGView.tsx:149:37
       // Update local state
       setCustomPatterns((prev) => {
         const exists = prev.find((p) => p.id === pattern.id);
-        if (exists) return prev.map((p) => (p.id === pattern.id ? pattern : p));
+        if (exists) return prev.map(() => undefined);
         return [...prev, pattern];
       });

[NoCoverage] ConditionalExpression
components/ECGView.tsx:149:45
       // Update local state
       setCustomPatterns((prev) => {
         const exists = prev.find((p) => p.id === pattern.id);
-        if (exists) return prev.map((p) => (p.id === pattern.id ? pattern : p));
+        if (exists) return prev.map((p) => (false ? pattern : p));
         return [...prev, pattern];
       });

[NoCoverage] ArrayDeclaration
components/ECGView.tsx:150:16
       setCustomPatterns((prev) => {
         const exists = prev.find((p) => p.id === pattern.id);
         if (exists) return prev.map((p) => (p.id === pattern.id ? pattern : p));
-        return [...prev, pattern];
+        return [];
       });
 

[NoCoverage] BlockStatement
components/ECGView.tsx:155:24
 
       setActivePattern(pattern.id);
       setSearchQuery('');
-    } catch (err: any) {
-      console.error('AI Fetch Error:', err);
-      setFetchError(
-        'Failed to fetch pattern details from AI. Please try a more specific clinical term.'
-      );
-    } finally {
+    } catch (err: any) {} finally {
       setIsFetchingAI(false);
     }

[NoCoverage] StringLiteral
components/ECGView.tsx:158:9
     } catch (err: any) {
       console.error('AI Fetch Error:', err);
       setFetchError(
-        'Failed to fetch pattern details from AI. Please try a more specific clinical term.'
+        ""
       );
     } finally {

[NoCoverage] BlockStatement
components/ECGView.tsx:160:15
       setFetchError(
         'Failed to fetch pattern details from AI. Please try a more specific clinical term.'
       );
-    } finally {
-      setIsFetchingAI(false);
-    }
+    } finally {}
   };
 

[NoCoverage] BooleanLiteral
components/ECGView.tsx:161:23
         'Failed to fetch pattern details from AI. Please try a more specific clinical term.'
       );
     } finally {
-      setIsFetchingAI(false);
+      setIsFetchingAI(true);
     }
   };

[NoCoverage] ConditionalExpression
components/ECGView.tsx:195:12
             />
           </div>
 
-          {didYouMean && (
-            <div className="flex justify-start">
-              <button
-                onClick={() => setSearchQuery(didYouMean)}
-                className="flex items-center gap-2 px-4 py-2 bg-rose-950/20 hover:bg-rose-100 text-rose-600 rounded-xl transition-all shadow-sm w-full"
-              >
-                <span className="text-[10px] font-black uppercase tracking-widest text-rose-400 shrink-0">
-                  Did you mean
-                </span>
-                <span className="text-xs font-bold border-b border-rose-600 border-dashed truncate">
-                  {didYouMean}
-                </span>
-                <span className="text-[10px] font-black uppercase tracking-widest text-rose-400 shrink-0">
-                  ?
-                </span>
-              </button>
-            </div>
-          )}
+          {false}
 
           <div className="space-y-2">

[NoCoverage] ConditionalExpression
components/ECGView.tsx:195:12
             />
           </div>
 
-          {didYouMean && (
-            <div className="flex justify-start">
-              <button
-                onClick={() => setSearchQuery(didYouMean)}
-                className="flex items-center gap-2 px-4 py-2 bg-rose-950/20 hover:bg-rose-100 text-rose-600 rounded-xl transition-all shadow-sm w-full"
-              >
-                <span className="text-[10px] font-black uppercase tracking-widest text-rose-400 shrink-0">
-                  Did you mean
-                </span>
-                <span className="text-xs font-bold border-b border-rose-600 border-dashed truncate">
-                  {didYouMean}
-                </span>
-                <span className="text-[10px] font-black uppercase tracking-widest text-rose-400 shrink-0">
-                  ?
-                </span>
-              </button>
-            </div>
-          )}
+          {true}
 
           <div className="space-y-2">

[NoCoverage] ConditionalExpression
components/ECGView.tsx:215:14
           )}
 
           <div className="space-y-2">
-            {filteredPatterns.length > 0
+            {true
               ? filteredPatterns.map((pattern) => (
                   <button

[NoCoverage] EqualityOperator
components/ECGView.tsx:215:14
           )}
 
           <div className="space-y-2">
-            {filteredPatterns.length > 0
+            {filteredPatterns.length >= 0
               ? filteredPatterns.map((pattern) => (
                   <button

[NoCoverage] ArrowFunction
components/ECGView.tsx:219:30
               ? filteredPatterns.map((pattern) => (
                   <button
                     key={pattern.id}
-                    onClick={() => setActivePattern(pattern.id)}
+                    onClick={() => undefined}
                     className={`w-full flex items-center gap-4 p-4 rounded-2xl transition-all text-left ${
                       activePattern === pattern.id

[NoCoverage] ConditionalExpression
components/ECGView.tsx:221:23
                     key={pattern.id}
                     onClick={() => setActivePattern(pattern.id)}
                     className={`w-full flex items-center gap-4 p-4 rounded-2xl transition-all text-left ${
-                      activePattern === pattern.id
+                      false
                         ? 'bg-rose-600 text-white shadow-lg shadow-rose-200'
                         : 'bg-slate-950/40 border border-white/5 text-slate-400 hover:border-white/5'

[NoCoverage] ConditionalExpression
components/ECGView.tsx:221:23
                     key={pattern.id}
                     onClick={() => setActivePattern(pattern.id)}
                     className={`w-full flex items-center gap-4 p-4 rounded-2xl transition-all text-left ${
-                      activePattern === pattern.id
+                      true
                         ? 'bg-rose-600 text-white shadow-lg shadow-rose-200'
                         : 'bg-slate-950/40 border border-white/5 text-slate-400 hover:border-white/5'

[NoCoverage] StringLiteral
components/ECGView.tsx:223:27
                     className={`w-full flex items-center gap-4 p-4 rounded-2xl transition-all text-left ${
                       activePattern === pattern.id
                         ? 'bg-rose-600 text-white shadow-lg shadow-rose-200'
-                        : 'bg-slate-950/40 border border-white/5 text-slate-400 hover:border-white/5'
+                        : ""
                     }`}
                   >

[NoCoverage] StringLiteral
components/ECGView.tsx:227:34
                     }`}
                   >
                     <div
-                      className={`w-10 h-10 rounded-xl flex items-center justify-center ${
-                        activePattern === pattern.id
-                          ? 'bg-slate-950/40/20'
-                          : 'bg-rose-950/20 text-rose-600'
-                      }`}
+                      className={``}
                     >
                       <Activity className="w-5 h-5" />

[NoCoverage] EqualityOperator
components/ECGView.tsx:228:25
                   >
                     <div
                       className={`w-10 h-10 rounded-xl flex items-center justify-center ${
-                        activePattern === pattern.id
+                        activePattern !== pattern.id
                           ? 'bg-slate-950/40/20'
                           : 'bg-rose-950/20 text-rose-600'

[NoCoverage] ConditionalExpression
components/ECGView.tsx:228:25
                   >
                     <div
                       className={`w-10 h-10 rounded-xl flex items-center justify-center ${
-                        activePattern === pattern.id
+                        true
                           ? 'bg-slate-950/40/20'
                           : 'bg-rose-950/20 text-rose-600'

[NoCoverage] StringLiteral
components/ECGView.tsx:239:39
                       <div className="text-sm font-black uppercase tracking-tight">
                         {pattern.name}
                       </div>
-                      <div className={`text-[10px] font-bold uppercase tracking-widest opacity-60`}>
+                      <div className={``}>
                         {pattern.category}
                       </div>

[NoCoverage] ConditionalExpression
components/ECGView.tsx:244:66
                       </div>
                     </div>
                     <ChevronRight
-                      className={`w-4 h-4 transition-transform ${activePattern === pattern.id ? 'rotate-90' : ''}`}
+                      className={`w-4 h-4 transition-transform ${true ? 'rotate-90' : ''}`}
                     />
                   </button>

[NoCoverage] EqualityOperator
components/ECGView.tsx:244:66
                       </div>
                     </div>
                     <ChevronRight
-                      className={`w-4 h-4 transition-transform ${activePattern === pattern.id ? 'rotate-90' : ''}`}
+                      className={`w-4 h-4 transition-transform ${activePattern !== pattern.id ? 'rotate-90' : ''}`}
                     />
                   </button>

[NoCoverage] MethodExpression
components/ECGView.tsx:248:17
                     />
                   </button>
                 ))
-              : searchQuery.trim() && (
+              : searchQuery && (
                   <div className="p-8 bg-slate-950/20 rounded-[32px] border-2 border-dashed border-white/5 text-center animate-in fade-in zoom-in-95 duration-500">
                     <div className="w-12 h-12 bg-slate-950/40 rounded-2xl flex items-center justify-center shadow-sm mx-auto mb-4 text-slate-300">

[NoCoverage] ConditionalExpression
components/ECGView.tsx:280:14
                   </div>
                 )}
 
-            {fetchError && (
-              <div className="p-4 bg-red-50 text-red-600 rounded-2xl text-[10px] font-black uppercase tracking-widest border border-red-100 flex items-start gap-3">
-                <AlertTriangle className="w-4 h-4 shrink-0" />
-                {fetchError}
-              </div>
-            )}
+            {false}
 
             {/* AI Download Option if query is present but results found (for updating/downloading variants) */}

[NoCoverage] ConditionalExpression
components/ECGView.tsx:280:14
                   </div>
                 )}
 
-            {fetchError && (
-              <div className="p-4 bg-red-50 text-red-600 rounded-2xl text-[10px] font-black uppercase tracking-widest border border-red-100 flex items-start gap-3">
-                <AlertTriangle className="w-4 h-4 shrink-0" />
-                {fetchError}
-              </div>
-            )}
+            {true}
 
             {/* AI Download Option if query is present but results found (for updating/downloading variants) */}

[NoCoverage] BooleanLiteral
components/ECGView.tsx:288:67
             )}
 
             {/* AI Download Option if query is present but results found (for updating/downloading variants) */}
-            {searchQuery.trim() && filteredPatterns.length > 0 && !isFetchingAI && (
+            {searchQuery.trim() && filteredPatterns.length > 0 && isFetchingAI && (
               <button
                 onClick={handleAIFetch}

[NoCoverage] EqualityOperator
components/ECGView.tsx:288:36
             )}
 
             {/* AI Download Option if query is present but results found (for updating/downloading variants) */}
-            {searchQuery.trim() && filteredPatterns.length > 0 && !isFetchingAI && (
+            {searchQuery.trim() && filteredPatterns.length >= 0 && !isFetchingAI && (
               <button
                 onClick={handleAIFetch}

[NoCoverage] ConditionalExpression
components/ECGView.tsx:332:22
                   </div>
 
                   <div className="space-y-6 relative z-10">
-                    {selectedPattern.imageUrl && (
-                      <div className="mb-8 rounded-2xl overflow-hidden border border-white/5 bg-slate-950/20">
-                        <MedImage
-                          src={selectedPattern.imageUrl}
-                          alt={selectedPattern.name}
-                          label="ECG Trace"
-                          className="w-full h-auto"
-                          onEnlarge={() =>
-                            setEnlargedImage({
-                              src: selectedPattern.imageUrl!,
-                              alt: selectedPattern.name
-                            })
-                          }
-                        />
-                        <div className="p-3 bg-slate-900 text-[10px] font-bold text-slate-400 text-center uppercase tracking-widest">
-                          Clinical Reference Trace
-                        </div>
-                      </div>
-                    )}
+                    {false}
                     <h3 className="text-xs font-black uppercase tracking-widest text-slate-400 flex items-center gap-2">
                       <Zap className="w-4 h-4 text-amber-500" /> Diagnostic Criteria

[NoCoverage] ConditionalExpression
components/ECGView.tsx:332:22
                   </div>
 
                   <div className="space-y-6 relative z-10">
-                    {selectedPattern.imageUrl && (
-                      <div className="mb-8 rounded-2xl overflow-hidden border border-white/5 bg-slate-950/20">
-                        <MedImage
-                          src={selectedPattern.imageUrl}
-                          alt={selectedPattern.name}
-                          label="ECG Trace"
-                          className="w-full h-auto"
-                          onEnlarge={() =>
-                            setEnlargedImage({
-                              src: selectedPattern.imageUrl!,
-                              alt: selectedPattern.name
-                            })
-                          }
-                        />
-                        <div className="p-3 bg-slate-900 text-[10px] font-bold text-slate-400 text-center uppercase tracking-widest">
-                          Clinical Reference Trace
-                        </div>
-                      </div>
-                    )}
+                    {true}
                     <h3 className="text-xs font-black uppercase tracking-widest text-slate-400 flex items-center gap-2">
                       <Zap className="w-4 h-4 text-amber-500" /> Diagnostic Criteria

[NoCoverage] ArrowFunction
components/ECGView.tsx:339:38
                           alt={selectedPattern.name}
                           label="ECG Trace"
                           className="w-full h-auto"
-                          onEnlarge={() =>
-                            setEnlargedImage({
-                              src: selectedPattern.imageUrl!,
-                              alt: selectedPattern.name
-                            })
+                          onEnlarge={() => undefined
                           }
                         />

[NoCoverage] ArrowFunction
components/ECGView.tsx:355:53
                       <Zap className="w-4 h-4 text-amber-500" /> Diagnostic Criteria
                     </h3>
                     <div className="grid grid-cols-1 gap-3">
-                      {selectedPattern.criteria.map((item, i) => (
-                        <div
-                          key={i}
-                          className="p-4 bg-slate-950/20 rounded-2xl border border-white/5 text-sm font-bold text-slate-350 flex items-start gap-3"
-                        >
-                          <div className="w-6 h-6 rounded-lg bg-slate-950/40 flex items-center justify-center text-xs font-black text-slate-400 shrink-0 shadow-sm">
-                            {i + 1}
-                          </div>
-                          {item}
-                        </div>
-                      ))}
+                      {selectedPattern.criteria.map(() => undefined)}
                     </div>
                   </div>

[NoCoverage] ArithmeticOperator
components/ECGView.tsx:361:30
                           className="p-4 bg-slate-950/20 rounded-2xl border border-white/5 text-sm font-bold text-slate-350 flex items-start gap-3"
                         >
                           <div className="w-6 h-6 rounded-lg bg-slate-950/40 flex items-center justify-center text-xs font-black text-slate-400 shrink-0 shadow-sm">
-                            {i + 1}
+                            {i - 1}
                           </div>
                           {item}

[NoCoverage] ArrowFunction
components/ECGView.tsx:385:55
                       <ShieldAlert className="w-4 h-4 text-white" /> Acute Management
                     </h3>
                     <ul className="space-y-3">
-                      {selectedPattern.management.map((item, i) => (
-                        <li key={i} className="flex items-center gap-3 text-sm font-bold">
-                          <CheckCircle2 className="w-4 h-4 text-rose-300 shrink-0" />
-                          {item}
-                        </li>
-                      ))}
+                      {selectedPattern.management.map(() => undefined)}
                     </ul>
                   </div>

[NoCoverage] ConditionalExpression
components/ECGView.tsx:421:8
           </AnimatePresence>
         </div>
       </div>
-      {enlargedImage && (
-        <ImageModal
-          src={enlargedImage.src}
-          alt={enlargedImage.alt}
-          onClose={() => setEnlargedImage(null)}
-        />
-      )}
+      {true}
     </div>
   );

[NoCoverage] LogicalOperator
components/ECGView.tsx:421:8
           </AnimatePresence>
         </div>
       </div>
-      {enlargedImage && (
-        <ImageModal
-          src={enlargedImage.src}
-          alt={enlargedImage.alt}
-          onClose={() => setEnlargedImage(null)}
-        />
-      )}
+      {enlargedImage || <ImageModal src={enlargedImage.src} alt={enlargedImage.alt} onClose={() => setEnlargedImage(null)} />}
     </div>
   );
