[NoCoverage] LogicalOperator
components/ExaminationCard.tsx:25:19
 
 const ExaminationCard: React.FC<ExaminationCardProps> = memo(
   ({ exam, onSelect, onSync, isDownloaded, isSyncing }) => {
-    const style = SYSTEM_THEMES[exam.system] || DEFAULT_STYLE;
+    const style = SYSTEM_THEMES[exam.system] && DEFAULT_STYLE;
 
     return (

[NoCoverage] ConditionalExpression
components/ExaminationCard.tsx:25:19
 
 const ExaminationCard: React.FC<ExaminationCardProps> = memo(
   ({ exam, onSelect, onSync, isDownloaded, isSyncing }) => {
-    const style = SYSTEM_THEMES[exam.system] || DEFAULT_STYLE;
+    const style = false;
 
     return (

[NoCoverage] ArrowFunction
components/ExaminationCard.tsx:29:18
 
     return (
       <div
-        onClick={() => onSelect(exam)}
+        onClick={() => undefined}
         className={`group/card p-6 rounded-[32px] border-2 transition-all duration-500 flex flex-col relative overflow-hidden cursor-pointer ${
           isDownloaded

[NoCoverage] StringLiteral
components/ExaminationCard.tsx:33:15
         className={`group/card p-6 rounded-[32px] border-2 transition-all duration-500 flex flex-col relative overflow-hidden cursor-pointer ${
           isDownloaded
             ? `bg-slate-900/50 border-emerald-500/20 shadow-xl shadow-emerald-500/5 hover:border-emerald-500 hover:shadow-emerald-500/10 hover:scale-[1.02]`
-            : `bg-slate-900/50 border-white/5 hover:border-blue-500/50 hover:shadow-2xl hover:shadow-blue-500/10 hover:scale-[1.02]`
+            : ``
         }`}
       >

[NoCoverage] StringLiteral
components/ExaminationCard.tsx:43:24
 
         <div className="flex items-start justify-between mb-6 relative z-10">
           <div
-            className={`w-12 h-12 rounded-2xl flex items-center justify-center transition-all duration-700 shadow-sm ${
-              isDownloaded
-                ? 'bg-emerald-950/40 text-emerald-400 border border-emerald-500/20'
-                : 'bg-slate-950 border border-white/5 text-slate-400 group-hover/card:bg-blue-950/40 group-hover/card:text-blue-400 group-hover/card:border-blue-500/20'
-            }`}
+            className={``}
           >
             {SYSTEM_THEMES[exam.system]?.icon || <FolderOpen className="w-6 h-6" />}

[NoCoverage] ConditionalExpression
components/ExaminationCard.tsx:49:14
                 : 'bg-slate-950 border border-white/5 text-slate-400 group-hover/card:bg-blue-950/40 group-hover/card:text-blue-400 group-hover/card:border-blue-500/20'
             }`}
           >
-            {SYSTEM_THEMES[exam.system]?.icon || <FolderOpen className="w-6 h-6" />}
+            {true}
           </div>
           <div className="flex items-center gap-2">

[NoCoverage] LogicalOperator
components/ExaminationCard.tsx:49:14
                 : 'bg-slate-950 border border-white/5 text-slate-400 group-hover/card:bg-blue-950/40 group-hover/card:text-blue-400 group-hover/card:border-blue-500/20'
             }`}
           >
-            {SYSTEM_THEMES[exam.system]?.icon || <FolderOpen className="w-6 h-6" />}
+            {SYSTEM_THEMES[exam.system]?.icon && <FolderOpen className="w-6 h-6" />}
           </div>
           <div className="flex items-center gap-2">

[NoCoverage] ConditionalExpression
components/ExaminationCard.tsx:62:15
                 <span className="text-[7px] font-black uppercase tracking-widest">Syncing</span>
               </div>
             ) : (
-              exam.isDraft && (
-                <div className="flex items-center gap-2 px-3 py-1 bg-indigo-950/40 text-indigo-400 rounded-full border border-indigo-500/20">
-                  <Sparkles className="w-2.5 h-2.5" />
-                  <span className="text-[7px] font-black uppercase tracking-widest">Draft</span>
-                </div>
-              )
+              true
             )}
           </div>

[NoCoverage] ConditionalExpression
components/ExaminationCard.tsx:62:15
                 <span className="text-[7px] font-black uppercase tracking-widest">Syncing</span>
               </div>
             ) : (
-              exam.isDraft && (
-                <div className="flex items-center gap-2 px-3 py-1 bg-indigo-950/40 text-indigo-400 rounded-full border border-indigo-500/20">
-                  <Sparkles className="w-2.5 h-2.5" />
-                  <span className="text-[7px] font-black uppercase tracking-widest">Draft</span>
-                </div>
-              )
+              false
             )}
           </div>

[NoCoverage] StringLiteral
components/ExaminationCard.tsx:78:54
           </h4>
           <div className="flex items-center gap-4">
             <span className="text-[9px] font-black uppercase tracking-widest text-slate-400 flex items-center gap-1.5">
-              <ListChecks className="w-3.5 h-3.5" />{' '}
+              <ListChecks className="w-3.5 h-3.5" />{""}
               {(exam.steps || []).length > 0 ? `${(exam.steps || []).length} Steps` : 'Auto-Gen'}
             </span>

[NoCoverage] ConditionalExpression
components/ExaminationCard.tsx:79:52
           <div className="flex items-center gap-4">
             <span className="text-[9px] font-black uppercase tracking-widest text-slate-400 flex items-center gap-1.5">
               <ListChecks className="w-3.5 h-3.5" />{' '}
-              {(exam.steps || []).length > 0 ? `${(exam.steps || []).length} Steps` : 'Auto-Gen'}
+              {(exam.steps || []).length > 0 ? `${(false).length} Steps` : 'Auto-Gen'}
             </span>
             <div className="w-1 h-1 rounded-full bg-slate-800" />

[NoCoverage] LogicalOperator
components/ExaminationCard.tsx:79:17
           <div className="flex items-center gap-4">
             <span className="text-[9px] font-black uppercase tracking-widest text-slate-400 flex items-center gap-1.5">
               <ListChecks className="w-3.5 h-3.5" />{' '}
-              {(exam.steps || []).length > 0 ? `${(exam.steps || []).length} Steps` : 'Auto-Gen'}
+              {(exam.steps && []).length > 0 ? `${(exam.steps || []).length} Steps` : 'Auto-Gen'}
             </span>
             <div className="w-1 h-1 rounded-full bg-slate-800" />

[NoCoverage] MethodExpression
components/ExaminationCard.tsx:84:16
             <div className="w-1 h-1 rounded-full bg-slate-800" />
             <span className="text-[9px] font-black uppercase tracking-widest text-slate-400 flex items-center gap-1.5">
               <Clock className="w-3.5 h-3.5" />{' '}
-              {Math.max(5, Math.floor((exam.steps || []).length * 0.5))} Min
+              {Math.min(5, Math.floor((exam.steps || []).length * 0.5))} Min
             </span>
           </div>

[NoCoverage] ArithmeticOperator
components/ExaminationCard.tsx:84:39
             <div className="w-1 h-1 rounded-full bg-slate-800" />
             <span className="text-[9px] font-black uppercase tracking-widest text-slate-400 flex items-center gap-1.5">
               <Clock className="w-3.5 h-3.5" />{' '}
-              {Math.max(5, Math.floor((exam.steps || []).length * 0.5))} Min
+              {Math.max(5, Math.floor((exam.steps || []).length / 0.5))} Min
             </span>
           </div>

[NoCoverage] BooleanLiteral
components/ExaminationCard.tsx:99:29
           >
             Open Dossier <ArrowRight className="w-4 h-4" />
           </span>
-          {!isDownloaded && !isSyncing && (
+          {!isDownloaded && isSyncing && (
             <Tooltip content="Cache Protocol">
               <button

[NoCoverage] LogicalOperator
components/ExaminationCard.tsx:99:12
           >
             Open Dossier <ArrowRight className="w-4 h-4" />
           </span>
-          {!isDownloaded && !isSyncing && (
+          {!isDownloaded || !isSyncing && (
             <Tooltip content="Cache Protocol">
               <button

[NoCoverage] BlockStatement
components/ExaminationCard.tsx:102:33
           {!isDownloaded && !isSyncing && (
             <Tooltip content="Cache Protocol">
               <button
-                onClick={(e) => {
-                  e.stopPropagation();
-                  onSync(exam.id);
-                }}
+                onClick={(e) => {}}
               >
