[NoCoverage] BooleanLiteral
components/ExamView.tsx:77:54
   const [activeTab, setActiveTab] = useState<
     'steps' | 'physiology' | 'clinical' | 'onepager' | 'visuals'
   >('steps');
-  const [isResearching, setIsResearching] = useState(false);
+  const [isResearching, setIsResearching] = useState(true);
   const [selectedStepId, setSelectedStepId] = useState<string | null>(null);
 

[NoCoverage] BooleanLiteral
components/ExamView.tsx:86:60
   // Dynamic detail side-panel states
   const [selectedPathoSign, setSelectedPathoSign] = useState<string | null>(null);
   const [pathoSignData, setPathoSignData] = useState<ClinicalCorrelation | null>(null);
-  const [loadingPathoData, setLoadingPathoData] = useState(false);
+  const [loadingPathoData, setLoadingPathoData] = useState(true);
 
   // Selected details for Column 3

[NoCoverage] BlockStatement
components/ExamView.tsx:93:71
   const [selectedDifferentialIndex, setSelectedDifferentialIndex] = useState<number | null>(null);
 
   const [enlargedImage, setEnlargedImage] = useState<{ src: string; alt: string } | null>(null);
-  const [checkedSteps, setCheckedSteps] = useState<Set<string>>(() => {
-    try {
-      const saved = localStorage.getItem(`checkedSteps_${exam.id}`);
-      return saved ? new Set(JSON.parse(saved)) : new Set();
-    } catch {
-      return new Set();
-    }
-  });
+  const [checkedSteps, setCheckedSteps] = useState<Set<string>>(() => {});
 
   // Persist checkedSteps when they change

[NoCoverage] BlockStatement
components/ExamView.tsx:94:9
 
   const [enlargedImage, setEnlargedImage] = useState<{ src: string; alt: string } | null>(null);
   const [checkedSteps, setCheckedSteps] = useState<Set<string>>(() => {
-    try {
-      const saved = localStorage.getItem(`checkedSteps_${exam.id}`);
-      return saved ? new Set(JSON.parse(saved)) : new Set();
-    } catch {
+    try {} catch {
       return new Set();
     }

[NoCoverage] BlockStatement
components/ExamView.tsx:97:13
     try {
       const saved = localStorage.getItem(`checkedSteps_${exam.id}`);
       return saved ? new Set(JSON.parse(saved)) : new Set();
-    } catch {
-      return new Set();
-    }
+    } catch {}
   });
 

[NoCoverage] BlockStatement
components/ExamView.tsx:103:19
   });
 
   // Persist checkedSteps when they change
-  useEffect(() => {
-    try {
-      localStorage.setItem(`checkedSteps_${exam.id}`, JSON.stringify(Array.from(checkedSteps)));
-    } catch (e) {
-      console.error('Failed to save checked steps:', e);
-    }
-  }, [checkedSteps, exam.id]);
+  useEffect(() => {}, [checkedSteps, exam.id]);
 
   const [focusMode, setFocusMode] = useState(false);

[NoCoverage] BlockStatement
components/ExamView.tsx:104:9
 
   // Persist checkedSteps when they change
   useEffect(() => {
-    try {
-      localStorage.setItem(`checkedSteps_${exam.id}`, JSON.stringify(Array.from(checkedSteps)));
-    } catch (e) {
+    try {} catch (e) {
       console.error('Failed to save checked steps:', e);
     }

[NoCoverage] BlockStatement
components/ExamView.tsx:106:17
   useEffect(() => {
     try {
       localStorage.setItem(`checkedSteps_${exam.id}`, JSON.stringify(Array.from(checkedSteps)));
-    } catch (e) {
-      console.error('Failed to save checked steps:', e);
-    }
+    } catch (e) {}
   }, [checkedSteps, exam.id]);
 

[NoCoverage] StringLiteral
components/ExamView.tsx:107:21
     try {
       localStorage.setItem(`checkedSteps_${exam.id}`, JSON.stringify(Array.from(checkedSteps)));
     } catch (e) {
-      console.error('Failed to save checked steps:', e);
+      console.error("", e);
     }
   }, [checkedSteps, exam.id]);

[NoCoverage] BooleanLiteral
components/ExamView.tsx:111:46
     }
   }, [checkedSteps, exam.id]);
 
-  const [focusMode, setFocusMode] = useState(false);
+  const [focusMode, setFocusMode] = useState(true);
 
   const [newFindingText, setNewFindingText] = useState<Record<string, string>>({});

[NoCoverage] BooleanLiteral
components/ExamView.tsx:120:48
   const [newPearlText, setNewPearlText] = useState<Record<string, string>>({});
 
   const [refinementPrompt, setRefinementPrompt] = useState('');
-  const [isRefining, setIsRefining] = useState(false);
+  const [isRefining, setIsRefining] = useState(true);
   const [lastExamState, setLastExamState] = useState<Examination | null>(null);
   const [showUndo, setShowUndo] = useState(false);

[NoCoverage] BooleanLiteral
components/ExamView.tsx:122:44
   const [refinementPrompt, setRefinementPrompt] = useState('');
   const [isRefining, setIsRefining] = useState(false);
   const [lastExamState, setLastExamState] = useState<Examination | null>(null);
-  const [showUndo, setShowUndo] = useState(false);
+  const [showUndo, setShowUndo] = useState(true);
 
   const gemini = useMemo(() => new GeminiService(), []);

[NoCoverage] ConditionalExpression
components/ExamView.tsx:125:17
   const [showUndo, setShowUndo] = useState(false);
 
   const gemini = useMemo(() => new GeminiService(), []);
-  const theme = SYSTEM_THEMES[exam.system] || DEFAULT_STYLE;
+  const theme = true;
 
   const categorizedSteps = useMemo(() => {

[NoCoverage] LogicalOperator
components/ExamView.tsx:125:17
   const [showUndo, setShowUndo] = useState(false);
 
   const gemini = useMemo(() => new GeminiService(), []);
-  const theme = SYSTEM_THEMES[exam.system] || DEFAULT_STYLE;
+  const theme = SYSTEM_THEMES[exam.system] && DEFAULT_STYLE;
 
   const categorizedSteps = useMemo(() => {

[NoCoverage] BlockStatement
components/ExamView.tsx:127:42
   const gemini = useMemo(() => new GeminiService(), []);
   const theme = SYSTEM_THEMES[exam.system] || DEFAULT_STYLE;
 
-  const categorizedSteps = useMemo(() => {
-    const groups: Record<string, { steps: ExamStep[]; indices: number[] }> = {};
-    (exam.steps || []).forEach((step, index) => {
-      const cat = step.category || 'General';
-      if (!groups[cat]) groups[cat] = { steps: [], indices: [] };
-      groups[cat].steps.push(step);
-      groups[cat].indices.push(index);
-    });
-    return groups;
-  }, [exam.steps]);
+  const categorizedSteps = useMemo(() => {}, [exam.steps]);
 
   // Set default selected step when steps load

[NoCoverage] LogicalOperator
components/ExamView.tsx:129:6
 
   const categorizedSteps = useMemo(() => {
     const groups: Record<string, { steps: ExamStep[]; indices: number[] }> = {};
-    (exam.steps || []).forEach((step, index) => {
+    (exam.steps && []).forEach((step, index) => {
       const cat = step.category || 'General';
       if (!groups[cat]) groups[cat] = { steps: [], indices: [] };

[NoCoverage] ConditionalExpression
components/ExamView.tsx:129:6
 
   const categorizedSteps = useMemo(() => {
     const groups: Record<string, { steps: ExamStep[]; indices: number[] }> = {};
-    (exam.steps || []).forEach((step, index) => {
+    (false).forEach((step, index) => {
       const cat = step.category || 'General';
       if (!groups[cat]) groups[cat] = { steps: [], indices: [] };

[NoCoverage] ConditionalExpression
components/ExamView.tsx:130:19
   const categorizedSteps = useMemo(() => {
     const groups: Record<string, { steps: ExamStep[]; indices: number[] }> = {};
     (exam.steps || []).forEach((step, index) => {
-      const cat = step.category || 'General';
+      const cat = false;
       if (!groups[cat]) groups[cat] = { steps: [], indices: [] };
       groups[cat].steps.push(step);

[NoCoverage] ConditionalExpression
components/ExamView.tsx:130:19
   const categorizedSteps = useMemo(() => {
     const groups: Record<string, { steps: ExamStep[]; indices: number[] }> = {};
     (exam.steps || []).forEach((step, index) => {
-      const cat = step.category || 'General';
+      const cat = true;
       if (!groups[cat]) groups[cat] = { steps: [], indices: [] };
       groups[cat].steps.push(step);

[NoCoverage] BooleanLiteral
components/ExamView.tsx:131:11
     const groups: Record<string, { steps: ExamStep[]; indices: number[] }> = {};
     (exam.steps || []).forEach((step, index) => {
       const cat = step.category || 'General';
-      if (!groups[cat]) groups[cat] = { steps: [], indices: [] };
+      if (groups[cat]) groups[cat] = { steps: [], indices: [] };
       groups[cat].steps.push(step);
       groups[cat].indices.push(index);

[NoCoverage] ConditionalExpression
components/ExamView.tsx:131:11
     const groups: Record<string, { steps: ExamStep[]; indices: number[] }> = {};
     (exam.steps || []).forEach((step, index) => {
       const cat = step.category || 'General';
-      if (!groups[cat]) groups[cat] = { steps: [], indices: [] };
+      if (true) groups[cat] = { steps: [], indices: [] };
       groups[cat].steps.push(step);
       groups[cat].indices.push(index);

[NoCoverage] BlockStatement
components/ExamView.tsx:139:19
   }, [exam.steps]);
 
   // Set default selected step when steps load
-  useEffect(() => {
-    if (exam.steps && exam.steps.length > 0 && !selectedStepId) {
-      setSelectedStepId(exam.steps[0].id);
-    }
-  }, [exam.steps, selectedStepId]);
+  useEffect(() => {}, [exam.steps, selectedStepId]);
 
   // Escape key navigation handler

[NoCoverage] LogicalOperator
components/ExamView.tsx:140:9
 
   // Set default selected step when steps load
   useEffect(() => {
-    if (exam.steps && exam.steps.length > 0 && !selectedStepId) {
+    if (exam.steps || exam.steps.length > 0 && !selectedStepId) {
       setSelectedStepId(exam.steps[0].id);
     }

[NoCoverage] ConditionalExpression
components/ExamView.tsx:140:9
 
   // Set default selected step when steps load
   useEffect(() => {
-    if (exam.steps && exam.steps.length > 0 && !selectedStepId) {
+    if (true) {
       setSelectedStepId(exam.steps[0].id);
     }

[NoCoverage] BlockStatement
components/ExamView.tsx:146:19
   }, [exam.steps, selectedStepId]);
 
   // Escape key navigation handler
-  useEffect(() => {
-    const handleKeyDown = (e: KeyboardEvent) => {
-      if (e.key === 'Escape') {
-        if (enlargedImage) {
-          setEnlargedImage(null);
-        } else if (selectedPathoSign) {
-          setSelectedPathoSign(null);
-        } else {
-          onBack();
-        }
-      }
-    };
-    window.addEventListener('keydown', handleKeyDown);
-    return () => window.removeEventListener('keydown', handleKeyDown);
-  }, [onBack, enlargedImage, selectedPathoSign]);
+  useEffect(() => {}, [onBack, enlargedImage, selectedPathoSign]);
 
   useEffect(() => {

[NoCoverage] BlockStatement
components/ExamView.tsx:147:49
 
   // Escape key navigation handler
   useEffect(() => {
-    const handleKeyDown = (e: KeyboardEvent) => {
-      if (e.key === 'Escape') {
-        if (enlargedImage) {
-          setEnlargedImage(null);
-        } else if (selectedPathoSign) {
-          setSelectedPathoSign(null);
-        } else {
-          onBack();
-        }
-      }
-    };
+    const handleKeyDown = (e: KeyboardEvent) => {};
     window.addEventListener('keydown', handleKeyDown);
     return () => window.removeEventListener('keydown', handleKeyDown);

[NoCoverage] BlockStatement
components/ExamView.tsx:148:31
   // Escape key navigation handler
   useEffect(() => {
     const handleKeyDown = (e: KeyboardEvent) => {
-      if (e.key === 'Escape') {
-        if (enlargedImage) {
-          setEnlargedImage(null);
-        } else if (selectedPathoSign) {
-          setSelectedPathoSign(null);
-        } else {
-          onBack();
-        }
-      }
+      if (e.key === 'Escape') {}
     };
     window.addEventListener('keydown', handleKeyDown);

[NoCoverage] ConditionalExpression
components/ExamView.tsx:148:11
   // Escape key navigation handler
   useEffect(() => {
     const handleKeyDown = (e: KeyboardEvent) => {
-      if (e.key === 'Escape') {
+      if (false) {
         if (enlargedImage) {
           setEnlargedImage(null);

[NoCoverage] ConditionalExpression
components/ExamView.tsx:149:13
   useEffect(() => {
     const handleKeyDown = (e: KeyboardEvent) => {
       if (e.key === 'Escape') {
-        if (enlargedImage) {
+        if (false) {
           setEnlargedImage(null);
         } else if (selectedPathoSign) {

[NoCoverage] BlockStatement
components/ExamView.tsx:149:28
   useEffect(() => {
     const handleKeyDown = (e: KeyboardEvent) => {
       if (e.key === 'Escape') {
-        if (enlargedImage) {
-          setEnlargedImage(null);
-        } else if (selectedPathoSign) {
+        if (enlargedImage) {} else if (selectedPathoSign) {
           setSelectedPathoSign(null);
         } else {

[NoCoverage] BlockStatement
components/ExamView.tsx:151:39
       if (e.key === 'Escape') {
         if (enlargedImage) {
           setEnlargedImage(null);
-        } else if (selectedPathoSign) {
-          setSelectedPathoSign(null);
-        } else {
+        } else if (selectedPathoSign) {} else {
           onBack();
         }

[NoCoverage] ConditionalExpression
components/ExamView.tsx:151:20
       if (e.key === 'Escape') {
         if (enlargedImage) {
           setEnlargedImage(null);
-        } else if (selectedPathoSign) {
+        } else if (true) {
           setSelectedPathoSign(null);
         } else {

[NoCoverage] BlockStatement
components/ExamView.tsx:153:16
           setEnlargedImage(null);
         } else if (selectedPathoSign) {
           setSelectedPathoSign(null);
-        } else {
-          onBack();
-        }
+        } else {}
       }
     };

[NoCoverage] ArrayDeclaration
components/ExamView.tsx:160:6
     };
     window.addEventListener('keydown', handleKeyDown);
     return () => window.removeEventListener('keydown', handleKeyDown);
-  }, [onBack, enlargedImage, selectedPathoSign]);
+  }, []);
 
   useEffect(() => {

[NoCoverage] BlockStatement
components/ExamView.tsx:162:19
     return () => window.removeEventListener('keydown', handleKeyDown);
   }, [onBack, enlargedImage, selectedPathoSign]);
 
-  useEffect(() => {
-    const research = async () => {
-      if ((exam.steps || []).length === 0 && navigator.onLine && !exam.isDownloaded) {
-        setIsResearching(true);
-        try {
-          const res = await gemini.populateExamination(exam);
-          setExam((prev) => ({ ...prev, ...res, isDraft: false }));
-        } catch (e) {
-          console.error(e);
-        } finally {
-          setIsResearching(false);
-        }
-      }
-    };
-    research();
-  }, [exam.id, exam.isDownloaded, gemini, setExam]);
+  useEffect(() => {}, [exam.id, exam.isDownloaded, gemini, setExam]);
 
   const fetchClinicalCorrelation = async (sign: string) => {

[NoCoverage] BlockStatement
components/ExamView.tsx:163:34
   }, [onBack, enlargedImage, selectedPathoSign]);
 
   useEffect(() => {
-    const research = async () => {
-      if ((exam.steps || []).length === 0 && navigator.onLine && !exam.isDownloaded) {
-        setIsResearching(true);
-        try {
-          const res = await gemini.populateExamination(exam);
-          setExam((prev) => ({ ...prev, ...res, isDraft: false }));
-        } catch (e) {
-          console.error(e);
-        } finally {
-          setIsResearching(false);
-        }
-      }
-    };
+    const research = async () => {};
     research();
   }, [exam.id, exam.isDownloaded, gemini, setExam]);

[NoCoverage] ConditionalExpression
components/ExamView.tsx:164:11
 
   useEffect(() => {
     const research = async () => {
-      if ((exam.steps || []).length === 0 && navigator.onLine && !exam.isDownloaded) {
+      if (true) {
         setIsResearching(true);
         try {

[NoCoverage] ConditionalExpression
components/ExamView.tsx:164:11
 
   useEffect(() => {
     const research = async () => {
-      if ((exam.steps || []).length === 0 && navigator.onLine && !exam.isDownloaded) {
+      if (true && !exam.isDownloaded) {
         setIsResearching(true);
         try {

[NoCoverage] BooleanLiteral
components/ExamView.tsx:165:26
   useEffect(() => {
     const research = async () => {
       if ((exam.steps || []).length === 0 && navigator.onLine && !exam.isDownloaded) {
-        setIsResearching(true);
+        setIsResearching(false);
         try {
           const res = await gemini.populateExamination(exam);

[NoCoverage] BlockStatement
components/ExamView.tsx:166:13
     const research = async () => {
       if ((exam.steps || []).length === 0 && navigator.onLine && !exam.isDownloaded) {
         setIsResearching(true);
-        try {
-          const res = await gemini.populateExamination(exam);
-          setExam((prev) => ({ ...prev, ...res, isDraft: false }));
-        } catch (e) {
+        try {} catch (e) {
           console.error(e);
         } finally {

[NoCoverage] ArrowFunction
components/ExamView.tsx:168:19
         setIsResearching(true);
         try {
           const res = await gemini.populateExamination(exam);
-          setExam((prev) => ({ ...prev, ...res, isDraft: false }));
+          setExam(() => undefined);
         } catch (e) {
           console.error(e);

[NoCoverage] BooleanLiteral
components/ExamView.tsx:168:58
         setIsResearching(true);
         try {
           const res = await gemini.populateExamination(exam);
-          setExam((prev) => ({ ...prev, ...res, isDraft: false }));
+          setExam((prev) => ({ ...prev, ...res, isDraft: true }));
         } catch (e) {
           console.error(e);

[NoCoverage] BlockStatement
components/ExamView.tsx:169:21
         try {
           const res = await gemini.populateExamination(exam);
           setExam((prev) => ({ ...prev, ...res, isDraft: false }));
-        } catch (e) {
-          console.error(e);
-        } finally {
+        } catch (e) {} finally {
           setIsResearching(false);
         }

[NoCoverage] BlockStatement
components/ExamView.tsx:171:19
           setExam((prev) => ({ ...prev, ...res, isDraft: false }));
         } catch (e) {
           console.error(e);
-        } finally {
-          setIsResearching(false);
-        }
+        } finally {}
       }
     };

[NoCoverage] BooleanLiteral
components/ExamView.tsx:172:28
         } catch (e) {
           console.error(e);
         } finally {
-          setIsResearching(false);
+          setIsResearching(true);
         }
       }

[NoCoverage] BlockStatement
components/ExamView.tsx:179:60
     research();
   }, [exam.id, exam.isDownloaded, gemini, setExam]);
 
-  const fetchClinicalCorrelation = async (sign: string) => {
-    addToHistory('finding', sign);
-    setSelectedPathoSign(sign);
-    setLoadingPathoData(true);
-    setPathoSignData(null);
-    try {
-      const data = await gemini.getClinicalCorrelation(sign, exam.system, false);
-      setPathoSignData(data);
-    } catch (e) {
-      console.error(e);
-    } finally {
-      setLoadingPathoData(false);
-    }
-  };
+  const fetchClinicalCorrelation = async (sign: string) => {};
 
   const handleSelectHistoryItem = (item: HistoryItem) => {

[NoCoverage] StringLiteral
components/ExamView.tsx:180:18
   }, [exam.id, exam.isDownloaded, gemini, setExam]);
 
   const fetchClinicalCorrelation = async (sign: string) => {
-    addToHistory('finding', sign);
+    addToHistory("", sign);
     setSelectedPathoSign(sign);
     setLoadingPathoData(true);

[NoCoverage] BooleanLiteral
components/ExamView.tsx:182:25
   const fetchClinicalCorrelation = async (sign: string) => {
     addToHistory('finding', sign);
     setSelectedPathoSign(sign);
-    setLoadingPathoData(true);
+    setLoadingPathoData(false);
     setPathoSignData(null);
     try {

[NoCoverage] BlockStatement
components/ExamView.tsx:184:9
     setSelectedPathoSign(sign);
     setLoadingPathoData(true);
     setPathoSignData(null);
-    try {
-      const data = await gemini.getClinicalCorrelation(sign, exam.system, false);
-      setPathoSignData(data);
-    } catch (e) {
+    try {} catch (e) {
       console.error(e);
     } finally {

[NoCoverage] BooleanLiteral
components/ExamView.tsx:185:75
     setLoadingPathoData(true);
     setPathoSignData(null);
     try {
-      const data = await gemini.getClinicalCorrelation(sign, exam.system, false);
+      const data = await gemini.getClinicalCorrelation(sign, exam.system, true);
       setPathoSignData(data);
     } catch (e) {

[NoCoverage] BlockStatement
components/ExamView.tsx:187:17
     try {
       const data = await gemini.getClinicalCorrelation(sign, exam.system, false);
       setPathoSignData(data);
-    } catch (e) {
-      console.error(e);
-    } finally {
+    } catch (e) {} finally {
       setLoadingPathoData(false);
     }

[NoCoverage] BlockStatement
components/ExamView.tsx:189:15
       setPathoSignData(data);
     } catch (e) {
       console.error(e);
-    } finally {
-      setLoadingPathoData(false);
-    }
+    } finally {}
   };
 

[NoCoverage] BooleanLiteral
components/ExamView.tsx:190:27
     } catch (e) {
       console.error(e);
     } finally {
-      setLoadingPathoData(false);
+      setLoadingPathoData(true);
     }
   };

[NoCoverage] BlockStatement
components/ExamView.tsx:194:58
     }
   };
 
-  const handleSelectHistoryItem = (item: HistoryItem) => {
-    if (item.type === 'finding') {
-      fetchClinicalCorrelation(item.label);
-    } else if (item.type === 'exam') {
-      // Navigate to exam
-    }
-  };
+  const handleSelectHistoryItem = (item: HistoryItem) => {};
 
   const handleImageUpload = async (stepId: string | 'header') => {

[NoCoverage] EqualityOperator
components/ExamView.tsx:195:9
   };
 
   const handleSelectHistoryItem = (item: HistoryItem) => {
-    if (item.type === 'finding') {
+    if (item.type !== 'finding') {
       fetchClinicalCorrelation(item.label);
     } else if (item.type === 'exam') {

[NoCoverage] BlockStatement
components/ExamView.tsx:195:34
   };
 
   const handleSelectHistoryItem = (item: HistoryItem) => {
-    if (item.type === 'finding') {
-      fetchClinicalCorrelation(item.label);
-    } else if (item.type === 'exam') {
+    if (item.type === 'finding') {} else if (item.type === 'exam') {
       // Navigate to exam
     }

[NoCoverage] EqualityOperator
components/ExamView.tsx:197:16
   const handleSelectHistoryItem = (item: HistoryItem) => {
     if (item.type === 'finding') {
       fetchClinicalCorrelation(item.label);
-    } else if (item.type === 'exam') {
+    } else if (item.type !== 'exam') {
       // Navigate to exam
     }

[NoCoverage] ConditionalExpression
components/ExamView.tsx:197:16
   const handleSelectHistoryItem = (item: HistoryItem) => {
     if (item.type === 'finding') {
       fetchClinicalCorrelation(item.label);
-    } else if (item.type === 'exam') {
+    } else if (true) {
       // Navigate to exam
     }

[NoCoverage] BlockStatement
components/ExamView.tsx:202:66
     }
   };
 
-  const handleImageUpload = async (stepId: string | 'header') => {
-    const input = document.createElement('input');
-    input.type = 'file';
-    input.accept = 'image/*';
-    input.onchange = async (e: any) => {
-      const file = e.target.files?.[0];
-      if (!file) return;
-
-      const assetId = `custom_${Math.random().toString(36).substr(2, 9)}`;
-      await storage.saveAsset(assetId, file);
-
-      if (stepId === 'header') {
-        updateGeneralField('localHeaderImageUrl', assetId);
-      } else {
-        updateStepField(stepId, 'localImageUrl', assetId);
-      }
-    };
-    input.click();
-  };
+  const handleImageUpload = async (stepId: string | 'header') => {};
 
   const handleImageGenerate = async (stepId: string | 'header') => {

[NoCoverage] BlockStatement
components/ExamView.tsx:206:40
     const input = document.createElement('input');
     input.type = 'file';
     input.accept = 'image/*';
-    input.onchange = async (e: any) => {
-      const file = e.target.files?.[0];
-      if (!file) return;
-
-      const assetId = `custom_${Math.random().toString(36).substr(2, 9)}`;
-      await storage.saveAsset(assetId, file);
-
-      if (stepId === 'header') {
-        updateGeneralField('localHeaderImageUrl', assetId);
-      } else {
-        updateStepField(stepId, 'localImageUrl', assetId);
-      }
-    };
+    input.onchange = async (e: any) => {};
     input.click();
   };

[NoCoverage] MethodExpression
components/ExamView.tsx:210:33
       const file = e.target.files?.[0];
       if (!file) return;
 
-      const assetId = `custom_${Math.random().toString(36).substr(2, 9)}`;
+      const assetId = `custom_${Math.random().toString(36)}`;
       await storage.saveAsset(assetId, file);
 

[NoCoverage] StringLiteral
components/ExamView.tsx:210:23
       const file = e.target.files?.[0];
       if (!file) return;
 
-      const assetId = `custom_${Math.random().toString(36).substr(2, 9)}`;
+      const assetId = ``;
       await storage.saveAsset(assetId, file);
 

[NoCoverage] EqualityOperator
components/ExamView.tsx:213:11
       const assetId = `custom_${Math.random().toString(36).substr(2, 9)}`;
       await storage.saveAsset(assetId, file);
 
-      if (stepId === 'header') {
+      if (stepId !== 'header') {
         updateGeneralField('localHeaderImageUrl', assetId);
       } else {

[NoCoverage] BlockStatement
components/ExamView.tsx:213:32
       const assetId = `custom_${Math.random().toString(36).substr(2, 9)}`;
       await storage.saveAsset(assetId, file);
 
-      if (stepId === 'header') {
-        updateGeneralField('localHeaderImageUrl', assetId);
-      } else {
+      if (stepId === 'header') {} else {
         updateStepField(stepId, 'localImageUrl', assetId);
       }

[NoCoverage] BlockStatement
components/ExamView.tsx:215:14
 
       if (stepId === 'header') {
         updateGeneralField('localHeaderImageUrl', assetId);
-      } else {
-        updateStepField(stepId, 'localImageUrl', assetId);
-      }
+      } else {}
     };
     input.click();

[NoCoverage] StringLiteral
components/ExamView.tsx:216:33
       if (stepId === 'header') {
         updateGeneralField('localHeaderImageUrl', assetId);
       } else {
-        updateStepField(stepId, 'localImageUrl', assetId);
+        updateStepField(stepId, "", assetId);
       }
     };

[NoCoverage] EqualityOperator
components/ExamView.tsx:224:7
 
   const handleImageGenerate = async (stepId: string | 'header') => {
     const prompt =
-      stepId === 'header'
+      stepId !== 'header'
         ? exam.headerImagePrompt
         : (exam.steps || []).find((s) => s.id === stepId)?.imagePrompt;

[NoCoverage] ConditionalExpression
components/ExamView.tsx:224:7
 
   const handleImageGenerate = async (stepId: string | 'header') => {
     const prompt =
-      stepId === 'header'
+      true
         ? exam.headerImagePrompt
         : (exam.steps || []).find((s) => s.id === stepId)?.imagePrompt;

[NoCoverage] OptionalChaining
components/ExamView.tsx:226:11
     const prompt =
       stepId === 'header'
         ? exam.headerImagePrompt
-        : (exam.steps || []).find((s) => s.id === stepId)?.imagePrompt;
+        : (exam.steps || []).find(s => s.id === stepId).imagePrompt;
     if (!prompt) {
       alert('Please provide an image prompt first.');

[NoCoverage] ArrowFunction
components/ExamView.tsx:226:35
     const prompt =
       stepId === 'header'
         ? exam.headerImagePrompt
-        : (exam.steps || []).find((s) => s.id === stepId)?.imagePrompt;
+        : (exam.steps || []).find(() => undefined)?.imagePrompt;
     if (!prompt) {
       alert('Please provide an image prompt first.');

[NoCoverage] ConditionalExpression
components/ExamView.tsx:227:9
       stepId === 'header'
         ? exam.headerImagePrompt
         : (exam.steps || []).find((s) => s.id === stepId)?.imagePrompt;
-    if (!prompt) {
+    if (false) {
       alert('Please provide an image prompt first.');
       return;

[NoCoverage] ConditionalExpression
components/ExamView.tsx:227:9
       stepId === 'header'
         ? exam.headerImagePrompt
         : (exam.steps || []).find((s) => s.id === stepId)?.imagePrompt;
-    if (!prompt) {
+    if (true) {
       alert('Please provide an image prompt first.');
       return;

[NoCoverage] BlockStatement
components/ExamView.tsx:232:9
       return;
     }
 
-    try {
-      const url = await gemini.generateIllustration(prompt, false);
-      if (url) {
-        const assetId =
-          stepId === 'header'
-            ? `header_${exam.id}`
-            : `step_${stepId}_${Math.random().toString(36).substr(2, 5)}`;
-        const localUrl = await storage.saveAsset(assetId, url);
-
-        if (stepId === 'header') {
-          updateGeneralField('headerImageUrl', url);
-          if (localUrl) updateGeneralField('localHeaderImageUrl', localUrl);
-        } else {
-          updateStepField(stepId, 'imageUrl', url);
-          if (localUrl) updateStepField(stepId, 'localImageUrl', localUrl);
-        }
-      }
-    } catch (e) {
+    try {} catch (e) {
       alert('Generation failed. Check connectivity.');
     }

[NoCoverage] BooleanLiteral
components/ExamView.tsx:233:61
     }
 
     try {
-      const url = await gemini.generateIllustration(prompt, false);
+      const url = await gemini.generateIllustration(prompt, true);
       if (url) {
         const assetId =

[NoCoverage] ConditionalExpression
components/ExamView.tsx:234:11
 
     try {
       const url = await gemini.generateIllustration(prompt, false);
-      if (url) {
+      if (true) {
         const assetId =
           stepId === 'header'

[NoCoverage] ConditionalExpression
components/ExamView.tsx:234:11
 
     try {
       const url = await gemini.generateIllustration(prompt, false);
-      if (url) {
+      if (false) {
         const assetId =
           stepId === 'header'

[NoCoverage] ConditionalExpression
components/ExamView.tsx:236:11
       const url = await gemini.generateIllustration(prompt, false);
       if (url) {
         const assetId =
-          stepId === 'header'
+          true
             ? `header_${exam.id}`
             : `step_${stepId}_${Math.random().toString(36).substr(2, 5)}`;
