[NoCoverage] EqualityOperator
components/ExamView.tsx:236:11
       const url = await gemini.generateIllustration(prompt, false);
       if (url) {
         const assetId =
-          stepId === 'header'
+          stepId !== 'header'
             ? `header_${exam.id}`
             : `step_${stepId}_${Math.random().toString(36).substr(2, 5)}`;

[NoCoverage] MethodExpression
components/ExamView.tsx:238:33
         const assetId =
           stepId === 'header'
             ? `header_${exam.id}`
-            : `step_${stepId}_${Math.random().toString(36).substr(2, 5)}`;
+            : `step_${stepId}_${Math.random().toString(36)}`;
         const localUrl = await storage.saveAsset(assetId, url);
 

[NoCoverage] StringLiteral
components/ExamView.tsx:238:15
         const assetId =
           stepId === 'header'
             ? `header_${exam.id}`
-            : `step_${stepId}_${Math.random().toString(36).substr(2, 5)}`;
+            : ``;
         const localUrl = await storage.saveAsset(assetId, url);
 

[NoCoverage] ConditionalExpression
components/ExamView.tsx:241:13
             : `step_${stepId}_${Math.random().toString(36).substr(2, 5)}`;
         const localUrl = await storage.saveAsset(assetId, url);
 
-        if (stepId === 'header') {
+        if (false) {
           updateGeneralField('headerImageUrl', url);
           if (localUrl) updateGeneralField('localHeaderImageUrl', localUrl);

[NoCoverage] StringLiteral
components/ExamView.tsx:242:30
         const localUrl = await storage.saveAsset(assetId, url);
 
         if (stepId === 'header') {
-          updateGeneralField('headerImageUrl', url);
+          updateGeneralField("", url);
           if (localUrl) updateGeneralField('localHeaderImageUrl', localUrl);
         } else {

[NoCoverage] ConditionalExpression
components/ExamView.tsx:243:15
 
         if (stepId === 'header') {
           updateGeneralField('headerImageUrl', url);
-          if (localUrl) updateGeneralField('localHeaderImageUrl', localUrl);
+          if (true) updateGeneralField('localHeaderImageUrl', localUrl);
         } else {
           updateStepField(stepId, 'imageUrl', url);

[NoCoverage] ConditionalExpression
components/ExamView.tsx:243:15
 
         if (stepId === 'header') {
           updateGeneralField('headerImageUrl', url);
-          if (localUrl) updateGeneralField('localHeaderImageUrl', localUrl);
+          if (false) updateGeneralField('localHeaderImageUrl', localUrl);
         } else {
           updateStepField(stepId, 'imageUrl', url);

[NoCoverage] BlockStatement
components/ExamView.tsx:244:16
         if (stepId === 'header') {
           updateGeneralField('headerImageUrl', url);
           if (localUrl) updateGeneralField('localHeaderImageUrl', localUrl);
-        } else {
-          updateStepField(stepId, 'imageUrl', url);
-          if (localUrl) updateStepField(stepId, 'localImageUrl', localUrl);
-        }
+        } else {}
       }
     } catch (e) {

[NoCoverage] ConditionalExpression
components/ExamView.tsx:246:15
           if (localUrl) updateGeneralField('localHeaderImageUrl', localUrl);
         } else {
           updateStepField(stepId, 'imageUrl', url);
-          if (localUrl) updateStepField(stepId, 'localImageUrl', localUrl);
+          if (true) updateStepField(stepId, 'localImageUrl', localUrl);
         }
       }

[NoCoverage] ConditionalExpression
components/ExamView.tsx:246:15
           if (localUrl) updateGeneralField('localHeaderImageUrl', localUrl);
         } else {
           updateStepField(stepId, 'imageUrl', url);
-          if (localUrl) updateStepField(stepId, 'localImageUrl', localUrl);
+          if (false) updateStepField(stepId, 'localImageUrl', localUrl);
         }
       }

[NoCoverage] BlockStatement
components/ExamView.tsx:249:17
           if (localUrl) updateStepField(stepId, 'localImageUrl', localUrl);
         }
       }
-    } catch (e) {
-      alert('Generation failed. Check connectivity.');
-    }
+    } catch (e) {}
   };
 

[NoCoverage] StringLiteral
components/ExamView.tsx:250:13
         }
       }
     } catch (e) {
-      alert('Generation failed. Check connectivity.');
+      alert("");
     }
   };

[NoCoverage] EqualityOperator
components/ExamView.tsx:255:5
   };
 
   const progress =
-    (exam.steps || []).length > 0
+    (exam.steps || []).length >= 0
       ? Math.round((checkedSteps.size / (exam.steps || []).length) * 100)
       : 0;

[NoCoverage] EqualityOperator
components/ExamView.tsx:255:5
   };
 
   const progress =
-    (exam.steps || []).length > 0
+    (exam.steps || []).length <= 0
       ? Math.round((checkedSteps.size / (exam.steps || []).length) * 100)
       : 0;

[NoCoverage] ArithmeticOperator
components/ExamView.tsx:256:21
 
   const progress =
     (exam.steps || []).length > 0
-      ? Math.round((checkedSteps.size / (exam.steps || []).length) * 100)
+      ? Math.round((checkedSteps.size * (exam.steps || []).length) * 100)
       : 0;
 

[NoCoverage] ConditionalExpression
components/ExamView.tsx:256:42
 
   const progress =
     (exam.steps || []).length > 0
-      ? Math.round((checkedSteps.size / (exam.steps || []).length) * 100)
+      ? Math.round((checkedSteps.size / (true).length) * 100)
       : 0;
 

[NoCoverage] BlockStatement
components/ExamView.tsx:259:36
       ? Math.round((checkedSteps.size / (exam.steps || []).length) * 100)
       : 0;
 
-  const handleRefine = async () => {
-    if (!refinementPrompt.trim() || !navigator.onLine) return;
-    setIsRefining(true);
-    try {
-      setLastExamState({ ...exam });
-      const refinedData = await gemini.refineExamination(exam, refinementPrompt);
-      setExam((prev) => ({ ...prev, ...refinedData }));
-      setRefinementPrompt('');
-      setShowUndo(true);
-      setTimeout(() => setShowUndo(false), 10000);
-    } catch (e) {
-      console.error(e);
-      alert('Refinement failed. Please try again.');
-    } finally {
-      setIsRefining(false);
-    }
-  };
+  const handleRefine = async () => {};
 
   const handleUndoRefine = () => {

[NoCoverage] BooleanLiteral
components/ExamView.tsx:260:9
       : 0;
 
   const handleRefine = async () => {
-    if (!refinementPrompt.trim() || !navigator.onLine) return;
+    if (refinementPrompt.trim() || !navigator.onLine) return;
     setIsRefining(true);
     try {

[NoCoverage] LogicalOperator
components/ExamView.tsx:260:9
       : 0;
 
   const handleRefine = async () => {
-    if (!refinementPrompt.trim() || !navigator.onLine) return;
+    if (!refinementPrompt.trim() && !navigator.onLine) return;
     setIsRefining(true);
     try {

[NoCoverage] BooleanLiteral
components/ExamView.tsx:261:19
 
   const handleRefine = async () => {
     if (!refinementPrompt.trim() || !navigator.onLine) return;
-    setIsRefining(true);
+    setIsRefining(false);
     try {
       setLastExamState({ ...exam });

[NoCoverage] BlockStatement
components/ExamView.tsx:262:9
   const handleRefine = async () => {
     if (!refinementPrompt.trim() || !navigator.onLine) return;
     setIsRefining(true);
-    try {
-      setLastExamState({ ...exam });
-      const refinedData = await gemini.refineExamination(exam, refinementPrompt);
-      setExam((prev) => ({ ...prev, ...refinedData }));
-      setRefinementPrompt('');
-      setShowUndo(true);
-      setTimeout(() => setShowUndo(false), 10000);
-    } catch (e) {
+    try {} catch (e) {
       console.error(e);
       alert('Refinement failed. Please try again.');

[NoCoverage] ObjectLiteral
components/ExamView.tsx:263:24
     if (!refinementPrompt.trim() || !navigator.onLine) return;
     setIsRefining(true);
     try {
-      setLastExamState({ ...exam });
+      setLastExamState({});
       const refinedData = await gemini.refineExamination(exam, refinementPrompt);
       setExam((prev) => ({ ...prev, ...refinedData }));

[NoCoverage] ArrowFunction
components/ExamView.tsx:265:15
     try {
       setLastExamState({ ...exam });
       const refinedData = await gemini.refineExamination(exam, refinementPrompt);
-      setExam((prev) => ({ ...prev, ...refinedData }));
+      setExam(() => undefined);
       setRefinementPrompt('');
       setShowUndo(true);

[NoCoverage] BooleanLiteral
components/ExamView.tsx:267:19
       const refinedData = await gemini.refineExamination(exam, refinementPrompt);
       setExam((prev) => ({ ...prev, ...refinedData }));
       setRefinementPrompt('');
-      setShowUndo(true);
+      setShowUndo(false);
       setTimeout(() => setShowUndo(false), 10000);
     } catch (e) {

[NoCoverage] ArrowFunction
components/ExamView.tsx:268:18
       setExam((prev) => ({ ...prev, ...refinedData }));
       setRefinementPrompt('');
       setShowUndo(true);
-      setTimeout(() => setShowUndo(false), 10000);
+      setTimeout(() => undefined, 10000);
     } catch (e) {
       console.error(e);

[NoCoverage] BooleanLiteral
components/ExamView.tsx:268:36
       setExam((prev) => ({ ...prev, ...refinedData }));
       setRefinementPrompt('');
       setShowUndo(true);
-      setTimeout(() => setShowUndo(false), 10000);
+      setTimeout(() => setShowUndo(true), 10000);
     } catch (e) {
       console.error(e);

[NoCoverage] BlockStatement
components/ExamView.tsx:269:17
       setRefinementPrompt('');
       setShowUndo(true);
       setTimeout(() => setShowUndo(false), 10000);
-    } catch (e) {
-      console.error(e);
-      alert('Refinement failed. Please try again.');
-    } finally {
+    } catch (e) {} finally {
       setIsRefining(false);
     }

[NoCoverage] BlockStatement
components/ExamView.tsx:272:15
     } catch (e) {
       console.error(e);
       alert('Refinement failed. Please try again.');
-    } finally {
-      setIsRefining(false);
-    }
+    } finally {}
   };
 

[NoCoverage] BooleanLiteral
components/ExamView.tsx:273:21
       console.error(e);
       alert('Refinement failed. Please try again.');
     } finally {
-      setIsRefining(false);
+      setIsRefining(true);
     }
   };

[NoCoverage] BlockStatement
components/ExamView.tsx:277:34
     }
   };
 
-  const handleUndoRefine = () => {
-    if (lastExamState) {
-      setExam(lastExamState);
-      setLastExamState(null);
-      setShowUndo(false);
-    }
-  };
+  const handleUndoRefine = () => {};
 
   const handleSelectStep = (stepId: string, stepTitle: string) => {

[NoCoverage] ConditionalExpression
components/ExamView.tsx:278:9
   };
 
   const handleUndoRefine = () => {
-    if (lastExamState) {
+    if (false) {
       setExam(lastExamState);
       setLastExamState(null);

[NoCoverage] BlockStatement
components/ExamView.tsx:278:24
   };
 
   const handleUndoRefine = () => {
-    if (lastExamState) {
-      setExam(lastExamState);
-      setLastExamState(null);
-      setShowUndo(false);
-    }
+    if (lastExamState) {}
   };
 

[NoCoverage] BooleanLiteral
components/ExamView.tsx:281:19
     if (lastExamState) {
       setExam(lastExamState);
       setLastExamState(null);
-      setShowUndo(false);
+      setShowUndo(true);
     }
   };

[NoCoverage] BlockStatement
components/ExamView.tsx:285:67
     }
   };
 
-  const handleSelectStep = (stepId: string, stepTitle: string) => {
-    setSelectedStepId(stepId);
-    setSelectedPathoSign(null); // Clear sign details when switching steps
-    addToHistory('exam', stepTitle);
-  };
+  const handleSelectStep = (stepId: string, stepTitle: string) => {};
 
   // Build the context tab elements

[NoCoverage] StringLiteral
components/ExamView.tsx:288:18
   const handleSelectStep = (stepId: string, stepTitle: string) => {
     setSelectedStepId(stepId);
     setSelectedPathoSign(null); // Clear sign details when switching steps
-    addToHistory('exam', stepTitle);
+    addToHistory("", stepTitle);
   };
 

[NoCoverage] StringLiteral
components/ExamView.tsx:293:11
 
   // Build the context tab elements
   const workspaceTabs = [
-    { id: 'steps', label: 'Protocol', icon: ListCheck },
+    { id: "", label: 'Protocol', icon: ListCheck },
     { id: 'physiology', label: 'Physiology', icon: Activity },
     { id: 'clinical', label: 'Clinical', icon: Microscope },

[NoCoverage] StringLiteral
components/ExamView.tsx:293:27
 
   // Build the context tab elements
   const workspaceTabs = [
-    { id: 'steps', label: 'Protocol', icon: ListCheck },
+    { id: 'steps', label: "", icon: ListCheck },
     { id: 'physiology', label: 'Physiology', icon: Activity },
     { id: 'clinical', label: 'Clinical', icon: Microscope },

[NoCoverage] StringLiteral
components/ExamView.tsx:294:11
   // Build the context tab elements
   const workspaceTabs = [
     { id: 'steps', label: 'Protocol', icon: ListCheck },
-    { id: 'physiology', label: 'Physiology', icon: Activity },
+    { id: "", label: 'Physiology', icon: Activity },
     { id: 'clinical', label: 'Clinical', icon: Microscope },
     { id: 'visuals', label: 'Visual Aids', icon: ImageIcon },

[NoCoverage] StringLiteral
components/ExamView.tsx:294:32
   // Build the context tab elements
   const workspaceTabs = [
     { id: 'steps', label: 'Protocol', icon: ListCheck },
-    { id: 'physiology', label: 'Physiology', icon: Activity },
+    { id: 'physiology', label: "", icon: Activity },
     { id: 'clinical', label: 'Clinical', icon: Microscope },
     { id: 'visuals', label: 'Visual Aids', icon: ImageIcon },

[NoCoverage] ObjectLiteral
components/ExamView.tsx:295:5
   const workspaceTabs = [
     { id: 'steps', label: 'Protocol', icon: ListCheck },
     { id: 'physiology', label: 'Physiology', icon: Activity },
-    { id: 'clinical', label: 'Clinical', icon: Microscope },
+    {},
     { id: 'visuals', label: 'Visual Aids', icon: ImageIcon },
     { id: 'onepager', label: 'One-Pager', icon: FileText }

[NoCoverage] StringLiteral
components/ExamView.tsx:297:11
     { id: 'physiology', label: 'Physiology', icon: Activity },
     { id: 'clinical', label: 'Clinical', icon: Microscope },
     { id: 'visuals', label: 'Visual Aids', icon: ImageIcon },
-    { id: 'onepager', label: 'One-Pager', icon: FileText }
+    { id: "", label: 'One-Pager', icon: FileText }
   ];
 

[NoCoverage] ObjectLiteral
components/ExamView.tsx:297:5
     { id: 'physiology', label: 'Physiology', icon: Activity },
     { id: 'clinical', label: 'Clinical', icon: Microscope },
     { id: 'visuals', label: 'Visual Aids', icon: ImageIcon },
-    { id: 'onepager', label: 'One-Pager', icon: FileText }
+    {}
   ];
 

[NoCoverage] ConditionalExpression
components/ExamView.tsx:303:9
   // Render Col 3 (Drilled Down details)
   const detailPanelContent = useMemo(() => {
     // If clinical correlation sign is selected
-    if (selectedPathoSign) {
+    if (false) {
       return (
         <div className="space-y-6">

[NoCoverage] ConditionalExpression
components/ExamView.tsx:303:9
   // Render Col 3 (Drilled Down details)
   const detailPanelContent = useMemo(() => {
     // If clinical correlation sign is selected
-    if (selectedPathoSign) {
+    if (true) {
       return (
         <div className="space-y-6">

[NoCoverage] ArrowFunction
components/ExamView.tsx:311:24
               {selectedPathoSign}
             </h3>
             <button
-              onClick={() => setSelectedPathoSign(null)}
+              onClick={() => undefined}
               className="p-1 hover:bg-slate-950/40/5 rounded-lg text-slate-400 hover:text-white"
             >

[NoCoverage] ArrowFunction
components/ExamView.tsx:339:45
                   Common Causes
                 </span>
                 <ul className="space-y-2">
-                  {pathoSignData.causes.map((cause, i) => (
-                    <li
-                      key={i}
-                      className="bg-slate-950/40/5 border border-white/5 rounded-xl px-4 py-3 text-xs font-bold flex items-center gap-2"
-                    >
-                      <div className="w-1.5 h-1.5 rounded-full bg-rose-950/200" />
-                      {cause}
-                    </li>
-                  ))}
+                  {pathoSignData.causes.map(() => undefined)}
                 </ul>
               </div>

[NoCoverage] LogicalOperator
components/ExamView.tsx:360:16
                 </p>
               </div>
 
-              {pathoSignData.affectedAnatomy && (
-                <div className="bg-indigo-950/20 border border-indigo-500/10 rounded-2xl p-5">
-                  <span className="text-[9px] font-black uppercase tracking-wider text-indigo-400 block mb-2">
-                    Anatomical Focus
-                  </span>
-                  <p className="text-xs font-bold leading-relaxed">
-                    {pathoSignData.affectedAnatomy}
-                  </p>
-                </div>
-              )}
+              {pathoSignData.affectedAnatomy || <div className="bg-indigo-950/20 border border-indigo-500/10 rounded-2xl p-5">
+                  <span className="text-[9px] font-black uppercase tracking-wider text-indigo-400 block mb-2">
+                    Anatomical Focus
+                  </span>
+                  <p className="text-xs font-bold leading-relaxed">
+                    {pathoSignData.affectedAnatomy}
+                  </p>
+                </div>}
             </div>
           ) : (

[NoCoverage] ConditionalExpression
components/ExamView.tsx:360:16
                 </p>
               </div>
 
-              {pathoSignData.affectedAnatomy && (
-                <div className="bg-indigo-950/20 border border-indigo-500/10 rounded-2xl p-5">
-                  <span className="text-[9px] font-black uppercase tracking-wider text-indigo-400 block mb-2">
-                    Anatomical Focus
-                  </span>
-                  <p className="text-xs font-bold leading-relaxed">
-                    {pathoSignData.affectedAnatomy}
-                  </p>
-                </div>
-              )}
+              {true}
             </div>
           ) : (

[NoCoverage] ConditionalExpression
components/ExamView.tsx:380:9
       );
     }
 
-    if (activeTab === 'steps') {
+    if (true) {
       return (
         <div className="space-y-6">

[NoCoverage] ConditionalExpression
components/ExamView.tsx:380:9
       );
     }
 
-    if (activeTab === 'steps') {
+    if (false) {
       return (
         <div className="space-y-6">

[NoCoverage] LogicalOperator
components/ExamView.tsx:400:14
                 <span>12-15 Min</span>
               </div>
             </div>
-            {exam.referenceStandard && (
-              <div className="bg-slate-950/40 border border-white/5 rounded-2xl p-4 flex flex-col justify-center">
-                <span className="text-[8px] font-black text-slate-400 uppercase tracking-wider mb-1">
-                  Reference Level
-                </span>
-                <span
-                  className="text-xs font-black text-indigo-400 truncate"
-                  title={exam.referenceStandard}
-                >
-                  {exam.referenceStandard}
-                </span>
-              </div>
-            )}
+            {exam.referenceStandard || <div className="bg-slate-950/40 border border-white/5 rounded-2xl p-4 flex flex-col justify-center">
+                <span className="text-[8px] font-black text-slate-400 uppercase tracking-wider mb-1">
+                  Reference Level
+                </span>
+                <span className="text-xs font-black text-indigo-400 truncate" title={exam.referenceStandard}>
+                  {exam.referenceStandard}
+                </span>
+              </div>}
           </div>
 

[NoCoverage] ConditionalExpression
components/ExamView.tsx:400:14
                 <span>12-15 Min</span>
               </div>
             </div>
-            {exam.referenceStandard && (
-              <div className="bg-slate-950/40 border border-white/5 rounded-2xl p-4 flex flex-col justify-center">
-                <span className="text-[8px] font-black text-slate-400 uppercase tracking-wider mb-1">
-                  Reference Level
-                </span>
-                <span
-                  className="text-xs font-black text-indigo-400 truncate"
-                  title={exam.referenceStandard}
-                >
-                  {exam.referenceStandard}
-                </span>
-              </div>
-            )}
+            {true}
           </div>
 

[NoCoverage] ArithmeticOperator
components/ExamView.tsx:430:22
             </div>
             <div className="flex justify-between text-[8px] font-black text-slate-550 uppercase tracking-widest">
               <span>{checkedSteps.size} Checked</span>
-              <span>{exam.steps.length - checkedSteps.size} Left</span>
+              <span>{exam.steps.length + checkedSteps.size} Left</span>
             </div>
           </div>

[NoCoverage] ArrowFunction
components/ExamView.tsx:447:25
             </p>
             <textarea
               value={refinementPrompt}
-              onChange={(e) => setRefinementPrompt(e.target.value)}
+              onChange={() => undefined}
               placeholder="e.g. Add details for auscultatory zones..."
               className="w-full bg-slate-900 border border-white/5 rounded-xl p-3 text-xs outline-none focus:border-indigo-500 min-h-[90px] resize-none text-slate-350 placeholder:text-slate-400"

[NoCoverage] LogicalOperator
components/ExamView.tsx:454:25
             />
             <button
               onClick={handleRefine}
-              disabled={isRefining || !refinementPrompt.trim()}
+              disabled={isRefining && !refinementPrompt.trim()}
             >

[NoCoverage] MethodExpression
components/ExamView.tsx:454:40
             />
             <button
               onClick={handleRefine}
-              disabled={isRefining || !refinementPrompt.trim()}
+              disabled={isRefining || !refinementPrompt}
             >

[NoCoverage] ConditionalExpression
components/ExamView.tsx:478:9
       );
     }
 
-    if (activeTab === 'physiology') {
+    if (true) {
       if (
         selectedPhysiologyBucket === null &&

[NoCoverage] EqualityOperator
components/ExamView.tsx:478:9
       );
     }
 
-    if (activeTab === 'physiology') {
+    if (activeTab !== 'physiology') {
       if (
         selectedPhysiologyBucket === null &&

[NoCoverage] LogicalOperator
components/ExamView.tsx:480:9
 
     if (activeTab === 'physiology') {
       if (
-        selectedPhysiologyBucket === null &&
-        exam.physiologyBuckets &&
-        exam.physiologyBuckets.length > 0
+        selectedPhysiologyBucket === null && exam.physiologyBuckets || exam.physiologyBuckets.length > 0
       ) {
         setSelectedPhysiologyBucket(0);

[NoCoverage] LogicalOperator
components/ExamView.tsx:480:9
 
     if (activeTab === 'physiology') {
       if (
-        selectedPhysiologyBucket === null &&
-        exam.physiologyBuckets &&
+        selectedPhysiologyBucket === null || exam.physiologyBuckets &&
         exam.physiologyBuckets.length > 0
       ) {

[NoCoverage] ConditionalExpression
components/ExamView.tsx:482:9
       if (
         selectedPhysiologyBucket === null &&
         exam.physiologyBuckets &&
-        exam.physiologyBuckets.length > 0
+        true
       ) {
         setSelectedPhysiologyBucket(0);

[NoCoverage] EqualityOperator
components/ExamView.tsx:482:9
       if (
         selectedPhysiologyBucket === null &&
         exam.physiologyBuckets &&
-        exam.physiologyBuckets.length > 0
+        exam.physiologyBuckets.length >= 0
       ) {
         setSelectedPhysiologyBucket(0);

[NoCoverage] BlockStatement
components/ExamView.tsx:483:9
         selectedPhysiologyBucket === null &&
         exam.physiologyBuckets &&
         exam.physiologyBuckets.length > 0
-      ) {
-        setSelectedPhysiologyBucket(0);
-      }
+      ) {}
 
       const bucket = exam.physiologyBuckets?.[selectedPhysiologyBucket || 0];

[NoCoverage] ConditionalExpression
components/ExamView.tsx:487:47
         setSelectedPhysiologyBucket(0);
       }
 
-      const bucket = exam.physiologyBuckets?.[selectedPhysiologyBucket || 0];
+      const bucket = exam.physiologyBuckets?.[false];
       if (!bucket) return null;
 

[NoCoverage] LogicalOperator
components/ExamView.tsx:487:47
         setSelectedPhysiologyBucket(0);
       }
 
-      const bucket = exam.physiologyBuckets?.[selectedPhysiologyBucket || 0];
+      const bucket = exam.physiologyBuckets?.[selectedPhysiologyBucket && 0];
       if (!bucket) return null;
 

[NoCoverage] BooleanLiteral
components/ExamView.tsx:488:11
       }
 
       const bucket = exam.physiologyBuckets?.[selectedPhysiologyBucket || 0];
-      if (!bucket) return null;
+      if (bucket) return null;
 
       return (

[NoCoverage] ConditionalExpression
components/ExamView.tsx:488:11
       }
 
       const bucket = exam.physiologyBuckets?.[selectedPhysiologyBucket || 0];
-      if (!bucket) return null;
+      if (true) return null;
 
       return (

[NoCoverage] ArrowFunction
components/ExamView.tsx:502:33
           </div>
 
           <div className="space-y-4">
-            {bucket.content.map((item, i) => (
-              <div
-                key={i}
-                className="bg-slate-950/40/5 border border-white/5 rounded-2xl p-5 hover:border-emerald-500/20 transition-all"
-              >
-                <span className="text-[10px] font-black text-emerald-400 block mb-2 uppercase tracking-wide">
-                  {item.label}
-                </span>
-                <p className="text-xs font-medium text-slate-300 leading-relaxed">
-                  {item.description}
-                </p>
-              </div>
-            ))}
+            {bucket.content.map(() => undefined)}
           </div>
         </div>

[NoCoverage] ConditionalExpression
components/ExamView.tsx:520:9
       );
     }
 
-    if (activeTab === 'clinical') {
+    if (true) {
       if (
         selectedDifferentialIndex === null &&

[NoCoverage] EqualityOperator
components/ExamView.tsx:520:9
       );
     }
 
-    if (activeTab === 'clinical') {
+    if (activeTab !== 'clinical') {
       if (
         selectedDifferentialIndex === null &&

[NoCoverage] ConditionalExpression
components/ExamView.tsx:522:9
 
     if (activeTab === 'clinical') {
       if (
-        selectedDifferentialIndex === null &&
-        exam.differentialDiagnoses &&
-        exam.differentialDiagnoses.length > 0
+        true
       ) {
         setSelectedDifferentialIndex(0);

[NoCoverage] ConditionalExpression
components/ExamView.tsx:522:9
 
     if (activeTab === 'clinical') {
       if (
-        selectedDifferentialIndex === null &&
-        exam.differentialDiagnoses &&
+        true &&
         exam.differentialDiagnoses.length > 0
       ) {

[NoCoverage] ConditionalExpression
components/ExamView.tsx:524:9
       if (
         selectedDifferentialIndex === null &&
         exam.differentialDiagnoses &&
-        exam.differentialDiagnoses.length > 0
+        true
       ) {
         setSelectedDifferentialIndex(0);

[NoCoverage] EqualityOperator
components/ExamView.tsx:524:9
       if (
         selectedDifferentialIndex === null &&
         exam.differentialDiagnoses &&
-        exam.differentialDiagnoses.length > 0
+        exam.differentialDiagnoses.length >= 0
       ) {
         setSelectedDifferentialIndex(0);

[NoCoverage] BlockStatement
components/ExamView.tsx:525:9
         selectedDifferentialIndex === null &&
         exam.differentialDiagnoses &&
         exam.differentialDiagnoses.length > 0
-      ) {
-        setSelectedDifferentialIndex(0);
-      }
+      ) {}
 
       const diff = exam.differentialDiagnoses?.[selectedDifferentialIndex || 0];

[NoCoverage] OptionalChaining
components/ExamView.tsx:529:20
         setSelectedDifferentialIndex(0);
       }
 
-      const diff = exam.differentialDiagnoses?.[selectedDifferentialIndex || 0];
+      const diff = exam.differentialDiagnoses[selectedDifferentialIndex || 0];
       if (!diff) return null;
 

[NoCoverage] LogicalOperator
components/ExamView.tsx:529:49
         setSelectedDifferentialIndex(0);
       }
 
-      const diff = exam.differentialDiagnoses?.[selectedDifferentialIndex || 0];
+      const diff = exam.differentialDiagnoses?.[selectedDifferentialIndex && 0];
       if (!diff) return null;
 

[NoCoverage] ConditionalExpression
components/ExamView.tsx:530:11
       }
 
       const diff = exam.differentialDiagnoses?.[selectedDifferentialIndex || 0];
-      if (!diff) return null;
+      if (true) return null;
 
       return (

[NoCoverage] BooleanLiteral
components/ExamView.tsx:530:11
       }
 
       const diff = exam.differentialDiagnoses?.[selectedDifferentialIndex || 0];
-      if (!diff) return null;
+      if (diff) return null;
 
       return (

[NoCoverage] ConditionalExpression
components/ExamView.tsx:577:7
     showUndo
   ]);
 
-  if (isResearching)
+  if (false)
     return (
       <div className="h-full flex flex-col items-center justify-center p-20 bg-slate-950 text-slate-100">

[NoCoverage] ConditionalExpression
components/ExamView.tsx:577:7
     showUndo
   ]);
 
-  if (isResearching)
+  if (true)
     return (
       <div className="h-full flex flex-col items-center justify-center p-20 bg-slate-950 text-slate-100">

[NoCoverage] ConditionalExpression
components/ExamView.tsx:595:23
   return (
     <WorkspaceLayout
       activeSystem={exam.system}
-      onSelectSystem={onSelectSystem || (() => {})}
+      onSelectSystem={false}
       activeExamName={exam.name}
       activeTab={activeTab}

[NoCoverage] ConditionalExpression
components/ExamView.tsx:595:23
   return (
     <WorkspaceLayout
       activeSystem={exam.system}
-      onSelectSystem={onSelectSystem || (() => {})}
+      onSelectSystem={true}
       activeExamName={exam.name}
       activeTab={activeTab}
