[NoCoverage] EqualityOperator
components/FoundationalDetailModal.tsx:228:44
               )}
 
               {/* Special Tests */}
-              {conceptData.specialTests && conceptData.specialTests.length > 0 && (
+              {conceptData.specialTests && conceptData.specialTests.length <= 0 && (
                 <div className="p-6 bg-slate-950/40 border border-slate-800/80 rounded-2xl space-y-6">
                   <h3 className="text-xs font-black uppercase tracking-widest text-slate-400 flex items-center gap-2">

[NoCoverage] LogicalOperator
components/FoundationalDetailModal.tsx:228:16
               )}
 
               {/* Special Tests */}
-              {conceptData.specialTests && conceptData.specialTests.length > 0 && (
+              {conceptData.specialTests || conceptData.specialTests.length > 0 && (
                 <div className="p-6 bg-slate-950/40 border border-slate-800/80 rounded-2xl space-y-6">
                   <h3 className="text-xs font-black uppercase tracking-widest text-slate-400 flex items-center gap-2">

[NoCoverage] ConditionalExpression
components/FoundationalDetailModal.tsx:294:16
               )}
 
               {/* First-Principles Mechanics */}
-              {conceptData.firstPrinciplesMechanics && (
-                <div className="space-y-4">
-                  <h3 className="text-xs font-black uppercase tracking-widest text-slate-400 flex items-center gap-2">
-                    <Zap className="w-4 h-4 text-amber-400" /> First-Principles Mechanics
-                  </h3>
-                  <div className="text-sm leading-relaxed text-slate-300 space-y-6 font-medium bg-slate-950/20 p-8 rounded-[24px] border border-slate-800/50 shadow-inner">
-                    {typeof conceptData.firstPrinciplesMechanics === 'string'
-                      ? renderFullContent(conceptData.firstPrinciplesMechanics, 'first-principles')
-                      : Object.entries(conceptData.firstPrinciplesMechanics).map(([key, val]) => (
-                          <div
-                            key={key}
-                            className="space-y-3 border-b border-slate-800/30 pb-6 last:border-0 last:pb-0"
-                          >
-                            <span className="text-[10px] font-black text-amber-500 uppercase tracking-widest block">
-                              {key.replace(/_/g, ' ')}
-                            </span>
-                            <div className="text-slate-300 leading-relaxed">
-                              {renderFullContent(String(val), key)}
-                            </div>
-                          </div>
-                        ))}
-                  </div>
-                </div>
-              )}
+              {false}
             </div>
           )}

[NoCoverage] ConditionalExpression
components/FoundationalDetailModal.tsx:294:16
               )}
 
               {/* First-Principles Mechanics */}
-              {conceptData.firstPrinciplesMechanics && (
-                <div className="space-y-4">
-                  <h3 className="text-xs font-black uppercase tracking-widest text-slate-400 flex items-center gap-2">
-                    <Zap className="w-4 h-4 text-amber-400" /> First-Principles Mechanics
-                  </h3>
-                  <div className="text-sm leading-relaxed text-slate-300 space-y-6 font-medium bg-slate-950/20 p-8 rounded-[24px] border border-slate-800/50 shadow-inner">
-                    {typeof conceptData.firstPrinciplesMechanics === 'string'
-                      ? renderFullContent(conceptData.firstPrinciplesMechanics, 'first-principles')
-                      : Object.entries(conceptData.firstPrinciplesMechanics).map(([key, val]) => (
-                          <div
-                            key={key}
-                            className="space-y-3 border-b border-slate-800/30 pb-6 last:border-0 last:pb-0"
-                          >
-                            <span className="text-[10px] font-black text-amber-500 uppercase tracking-widest block">
-                              {key.replace(/_/g, ' ')}
-                            </span>
-                            <div className="text-slate-300 leading-relaxed">
-                              {renderFullContent(String(val), key)}
-                            </div>
-                          </div>
-                        ))}
-                  </div>
-                </div>
-              )}
+              {true}
             </div>
           )}

[NoCoverage] EqualityOperator
components/FoundationalDetailModal.tsx:300:22
                     <Zap className="w-4 h-4 text-amber-400" /> First-Principles Mechanics
                   </h3>
                   <div className="text-sm leading-relaxed text-slate-300 space-y-6 font-medium bg-slate-950/20 p-8 rounded-[24px] border border-slate-800/50 shadow-inner">
-                    {typeof conceptData.firstPrinciplesMechanics === 'string'
+                    {typeof conceptData.firstPrinciplesMechanics !== 'string'
                       ? renderFullContent(conceptData.firstPrinciplesMechanics, 'first-principles')
                       : Object.entries(conceptData.firstPrinciplesMechanics).map(([key, val]) => (

[NoCoverage] ConditionalExpression
components/FoundationalDetailModal.tsx:300:22
                     <Zap className="w-4 h-4 text-amber-400" /> First-Principles Mechanics
                   </h3>
                   <div className="text-sm leading-relaxed text-slate-300 space-y-6 font-medium bg-slate-950/20 p-8 rounded-[24px] border border-slate-800/50 shadow-inner">
-                    {typeof conceptData.firstPrinciplesMechanics === 'string'
+                    {true
                       ? renderFullContent(conceptData.firstPrinciplesMechanics, 'first-principles')
                       : Object.entries(conceptData.firstPrinciplesMechanics).map(([key, val]) => (

[NoCoverage] ArrowFunction
components/FoundationalDetailModal.tsx:302:82
                   <div className="text-sm leading-relaxed text-slate-300 space-y-6 font-medium bg-slate-950/20 p-8 rounded-[24px] border border-slate-800/50 shadow-inner">
                     {typeof conceptData.firstPrinciplesMechanics === 'string'
                       ? renderFullContent(conceptData.firstPrinciplesMechanics, 'first-principles')
-                      : Object.entries(conceptData.firstPrinciplesMechanics).map(([key, val]) => (
-                          <div
-                            key={key}
-                            className="space-y-3 border-b border-slate-800/30 pb-6 last:border-0 last:pb-0"
-                          >
-                            <span className="text-[10px] font-black text-amber-500 uppercase tracking-widest block">
-                              {key.replace(/_/g, ' ')}
-                            </span>
-                            <div className="text-slate-300 leading-relaxed">
-                              {renderFullContent(String(val), key)}
-                            </div>
-                          </div>
-                        ))}
+                      : Object.entries(conceptData.firstPrinciplesMechanics).map(() => undefined)}
                   </div>
                 </div>

[NoCoverage] StringLiteral
components/FoundationalDetailModal.tsx:308:50
                             className="space-y-3 border-b border-slate-800/30 pb-6 last:border-0 last:pb-0"
                           >
                             <span className="text-[10px] font-black text-amber-500 uppercase tracking-widest block">
-                              {key.replace(/_/g, ' ')}
+                              {key.replace(/_/g, "")}
                             </span>
                             <div className="text-slate-300 leading-relaxed">

[NoCoverage] ConditionalExpression
components/FoundationalDetailModal.tsx:325:16
           {structureData && (
             <div className="space-y-8">
               {/* Surface Relations */}
-              {structureData.surfaceLandmarksAndRelations && (
-                <div className="p-6 bg-slate-950/40 border border-slate-800/80 rounded-2xl space-y-4">
-                  <h3 className="text-xs font-black uppercase tracking-widest text-slate-400 flex items-center gap-2">
-                    <BookOpen className="w-4 h-4 text-indigo-400" /> Spatial Relations & Limits
-                  </h3>
-                  <div className="grid grid-cols-1 md:grid-cols-2 gap-6 text-sm font-medium text-slate-300">
-                    {Object.entries(structureData.surfaceLandmarksAndRelations).map(
-                      ([key, value]) => (
-                        <div
-                          key={key}
-                          className="space-y-2 bg-slate-900/50 p-4 rounded-xl border border-slate-850 flex flex-col justify-between"
-                        >
-                          <span className="text-[9px] font-black text-slate-400 uppercase tracking-widest block">
-                            {key}
-                          </span>
-                          <div className="mt-1">{renderRoteOrRelationValue(value, key)}</div>
-                        </div>
-                      )
-                    )}
-                  </div>
-                </div>
-              )}
+              {true}
 
               {/* Anatomy details */}

[NoCoverage] ConditionalExpression
components/FoundationalDetailModal.tsx:325:16
           {structureData && (
             <div className="space-y-8">
               {/* Surface Relations */}
-              {structureData.surfaceLandmarksAndRelations && (
-                <div className="p-6 bg-slate-950/40 border border-slate-800/80 rounded-2xl space-y-4">
-                  <h3 className="text-xs font-black uppercase tracking-widest text-slate-400 flex items-center gap-2">
-                    <BookOpen className="w-4 h-4 text-indigo-400" /> Spatial Relations & Limits
-                  </h3>
-                  <div className="grid grid-cols-1 md:grid-cols-2 gap-6 text-sm font-medium text-slate-300">
-                    {Object.entries(structureData.surfaceLandmarksAndRelations).map(
-                      ([key, value]) => (
-                        <div
-                          key={key}
-                          className="space-y-2 bg-slate-900/50 p-4 rounded-xl border border-slate-850 flex flex-col justify-between"
-                        >
-                          <span className="text-[9px] font-black text-slate-400 uppercase tracking-widest block">
-                            {key}
-                          </span>
-                          <div className="mt-1">{renderRoteOrRelationValue(value, key)}</div>
-                        </div>
-                      )
-                    )}
-                  </div>
-                </div>
-              )}
+              {false}
 
               {/* Anatomy details */}

[NoCoverage] ArrowFunction
components/FoundationalDetailModal.tsx:332:23
                   </h3>
                   <div className="grid grid-cols-1 md:grid-cols-2 gap-6 text-sm font-medium text-slate-300">
                     {Object.entries(structureData.surfaceLandmarksAndRelations).map(
-                      ([key, value]) => (
-                        <div
-                          key={key}
-                          className="space-y-2 bg-slate-900/50 p-4 rounded-xl border border-slate-850 flex flex-col justify-between"
-                        >
-                          <span className="text-[9px] font-black text-slate-400 uppercase tracking-widest block">
-                            {key}
-                          </span>
-                          <div className="mt-1">{renderRoteOrRelationValue(value, key)}</div>
-                        </div>
-                      )
+                      () => undefined
                     )}
                   </div>

[NoCoverage] LogicalOperator
components/FoundationalDetailModal.tsx:350:18
 
               {/* Anatomy details */}
               <div className="space-y-6">
-                {structureData.macroAnatomy && (
-                  <div className="bg-slate-950/20 p-8 rounded-[24px] border border-slate-800/50 space-y-2 shadow-inner">
-                    <span className="text-[10px] font-black text-blue-400 uppercase tracking-widest block">
-                      Macroanatomy
-                    </span>
-                    <div className="text-sm text-slate-300 leading-relaxed font-medium">
-                      {renderFullContent(structureData.macroAnatomy.description, 'macro')}
-                    </div>
-                  </div>
-                )}
+                {structureData.macroAnatomy || <div className="bg-slate-950/20 p-8 rounded-[24px] border border-slate-800/50 space-y-2 shadow-inner">
+                    <span className="text-[10px] font-black text-blue-400 uppercase tracking-widest block">
+                      Macroanatomy
+                    </span>
+                    <div className="text-sm text-slate-300 leading-relaxed font-medium">
+                      {renderFullContent(structureData.macroAnatomy.description, 'macro')}
+                    </div>
+                  </div>}
                 {structureData.microAnatomyAndHistology && (
                   <div className="bg-slate-950/20 p-8 rounded-[24px] border border-slate-800/50 space-y-4 shadow-inner">

[NoCoverage] ConditionalExpression
components/FoundationalDetailModal.tsx:350:18
 
               {/* Anatomy details */}
               <div className="space-y-6">
-                {structureData.macroAnatomy && (
-                  <div className="bg-slate-950/20 p-8 rounded-[24px] border border-slate-800/50 space-y-2 shadow-inner">
-                    <span className="text-[10px] font-black text-blue-400 uppercase tracking-widest block">
-                      Macroanatomy
-                    </span>
-                    <div className="text-sm text-slate-300 leading-relaxed font-medium">
-                      {renderFullContent(structureData.macroAnatomy.description, 'macro')}
-                    </div>
-                  </div>
-                )}
+                {true}
                 {structureData.microAnatomyAndHistology && (
                   <div className="bg-slate-950/20 p-8 rounded-[24px] border border-slate-800/50 space-y-4 shadow-inner">

[NoCoverage] StringLiteral
components/FoundationalDetailModal.tsx:356:82
                       Macroanatomy
                     </span>
                     <div className="text-sm text-slate-300 leading-relaxed font-medium">
-                      {renderFullContent(structureData.macroAnatomy.description, 'macro')}
+                      {renderFullContent(structureData.macroAnatomy.description, "")}
                     </div>
                   </div>

[NoCoverage] ConditionalExpression
components/FoundationalDetailModal.tsx:360:18
                     </div>
                   </div>
                 )}
-                {structureData.microAnatomyAndHistology && (
-                  <div className="bg-slate-950/20 p-8 rounded-[24px] border border-slate-800/50 space-y-4 shadow-inner">
-                    <span className="text-[10px] font-black text-purple-400 uppercase tracking-widest block">
-                      Microanatomy & Histology
-                    </span>
-                    {Object.entries(structureData.microAnatomyAndHistology).map(([key, value]) => (
-                      <div
-                        key={key}
-                        className="text-sm text-slate-300 leading-relaxed font-medium bg-slate-900/30 p-4 rounded-xl border border-slate-850"
-                      >
-                        <span className="text-[9px] font-black text-slate-400 uppercase tracking-widest block mb-1">
-                          {key.replace(/([A-Z])/g, ' $1')}:
-                        </span>
-                        {renderFullContent(String(value), key)}
-                      </div>
-                    ))}
-                  </div>
-                )}
+                {false}
                 {(structureData.bloodSupply || structureData.innervation) && (
                   <div className="grid grid-cols-1 md:grid-cols-2 gap-6">

[NoCoverage] ConditionalExpression
components/FoundationalDetailModal.tsx:360:18
                     </div>
                   </div>
                 )}
-                {structureData.microAnatomyAndHistology && (
-                  <div className="bg-slate-950/20 p-8 rounded-[24px] border border-slate-800/50 space-y-4 shadow-inner">
-                    <span className="text-[10px] font-black text-purple-400 uppercase tracking-widest block">
-                      Microanatomy & Histology
-                    </span>
-                    {Object.entries(structureData.microAnatomyAndHistology).map(([key, value]) => (
-                      <div
-                        key={key}
-                        className="text-sm text-slate-300 leading-relaxed font-medium bg-slate-900/30 p-4 rounded-xl border border-slate-850"
-                      >
-                        <span className="text-[9px] font-black text-slate-400 uppercase tracking-widest block mb-1">
-                          {key.replace(/([A-Z])/g, ' $1')}:
-                        </span>
-                        {renderFullContent(String(value), key)}
-                      </div>
-                    ))}
-                  </div>
-                )}
+                {true}
                 {(structureData.bloodSupply || structureData.innervation) && (
                   <div className="grid grid-cols-1 md:grid-cols-2 gap-6">

[NoCoverage] ArrowFunction
components/FoundationalDetailModal.tsx:365:81
                     <span className="text-[10px] font-black text-purple-400 uppercase tracking-widest block">
                       Microanatomy & Histology
                     </span>
-                    {Object.entries(structureData.microAnatomyAndHistology).map(([key, value]) => (
-                      <div
-                        key={key}
-                        className="text-sm text-slate-300 leading-relaxed font-medium bg-slate-900/30 p-4 rounded-xl border border-slate-850"
-                      >
-                        <span className="text-[9px] font-black text-slate-400 uppercase tracking-widest block mb-1">
-                          {key.replace(/([A-Z])/g, ' $1')}:
-                        </span>
-                        {renderFullContent(String(value), key)}
-                      </div>
-                    ))}
+                    {Object.entries(structureData.microAnatomyAndHistology).map(() => undefined)}
                   </div>
                 )}

[NoCoverage] ConditionalExpression
components/FoundationalDetailModal.tsx:378:19
                     ))}
                   </div>
                 )}
-                {(structureData.bloodSupply || structureData.innervation) && (
+                {(true) && (
                   <div className="grid grid-cols-1 md:grid-cols-2 gap-6">
                     {structureData.bloodSupply && (

[NoCoverage] LogicalOperator
components/FoundationalDetailModal.tsx:378:19
                     ))}
                   </div>
                 )}
-                {(structureData.bloodSupply || structureData.innervation) && (
+                {(structureData.bloodSupply && structureData.innervation) && (
                   <div className="grid grid-cols-1 md:grid-cols-2 gap-6">
                     {structureData.bloodSupply && (

[NoCoverage] ConditionalExpression
components/FoundationalDetailModal.tsx:380:22
                 )}
                 {(structureData.bloodSupply || structureData.innervation) && (
                   <div className="grid grid-cols-1 md:grid-cols-2 gap-6">
-                    {structureData.bloodSupply && (
-                      <div className="bg-slate-950/20 p-8 rounded-[24px] border border-slate-800/50 space-y-4 shadow-inner">
-                        <span className="text-[10px] font-black text-red-400 uppercase tracking-widest block">
-                          Vascular / Blood Supply
-                        </span>
-                        {Object.entries(structureData.bloodSupply).map(([k, v]) => (
-                          <div
-                            key={k}
-                            className="text-xs text-slate-300 font-medium bg-slate-900/30 p-4 rounded-xl border border-slate-850"
-                          >
-                            <span className="text-[9px] font-black text-slate-400 uppercase tracking-widest block mb-1">
-                              {k}:
-                            </span>
-                            {renderFullContent(String(v), k)}
-                          </div>
-                        ))}
-                      </div>
-                    )}
+                    {true}
                     {structureData.innervation && (
                       <div className="bg-slate-950/20 p-8 rounded-[24px] border border-slate-800/50 space-y-4 shadow-inner">

[NoCoverage] ConditionalExpression
components/FoundationalDetailModal.tsx:380:22
                 )}
                 {(structureData.bloodSupply || structureData.innervation) && (
                   <div className="grid grid-cols-1 md:grid-cols-2 gap-6">
-                    {structureData.bloodSupply && (
-                      <div className="bg-slate-950/20 p-8 rounded-[24px] border border-slate-800/50 space-y-4 shadow-inner">
-                        <span className="text-[10px] font-black text-red-400 uppercase tracking-widest block">
-                          Vascular / Blood Supply
-                        </span>
-                        {Object.entries(structureData.bloodSupply).map(([k, v]) => (
-                          <div
-                            key={k}
-                            className="text-xs text-slate-300 font-medium bg-slate-900/30 p-4 rounded-xl border border-slate-850"
-                          >
-                            <span className="text-[9px] font-black text-slate-400 uppercase tracking-widest block mb-1">
-                              {k}:
-                            </span>
-                            {renderFullContent(String(v), k)}
-                          </div>
-                        ))}
-                      </div>
-                    )}
+                    {false}
                     {structureData.innervation && (
                       <div className="bg-slate-950/20 p-8 rounded-[24px] border border-slate-800/50 space-y-4 shadow-inner">

[NoCoverage] ArrowFunction
components/FoundationalDetailModal.tsx:385:72
                         <span className="text-[10px] font-black text-red-400 uppercase tracking-widest block">
                           Vascular / Blood Supply
                         </span>
-                        {Object.entries(structureData.bloodSupply).map(([k, v]) => (
-                          <div
-                            key={k}
-                            className="text-xs text-slate-300 font-medium bg-slate-900/30 p-4 rounded-xl border border-slate-850"
-                          >
-                            <span className="text-[9px] font-black text-slate-400 uppercase tracking-widest block mb-1">
-                              {k}:
-                            </span>
-                            {renderFullContent(String(v), k)}
-                          </div>
-                        ))}
+                        {Object.entries(structureData.bloodSupply).map(() => undefined)}
                       </div>
                     )}

[NoCoverage] ConditionalExpression
components/FoundationalDetailModal.tsx:398:22
                         ))}
                       </div>
                     )}
-                    {structureData.innervation && (
-                      <div className="bg-slate-950/20 p-8 rounded-[24px] border border-slate-800/50 space-y-4 shadow-inner">
-                        <span className="text-[10px] font-black text-emerald-400 uppercase tracking-widest block">
-                          Innervation
-                        </span>
-                        {Object.entries(structureData.innervation).map(([k, v]) => (
-                          <div
-                            key={k}
-                            className="text-xs text-slate-300 font-medium bg-slate-900/30 p-4 rounded-xl border border-slate-850"
-                          >
-                            <span className="text-[9px] font-black text-slate-400 uppercase tracking-widest block mb-1">
-                              {k}:
-                            </span>
-                            {renderFullContent(String(v), k)}
-                          </div>
-                        ))}
-                      </div>
-                    )}
+                    {false}
                   </div>
                 )}

[NoCoverage] ConditionalExpression
components/FoundationalDetailModal.tsx:398:22
                         ))}
                       </div>
                     )}
-                    {structureData.innervation && (
-                      <div className="bg-slate-950/20 p-8 rounded-[24px] border border-slate-800/50 space-y-4 shadow-inner">
-                        <span className="text-[10px] font-black text-emerald-400 uppercase tracking-widest block">
-                          Innervation
-                        </span>
-                        {Object.entries(structureData.innervation).map(([k, v]) => (
-                          <div
-                            key={k}
-                            className="text-xs text-slate-300 font-medium bg-slate-900/30 p-4 rounded-xl border border-slate-850"
-                          >
-                            <span className="text-[9px] font-black text-slate-400 uppercase tracking-widest block mb-1">
-                              {k}:
-                            </span>
-                            {renderFullContent(String(v), k)}
-                          </div>
-                        ))}
-                      </div>
-                    )}
+                    {true}
                   </div>
                 )}

[NoCoverage] ArrowFunction
components/FoundationalDetailModal.tsx:403:72
                         <span className="text-[10px] font-black text-emerald-400 uppercase tracking-widest block">
                           Innervation
                         </span>
-                        {Object.entries(structureData.innervation).map(([k, v]) => (
-                          <div
-                            key={k}
-                            className="text-xs text-slate-300 font-medium bg-slate-900/30 p-4 rounded-xl border border-slate-850"
-                          >
-                            <span className="text-[9px] font-black text-slate-400 uppercase tracking-widest block mb-1">
-                              {k}:
-                            </span>
-                            {renderFullContent(String(v), k)}
-                          </div>
-                        ))}
+                        {Object.entries(structureData.innervation).map(() => undefined)}
                       </div>
                     )}

[NoCoverage] ConditionalExpression
components/FoundationalDetailModal.tsx:423:12
           )}
 
           {/* Clinical Correlations Section */}
-          {correlations.length > 0 && (
-            <div className="space-y-4">
-              <h3 className="text-xs font-black uppercase tracking-widest text-slate-400 flex items-center gap-2">
-                <ShieldAlert className="w-4 h-4 text-rose-500" /> Clinical & Anaesthetic
-                Correlations
-              </h3>
-              <div className="space-y-4">
-                {correlations.map((corr, idx) => (
-                  <div
-                    key={idx}
-                    className="p-6 bg-slate-950/40 border border-slate-850 rounded-2xl space-y-3 relative overflow-hidden group hover:border-rose-500/30 transition-colors"
-                  >
-                    <div className="absolute top-0 left-0 bottom-0 w-1.5 bg-rose-950/200" />
-                    <h4 className="text-sm font-black text-white uppercase tracking-wide">
-                      {corr.scenario}
-                    </h4>
-                    <div className="text-xs text-slate-300 leading-relaxed font-medium">
-                      {renderFullContent(corr.anatomicalBasis, `corr-${idx}`)}
-                    </div>
-                  </div>
-                ))}
-              </div>
-            </div>
-          )}
+          {true}
 
           {/* Cross Reference Keys */}

[NoCoverage] ConditionalExpression
components/FoundationalDetailModal.tsx:423:12
           )}
 
           {/* Clinical Correlations Section */}
-          {correlations.length > 0 && (
+          {true && (
             <div className="space-y-4">
               <h3 className="text-xs font-black uppercase tracking-widest text-slate-400 flex items-center gap-2">
