[NoCoverage] ArrowFunction
components/FoundationalDetailModal.tsx:430:35
                 Correlations
               </h3>
               <div className="space-y-4">
-                {correlations.map((corr, idx) => (
-                  <div
-                    key={idx}
-                    className="p-6 bg-slate-950/40 border border-slate-850 rounded-2xl space-y-3 relative overflow-hidden group hover:border-rose-500/30 transition-colors"
-                  >
-                    <div className="absolute top-0 left-0 bottom-0 w-1.5 bg-rose-950/200" />
-                    <h4 className="text-sm font-black text-white uppercase tracking-wide">
-                      {corr.scenario}
-                    </h4>
-                    <div className="text-xs text-slate-300 leading-relaxed font-medium">
-                      {renderFullContent(corr.anatomicalBasis, `corr-${idx}`)}
-                    </div>
-                  </div>
-                ))}
+                {correlations.map(() => undefined)}
               </div>
             </div>

[NoCoverage] StringLiteral
components/FoundationalDetailModal.tsx:440:64
                       {corr.scenario}
                     </h4>
                     <div className="text-xs text-slate-300 leading-relaxed font-medium">
-                      {renderFullContent(corr.anatomicalBasis, `corr-${idx}`)}
+                      {renderFullContent(corr.anatomicalBasis, ``)}
                     </div>
                   </div>

[NoCoverage] LogicalOperator
components/FoundationalDetailModal.tsx:449:12
           )}
 
           {/* Cross Reference Keys */}
-          {currentModule?.crossReferenceKeys && (
-            <div className="space-y-2 pt-4 border-t border-slate-800/80">
-              <span className="text-[9px] font-black text-slate-400 uppercase tracking-widest block">
-                Cross-References
-              </span>
-              <div className="flex flex-wrap gap-2">
-                {currentModule.crossReferenceKeys.map((key) => (
-                  <span
-                    key={key}
-                    className="px-2.5 py-1 bg-slate-950 border border-slate-800 text-slate-400 rounded-md text-[10px] font-bold"
-                  >
-                    {key}
-                  </span>
-                ))}
-              </div>
-            </div>
-          )}
+          {currentModule?.crossReferenceKeys || <div className="space-y-2 pt-4 border-t border-slate-800/80">
+              <span className="text-[9px] font-black text-slate-400 uppercase tracking-widest block">
+                Cross-References
+              </span>
+              <div className="flex flex-wrap gap-2">
+                {currentModule.crossReferenceKeys.map(key => <span key={key} className="px-2.5 py-1 bg-slate-950 border border-slate-800 text-slate-400 rounded-md text-[10px] font-bold">
+                    {key}
+                  </span>)}
+              </div>
+            </div>}
         </div>
 

[NoCoverage] ConditionalExpression
components/FoundationalDetailModal.tsx:449:12
           )}
 
           {/* Cross Reference Keys */}
-          {currentModule?.crossReferenceKeys && (
-            <div className="space-y-2 pt-4 border-t border-slate-800/80">
-              <span className="text-[9px] font-black text-slate-400 uppercase tracking-widest block">
-                Cross-References
-              </span>
-              <div className="flex flex-wrap gap-2">
-                {currentModule.crossReferenceKeys.map((key) => (
-                  <span
-                    key={key}
-                    className="px-2.5 py-1 bg-slate-950 border border-slate-800 text-slate-400 rounded-md text-[10px] font-bold"
-                  >
-                    {key}
-                  </span>
-                ))}
-              </div>
-            </div>
-          )}
+          {true}
         </div>
 

[NoCoverage] ArrowFunction
components/FoundationalDetailModal.tsx:455:55
                 Cross-References
               </span>
               <div className="flex flex-wrap gap-2">
-                {currentModule.crossReferenceKeys.map((key) => (
-                  <span
-                    key={key}
-                    className="px-2.5 py-1 bg-slate-950 border border-slate-800 text-slate-400 rounded-md text-[10px] font-bold"
-                  >
-                    {key}
-                  </span>
-                ))}
+                {currentModule.crossReferenceKeys.map(() => undefined)}
               </div>
             </div>

[NoCoverage] MethodExpression
components/FoundationalDetailModal.tsx:471:24
         {/* Footer */}
         <div className="p-4 bg-slate-950 border-t border-slate-800 flex items-center justify-between text-[10px] font-bold text-slate-400 uppercase">
           <span>Tauri Local Secure Index</span>
-          <span>Layer {document.moduleId.startsWith('cell') ? '2' : '1'} Module Detail</span>
+          <span>Layer {document.moduleId.endsWith('cell') ? '2' : '1'} Module Detail</span>
         </div>
       </div>

[NoCoverage] StringLiteral
components/FoundationalDetailModal.tsx:471:53
         {/* Footer */}
         <div className="p-4 bg-slate-950 border-t border-slate-800 flex items-center justify-between text-[10px] font-bold text-slate-400 uppercase">
           <span>Tauri Local Secure Index</span>
-          <span>Layer {document.moduleId.startsWith('cell') ? '2' : '1'} Module Detail</span>
+          <span>Layer {document.moduleId.startsWith("") ? '2' : '1'} Module Detail</span>
         </div>
       </div>
