[NoCoverage] BooleanLiteral
components/GenericPharmacologyView.tsx:26:46
 export const GenericPharmacologyView: React.FC = () => {
   const [searchQuery, setSearchQuery] = useState('');
   const [searchType, setSearchType] = useState<'drug' | 'condition'>('drug');
-  const [isLoading, setIsLoading] = useState(false);
+  const [isLoading, setIsLoading] = useState(true);
   const [error, setError] = useState<string | null>(null);
 

[NoCoverage] ArrayDeclaration
components/GenericPharmacologyView.tsx:30:71
   const [error, setError] = useState<string | null>(null);
 
   const [selectedDrug, setSelectedDrug] = useState<DrugInfo | null>(null);
-  const [suggestedDrugs, setSuggestedDrugs] = useState<DrugMapping[]>([]);
+  const [suggestedDrugs, setSuggestedDrugs] = useState<DrugMapping[]>(["Stryker was here"]);
   const [recentSearches, setRecentSearches] = useState<string[]>([]);
 

[NoCoverage] ArrayDeclaration
components/GenericPharmacologyView.tsx:31:66
 
   const [selectedDrug, setSelectedDrug] = useState<DrugInfo | null>(null);
   const [suggestedDrugs, setSuggestedDrugs] = useState<DrugMapping[]>([]);
-  const [recentSearches, setRecentSearches] = useState<string[]>([]);
+  const [recentSearches, setRecentSearches] = useState<string[]>(["Stryker was here"]);
 
   const handleSearch = async (e?: React.FormEvent) => {

[NoCoverage] MethodExpression
components/GenericPharmacologyView.tsx:35:10
 
   const handleSearch = async (e?: React.FormEvent) => {
     e?.preventDefault();
-    if (!searchQuery.trim()) return;
+    if (!searchQuery) return;
 
     setIsLoading(true);

[NoCoverage] ConditionalExpression
components/GenericPharmacologyView.tsx:35:9
 
   const handleSearch = async (e?: React.FormEvent) => {
     e?.preventDefault();
-    if (!searchQuery.trim()) return;
+    if (false) return;
 
     setIsLoading(true);

[NoCoverage] ArrayDeclaration
components/GenericPharmacologyView.tsx:40:23
     setIsLoading(true);
     setError(null);
     setSelectedDrug(null);
-    setSuggestedDrugs([]);
+    setSuggestedDrugs(["Stryker was here"]);
 
     try {

[NoCoverage] BlockStatement
components/GenericPharmacologyView.tsx:42:9
     setSelectedDrug(null);
     setSuggestedDrugs([]);
 
-    try {
-      if (searchType === 'drug') {
-        const info = await geminiService.getDrugInfo(searchQuery);
-        setSelectedDrug(info);
-      } else {
-        const mappings = await geminiService.getDrugsForCondition(searchQuery);
-        setSuggestedDrugs(mappings);
-      }
-
-      // Add to recent searches
-      setRecentSearches((prev) => {
-        const filtered = prev.filter((s) => s.toLowerCase() !== searchQuery.toLowerCase());
-        return [searchQuery, ...filtered].slice(0, 5);
-      });
-    } catch (err) {
+    try {} catch (err) {
       console.error('Search failed:', err);
       setError('Failed to retrieve pharmacology data. Please try again.');

[NoCoverage] EqualityOperator
components/GenericPharmacologyView.tsx:43:11
     setSuggestedDrugs([]);
 
     try {
-      if (searchType === 'drug') {
+      if (searchType !== 'drug') {
         const info = await geminiService.getDrugInfo(searchQuery);
         setSelectedDrug(info);

[NoCoverage] BlockStatement
components/GenericPharmacologyView.tsx:43:34
     setSuggestedDrugs([]);
 
     try {
-      if (searchType === 'drug') {
-        const info = await geminiService.getDrugInfo(searchQuery);
-        setSelectedDrug(info);
-      } else {
+      if (searchType === 'drug') {} else {
         const mappings = await geminiService.getDrugsForCondition(searchQuery);
         setSuggestedDrugs(mappings);

[NoCoverage] BlockStatement
components/GenericPharmacologyView.tsx:46:14
       if (searchType === 'drug') {
         const info = await geminiService.getDrugInfo(searchQuery);
         setSelectedDrug(info);
-      } else {
-        const mappings = await geminiService.getDrugsForCondition(searchQuery);
-        setSuggestedDrugs(mappings);
-      }
+      } else {}
 
       // Add to recent searches

[NoCoverage] BlockStatement
components/GenericPharmacologyView.tsx:52:35
       }
 
       // Add to recent searches
-      setRecentSearches((prev) => {
-        const filtered = prev.filter((s) => s.toLowerCase() !== searchQuery.toLowerCase());
-        return [searchQuery, ...filtered].slice(0, 5);
-      });
+      setRecentSearches((prev) => {});
     } catch (err) {
       console.error('Search failed:', err);

[NoCoverage] ConditionalExpression
components/GenericPharmacologyView.tsx:53:45
 
       // Add to recent searches
       setRecentSearches((prev) => {
-        const filtered = prev.filter((s) => s.toLowerCase() !== searchQuery.toLowerCase());
+        const filtered = prev.filter((s) => false);
         return [searchQuery, ...filtered].slice(0, 5);
       });

[NoCoverage] MethodExpression
components/GenericPharmacologyView.tsx:53:65
 
       // Add to recent searches
       setRecentSearches((prev) => {
-        const filtered = prev.filter((s) => s.toLowerCase() !== searchQuery.toLowerCase());
+        const filtered = prev.filter((s) => s.toLowerCase() !== searchQuery.toUpperCase());
         return [searchQuery, ...filtered].slice(0, 5);
       });

[NoCoverage] MethodExpression
components/GenericPharmacologyView.tsx:54:16
       // Add to recent searches
       setRecentSearches((prev) => {
         const filtered = prev.filter((s) => s.toLowerCase() !== searchQuery.toLowerCase());
-        return [searchQuery, ...filtered].slice(0, 5);
+        return [searchQuery, ...filtered];
       });
     } catch (err) {

[NoCoverage] BlockStatement
components/GenericPharmacologyView.tsx:56:19
         const filtered = prev.filter((s) => s.toLowerCase() !== searchQuery.toLowerCase());
         return [searchQuery, ...filtered].slice(0, 5);
       });
-    } catch (err) {
-      console.error('Search failed:', err);
-      setError('Failed to retrieve pharmacology data. Please try again.');
-    } finally {
+    } catch (err) {} finally {
       setIsLoading(false);
     }

[NoCoverage] StringLiteral
components/GenericPharmacologyView.tsx:57:21
         return [searchQuery, ...filtered].slice(0, 5);
       });
     } catch (err) {
-      console.error('Search failed:', err);
+      console.error("", err);
       setError('Failed to retrieve pharmacology data. Please try again.');
     } finally {

[NoCoverage] BlockStatement
components/GenericPharmacologyView.tsx:59:15
     } catch (err) {
       console.error('Search failed:', err);
       setError('Failed to retrieve pharmacology data. Please try again.');
-    } finally {
-      setIsLoading(false);
-    }
+    } finally {}
   };
 

[NoCoverage] BlockStatement
components/GenericPharmacologyView.tsx:64:65
     }
   };
 
-  const handleSelectSuggestedDrug = async (drugName: string) => {
-    setIsLoading(true);
-    setError(null);
-    try {
-      const info = await geminiService.getDrugInfo(drugName);
-      setSelectedDrug(info);
-      setSearchType('drug');
-      setSearchQuery(drugName);
-    } catch (err) {
-      setError('Failed to load drug detailed information.');
-    } finally {
-      setIsLoading(false);
-    }
-  };
+  const handleSelectSuggestedDrug = async (drugName: string) => {};
 
   return (

[NoCoverage] BooleanLiteral
components/GenericPharmacologyView.tsx:65:18
   };
 
   const handleSelectSuggestedDrug = async (drugName: string) => {
-    setIsLoading(true);
+    setIsLoading(false);
     setError(null);
     try {

[NoCoverage] BlockStatement
components/GenericPharmacologyView.tsx:67:9
   const handleSelectSuggestedDrug = async (drugName: string) => {
     setIsLoading(true);
     setError(null);
-    try {
-      const info = await geminiService.getDrugInfo(drugName);
-      setSelectedDrug(info);
-      setSearchType('drug');
-      setSearchQuery(drugName);
-    } catch (err) {
+    try {} catch (err) {
       setError('Failed to load drug detailed information.');
     } finally {

[NoCoverage] StringLiteral
components/GenericPharmacologyView.tsx:70:21
     try {
       const info = await geminiService.getDrugInfo(drugName);
       setSelectedDrug(info);
-      setSearchType('drug');
+      setSearchType("");
       setSearchQuery(drugName);
     } catch (err) {

[NoCoverage] BlockStatement
components/GenericPharmacologyView.tsx:72:19
       setSelectedDrug(info);
       setSearchType('drug');
       setSearchQuery(drugName);
-    } catch (err) {
-      setError('Failed to load drug detailed information.');
-    } finally {
+    } catch (err) {} finally {
       setIsLoading(false);
     }

[NoCoverage] BlockStatement
components/GenericPharmacologyView.tsx:74:15
       setSearchQuery(drugName);
     } catch (err) {
       setError('Failed to load drug detailed information.');
-    } finally {
-      setIsLoading(false);
-    }
+    } finally {}
   };
 

[NoCoverage] ArrowFunction
components/GenericPharmacologyView.tsx:105:24
 
           <div className="flex justify-center gap-2 mb-10 p-1.5 bg-slate-950/40 backdrop-blur-sm rounded-2xl w-fit mx-auto border border-white/5">
             <button
-              onClick={() => setSearchType('drug')}
+              onClick={() => undefined}
               className={`px-8 py-3 rounded-xl font-bold transition-all ${
                 searchType === 'drug'

[NoCoverage] StringLiteral
components/GenericPharmacologyView.tsx:105:44
 
           <div className="flex justify-center gap-2 mb-10 p-1.5 bg-slate-950/40 backdrop-blur-sm rounded-2xl w-fit mx-auto border border-white/5">
             <button
-              onClick={() => setSearchType('drug')}
+              onClick={() => setSearchType("")}
               className={`px-8 py-3 rounded-xl font-bold transition-all ${
                 searchType === 'drug'

[NoCoverage] ConditionalExpression
components/GenericPharmacologyView.tsx:107:17
             <button
               onClick={() => setSearchType('drug')}
               className={`px-8 py-3 rounded-xl font-bold transition-all ${
-                searchType === 'drug'
+                true
                   ? 'bg-slate-950/40 text-indigo-600 shadow-md shadow-indigo-950/40'
                   : 'text-slate-400 hover:text-slate-350'

[NoCoverage] EqualityOperator
components/GenericPharmacologyView.tsx:107:17
             <button
               onClick={() => setSearchType('drug')}
               className={`px-8 py-3 rounded-xl font-bold transition-all ${
-                searchType === 'drug'
+                searchType !== 'drug'
                   ? 'bg-slate-950/40 text-indigo-600 shadow-md shadow-indigo-950/40'
                   : 'text-slate-400 hover:text-slate-350'

[NoCoverage] StringLiteral
components/GenericPharmacologyView.tsx:108:21
               onClick={() => setSearchType('drug')}
               className={`px-8 py-3 rounded-xl font-bold transition-all ${
                 searchType === 'drug'
-                  ? 'bg-slate-950/40 text-indigo-600 shadow-md shadow-indigo-950/40'
+                  ? ""
                   : 'text-slate-400 hover:text-slate-350'
               }`}

[NoCoverage] ArrowFunction
components/GenericPharmacologyView.tsx:115:24
               Drug Reference
             </button>
             <button
-              onClick={() => setSearchType('condition')}
+              onClick={() => undefined}
               className={`px-8 py-3 rounded-xl font-bold transition-all ${
                 searchType === 'condition'

[NoCoverage] ConditionalExpression
components/GenericPharmacologyView.tsx:117:17
             <button
               onClick={() => setSearchType('condition')}
               className={`px-8 py-3 rounded-xl font-bold transition-all ${
-                searchType === 'condition'
+                true
                   ? 'bg-slate-950/40 text-indigo-600 shadow-md shadow-indigo-950/40'
                   : 'text-slate-400 hover:text-slate-350'

[NoCoverage] EqualityOperator
components/GenericPharmacologyView.tsx:117:17
             <button
               onClick={() => setSearchType('condition')}
               className={`px-8 py-3 rounded-xl font-bold transition-all ${
-                searchType === 'condition'
+                searchType !== 'condition'
                   ? 'bg-slate-950/40 text-indigo-600 shadow-md shadow-indigo-950/40'
                   : 'text-slate-400 hover:text-slate-350'

[NoCoverage] ConditionalExpression
components/GenericPharmacologyView.tsx:133:17
               value={searchQuery}
               onChange={(e) => setSearchQuery(e.target.value)}
               placeholder={
-                searchType === 'drug'
+                true
                   ? 'Search generic name, trade name or class...'
                   : 'Search condition (e.g. Sepsis, Atrial Fibrillation)...'

[NoCoverage] EqualityOperator
components/GenericPharmacologyView.tsx:133:17
               value={searchQuery}
               onChange={(e) => setSearchQuery(e.target.value)}
               placeholder={
-                searchType === 'drug'
+                searchType !== 'drug'
                   ? 'Search generic name, trade name or class...'
                   : 'Search condition (e.g. Sepsis, Atrial Fibrillation)...'

[NoCoverage] StringLiteral
components/GenericPharmacologyView.tsx:135:21
               placeholder={
                 searchType === 'drug'
                   ? 'Search generic name, trade name or class...'
-                  : 'Search condition (e.g. Sepsis, Atrial Fibrillation)...'
+                  : ""
               }

[NoCoverage] EqualityOperator
components/GenericPharmacologyView.tsx:148:12
             </button>
           </form>
 
-          {recentSearches?.length > 0 && (
+          {recentSearches?.length >= 0 && (
             <div className="mt-8 flex flex-wrap justify-center gap-3">
               <span className="text-sm font-black text-slate-400 uppercase tracking-widest self-center mr-2">

[NoCoverage] ConditionalExpression
components/GenericPharmacologyView.tsx:148:12
             </button>
           </form>
 
-          {recentSearches?.length > 0 && (
-            <div className="mt-8 flex flex-wrap justify-center gap-3">
-              <span className="text-sm font-black text-slate-400 uppercase tracking-widest self-center mr-2">
-                Recent:
-              </span>
-              {recentSearches.map((s, idx) => (
-                <button
-                  key={idx}
-                  onClick={() => {
-                    setSearchQuery(s);
-                    handleSearch();
-                  }}
-                  className="text-sm font-bold text-slate-400 bg-slate-950/40 border border-white/5 px-5 py-2 rounded-full hover:border-indigo-400 hover:text-indigo-600 transition-all shadow-sm"
-                >
-                  {s}
-                </button>
-              ))}
-            </div>
-          )}
+          {false}
         </div>
       </div>

[NoCoverage] ArrowFunction
components/GenericPharmacologyView.tsx:153:35
               <span className="text-sm font-black text-slate-400 uppercase tracking-widest self-center mr-2">
                 Recent:
               </span>
-              {recentSearches.map((s, idx) => (
-                <button
-                  key={idx}
-                  onClick={() => {
-                    setSearchQuery(s);
-                    handleSearch();
-                  }}
-                  className="text-sm font-bold text-slate-400 bg-slate-950/40 border border-white/5 px-5 py-2 rounded-full hover:border-indigo-400 hover:text-indigo-600 transition-all shadow-sm"
-                >
-                  {s}
-                </button>
-              ))}
+              {recentSearches.map(() => undefined)}
             </div>
           )}

[NoCoverage] BlockStatement
components/GenericPharmacologyView.tsx:156:34
               {recentSearches.map((s, idx) => (
                 <button
                   key={idx}
-                  onClick={() => {
-                    setSearchQuery(s);
-                    handleSearch();
-                  }}
+                  onClick={() => {}}
                   className="text-sm font-bold text-slate-400 bg-slate-950/40 border border-white/5 px-5 py-2 rounded-full hover:border-indigo-400 hover:text-indigo-600 transition-all shadow-sm"
                 >

[NoCoverage] ConditionalExpression
components/GenericPharmacologyView.tsx:172:12
 
       <div className="max-w-7xl mx-auto px-6 mt-16">
         <AnimatePresence mode="wait">
-          {error && (
-            <motion.div
-              initial={{ opacity: 0, scale: 0.95 }}
-              animate={{ opacity: 1, scale: 1 }}
-              exit={{ opacity: 0, scale: 0.95 }}
-              className="bg-rose-950/20 border-2 border-rose-950/30 p-8 rounded-[32px] flex items-center gap-6 text-rose-455 shadow-lg shadow-rose-100"
-            >
-              <div className="bg-rose-100 p-3 rounded-2xl">
-                <AlertTriangle className="w-8 h-8 shrink-0" />
-              </div>
-              <p className="font-bold text-lg">{error}</p>
-            </motion.div>
-          )}
+          {false}
 
           {isLoading && !selectedDrug && suggestedDrugs.length === 0 && (

[NoCoverage] LogicalOperator
components/GenericPharmacologyView.tsx:172:12
 
       <div className="max-w-7xl mx-auto px-6 mt-16">
         <AnimatePresence mode="wait">
-          {error && (
-            <motion.div
-              initial={{ opacity: 0, scale: 0.95 }}
-              animate={{ opacity: 1, scale: 1 }}
-              exit={{ opacity: 0, scale: 0.95 }}
-              className="bg-rose-950/20 border-2 border-rose-950/30 p-8 rounded-[32px] flex items-center gap-6 text-rose-455 shadow-lg shadow-rose-100"
-            >
-              <div className="bg-rose-100 p-3 rounded-2xl">
-                <AlertTriangle className="w-8 h-8 shrink-0" />
-              </div>
-              <p className="font-bold text-lg">{error}</p>
-            </motion.div>
-          )}
+          {error || <motion.div initial={{
+  opacity: 0,
+  scale: 0.95
+}} animate={{
+  opacity: 1,
+  scale: 1
+}} exit={{
+  opacity: 0,
+  scale: 0.95
+}} className="bg-rose-950/20 border-2 border-rose-950/30 p-8 rounded-[32px] flex items-center gap-6 text-rose-455 shadow-lg shadow-rose-100">
+              <div className="bg-rose-100 p-3 rounded-2xl">
+                <AlertTriangle className="w-8 h-8 shrink-0" />
+              </div>
+              <p className="font-bold text-lg">{error}</p>
+            </motion.div>}
 
           {isLoading && !selectedDrug && suggestedDrugs.length === 0 && (

[NoCoverage] ObjectLiteral
components/GenericPharmacologyView.tsx:175:24
           {error && (
             <motion.div
               initial={{ opacity: 0, scale: 0.95 }}
-              animate={{ opacity: 1, scale: 1 }}
+              animate={{}}
               exit={{ opacity: 0, scale: 0.95 }}
               className="bg-rose-950/20 border-2 border-rose-950/30 p-8 rounded-[32px] flex items-center gap-6 text-rose-455 shadow-lg shadow-rose-100"

[NoCoverage] ObjectLiteral
components/GenericPharmacologyView.tsx:176:21
             <motion.div
               initial={{ opacity: 0, scale: 0.95 }}
               animate={{ opacity: 1, scale: 1 }}
-              exit={{ opacity: 0, scale: 0.95 }}
+              exit={{}}
               className="bg-rose-950/20 border-2 border-rose-950/30 p-8 rounded-[32px] flex items-center gap-6 text-rose-455 shadow-lg shadow-rose-100"
             >

[NoCoverage] EqualityOperator
components/GenericPharmacologyView.tsx:186:42
             </motion.div>
           )}
 
-          {isLoading && !selectedDrug && suggestedDrugs.length === 0 && (
+          {isLoading && !selectedDrug && suggestedDrugs.length !== 0 && (
             <motion.div
               initial={{ opacity: 0 }}

[NoCoverage] LogicalOperator
components/GenericPharmacologyView.tsx:186:12
             </motion.div>
           )}
 
-          {isLoading && !selectedDrug && suggestedDrugs.length === 0 && (
+          {isLoading && !selectedDrug || suggestedDrugs.length === 0 && (
             <motion.div
               initial={{ opacity: 0 }}

[NoCoverage] ObjectLiteral
components/GenericPharmacologyView.tsx:188:24
 
           {isLoading && !selectedDrug && suggestedDrugs.length === 0 && (
             <motion.div
-              initial={{ opacity: 0 }}
+              initial={{}}
               animate={{ opacity: 1 }}
               className="flex flex-col items-center justify-center py-32 text-slate-400"

[NoCoverage] ObjectLiteral
components/GenericPharmacologyView.tsx:189:24
           {isLoading && !selectedDrug && suggestedDrugs.length === 0 && (
             <motion.div
               initial={{ opacity: 0 }}
-              animate={{ opacity: 1 }}
+              animate={{}}
               className="flex flex-col items-center justify-center py-32 text-slate-400"
             >

[NoCoverage] ConditionalExpression
components/GenericPharmacologyView.tsx:202:12
             </motion.div>
           )}
 
-          {suggestedDrugs?.length > 0 && !selectedDrug && (
+          {true && (
             <motion.div
               initial={{ opacity: 0, y: 20 }}

[NoCoverage] ConditionalExpression
components/GenericPharmacologyView.tsx:202:12
             </motion.div>
           )}
 
-          {suggestedDrugs?.length > 0 && !selectedDrug && (
+          {true && !selectedDrug && (
             <motion.div
               initial={{ opacity: 0, y: 20 }}

[NoCoverage] ConditionalExpression
components/GenericPharmacologyView.tsx:216:19
               </h2>
 
               <div className="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-8">
-                {(suggestedDrugs || []).map((mapping, idx) => (
+                {(true).map((mapping, idx) => (
                   <motion.div
                     key={idx}

[NoCoverage] LogicalOperator
components/GenericPharmacologyView.tsx:216:19
               </h2>
 
               <div className="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-8">
-                {(suggestedDrugs || []).map((mapping, idx) => (
+                {(suggestedDrugs && []).map((mapping, idx) => (
                   <motion.div
                     key={idx}

[NoCoverage] UnaryOperator
components/GenericPharmacologyView.tsx:219:38
                 {(suggestedDrugs || []).map((mapping, idx) => (
                   <motion.div
                     key={idx}
-                    whileHover={{ y: -8, scale: 1.02 }}
+                    whileHover={{ y: +8, scale: 1.02 }}
                     className="bg-slate-950/40 border border-white/5 rounded-[40px] p-8 shadow-md hover:shadow-xl transition-all cursor-pointer group relative overflow-hidden"
                     onClick={() => handleSelectSuggestedDrug(mapping.drug_name)}

[NoCoverage] ArrowFunction
components/GenericPharmacologyView.tsx:221:30
                     key={idx}
                     whileHover={{ y: -8, scale: 1.02 }}
                     className="bg-slate-950/40 border border-white/5 rounded-[40px] p-8 shadow-md hover:shadow-xl transition-all cursor-pointer group relative overflow-hidden"
-                    onClick={() => handleSelectSuggestedDrug(mapping.drug_name)}
+                    onClick={() => undefined}
                   >
                     <div className="flex justify-between items-start mb-6">

[NoCoverage] EqualityOperator
components/GenericPharmacologyView.tsx:226:27
                     <div className="flex justify-between items-start mb-6">
                       <div
                         className={`px-4 py-1.5 rounded-xl text-[10px] font-black uppercase tracking-[0.2em] ${
-                          mapping.line_of_treatment === '1st line'
+                          mapping.line_of_treatment !== '1st line'
                             ? 'bg-emerald-100 text-emerald-400'
                             : mapping.line_of_treatment === '2nd line'

[NoCoverage] ConditionalExpression
components/GenericPharmacologyView.tsx:226:27
                     <div className="flex justify-between items-start mb-6">
                       <div
                         className={`px-4 py-1.5 rounded-xl text-[10px] font-black uppercase tracking-[0.2em] ${
-                          mapping.line_of_treatment === '1st line'
+                          false
                             ? 'bg-emerald-100 text-emerald-400'
                             : mapping.line_of_treatment === '2nd line'

[NoCoverage] ConditionalExpression
components/GenericPharmacologyView.tsx:228:31
                         className={`px-4 py-1.5 rounded-xl text-[10px] font-black uppercase tracking-[0.2em] ${
                           mapping.line_of_treatment === '1st line'
                             ? 'bg-emerald-100 text-emerald-400'
-                            : mapping.line_of_treatment === '2nd line'
+                            : false
                               ? 'bg-amber-100 text-amber-400'
                               : 'bg-slate-900 text-slate-400'

[NoCoverage] EqualityOperator
components/GenericPharmacologyView.tsx:228:31
                         className={`px-4 py-1.5 rounded-xl text-[10px] font-black uppercase tracking-[0.2em] ${
                           mapping.line_of_treatment === '1st line'
                             ? 'bg-emerald-100 text-emerald-400'
-                            : mapping.line_of_treatment === '2nd line'
+                            : mapping.line_of_treatment !== '2nd line'
                               ? 'bg-amber-100 text-amber-400'
                               : 'bg-slate-900 text-slate-400'

[NoCoverage] ConditionalExpression
components/GenericPharmacologyView.tsx:243:22
                     <p className="text-sm text-slate-400 font-bold mb-6 tracking-wide">
                       {mapping.therapeutic_class}
                     </p>
-                    {mapping.note && (
-                      <div className="relative pt-6 border-t border-white/5">
-                        <p className="text-sm text-slate-400 leading-relaxed italic font-medium">
-                          {mapping.note}
-                        </p>
-                      </div>
-                    )}
+                    {false}
                   </motion.div>
                 ))}

[NoCoverage] LogicalOperator
components/GenericPharmacologyView.tsx:243:22
                     <p className="text-sm text-slate-400 font-bold mb-6 tracking-wide">
                       {mapping.therapeutic_class}
                     </p>
-                    {mapping.note && (
-                      <div className="relative pt-6 border-t border-white/5">
-                        <p className="text-sm text-slate-400 leading-relaxed italic font-medium">
-                          {mapping.note}
-                        </p>
-                      </div>
-                    )}
+                    {mapping.note || <div className="relative pt-6 border-t border-white/5">
+                        <p className="text-sm text-slate-400 leading-relaxed italic font-medium">
+                          {mapping.note}
+                        </p>
+                      </div>}
                   </motion.div>
                 ))}

[NoCoverage] LogicalOperator
components/GenericPharmacologyView.tsx:273:22
                     <span className="bg-indigo-950/200 text-white px-6 py-2 rounded-2xl text-[10px] font-black uppercase tracking-[0.2em] shadow-lg shadow-indigo-500/20">
                       {selectedDrug.therapeuticClass}
                     </span>
-                    {selectedDrug.retrievedAt && (
-                      <span className="text-indigo-200/60 text-xs font-black uppercase tracking-widest flex items-center gap-2">
-                        <Clock className="w-4 h-4" /> Updated{' '}
-                        {new Date(selectedDrug.retrievedAt).toLocaleDateString()}
-                      </span>
-                    )}
+                    {selectedDrug.retrievedAt || <span className="text-indigo-200/60 text-xs font-black uppercase tracking-widest flex items-center gap-2">
+                        <Clock className="w-4 h-4" /> Updated{' '}
+                        {new Date(selectedDrug.retrievedAt).toLocaleDateString()}
+                      </span>}
                   </div>
 

[NoCoverage] ConditionalExpression
components/GenericPharmacologyView.tsx:273:22
                     <span className="bg-indigo-950/200 text-white px-6 py-2 rounded-2xl text-[10px] font-black uppercase tracking-[0.2em] shadow-lg shadow-indigo-500/20">
                       {selectedDrug.therapeuticClass}
                     </span>
-                    {selectedDrug.retrievedAt && (
-                      <span className="text-indigo-200/60 text-xs font-black uppercase tracking-widest flex items-center gap-2">
-                        <Clock className="w-4 h-4" /> Updated{' '}
-                        {new Date(selectedDrug.retrievedAt).toLocaleDateString()}
-                      </span>
-                    )}
+                    {true}
                   </div>
 

[NoCoverage] StringLiteral
components/GenericPharmacologyView.tsx:275:63
                     </span>
                     {selectedDrug.retrievedAt && (
                       <span className="text-indigo-200/60 text-xs font-black uppercase tracking-widest flex items-center gap-2">
-                        <Clock className="w-4 h-4" /> Updated{' '}
+                        <Clock className="w-4 h-4" /> Updated{""}
                         {new Date(selectedDrug.retrievedAt).toLocaleDateString()}
                       </span>
