[NoCoverage] ConditionalExpression
components/GlossaryLink.tsx:10:7
 }
 
 const GlossaryLink: React.FC<GlossaryLinkProps> = ({ text, onNavigate }) => {
-  if (!text) return null;
+  if (true) return null;
 
   // Sort terms by length descending to match longer terms first (e.g., "Pitting Edema" before "Edema")

[NoCoverage] ConditionalExpression
components/GlossaryLink.tsx:10:7
 }
 
 const GlossaryLink: React.FC<GlossaryLinkProps> = ({ text, onNavigate }) => {
-  if (!text) return null;
+  if (false) return null;
 
   // Sort terms by length descending to match longer terms first (e.g., "Pitting Edema" before "Edema")

[NoCoverage] ArrowFunction
components/GlossaryLink.tsx:13:47
   if (!text) return null;
 
   // Sort terms by length descending to match longer terms first (e.g., "Pitting Edema" before "Edema")
-  const sortedTerms = [...GLOSSARY_DATA].sort((a, b) => b.term.length - a.term.length);
+  const sortedTerms = [...GLOSSARY_DATA].sort(() => undefined);
 
   // Create a regex that matches any of the terms (case-insensitive)

[NoCoverage] MethodExpression
components/GlossaryLink.tsx:13:23
   if (!text) return null;
 
   // Sort terms by length descending to match longer terms first (e.g., "Pitting Edema" before "Edema")
-  const sortedTerms = [...GLOSSARY_DATA].sort((a, b) => b.term.length - a.term.length);
+  const sortedTerms = [...GLOSSARY_DATA];
 
   // Create a regex that matches any of the terms (case-insensitive)

[NoCoverage] ArrowFunction
components/GlossaryLink.tsx:18:28
   // Create a regex that matches any of the terms (case-insensitive)
   // We use word boundaries \b to avoid matching parts of words
   const termsRegex = new RegExp(
-    `\\b(${sortedTerms.map((t) => t.term.replace(/[.*+?^${}()|[\]\\]/g, '\\$&')).join('|')})\\b`,
+    `\\b(${sortedTerms.map(() => undefined).join('|')})\\b`,
     'gi'
   );

[NoCoverage] StringLiteral
components/GlossaryLink.tsx:19:5
   // We use word boundaries \b to avoid matching parts of words
   const termsRegex = new RegExp(
     `\\b(${sortedTerms.map((t) => t.term.replace(/[.*+?^${}()|[\]\\]/g, '\\$&')).join('|')})\\b`,
-    'gi'
+    ""
   );
 

[NoCoverage] ConditionalExpression
components/GlossaryLink.tsx:23:19
   );
 
   const parts = text.split(termsRegex);
-  const matches = text.match(termsRegex) || [];
+  const matches = true;
 
   let matchIndex = 0;

[NoCoverage] ConditionalExpression
components/GlossaryLink.tsx:23:19
   );
 
   const parts = text.split(termsRegex);
-  const matches = text.match(termsRegex) || [];
+  const matches = false;
 
   let matchIndex = 0;

[NoCoverage] BlockStatement
components/GlossaryLink.tsx:28:31
   let matchIndex = 0;
   return (
     <>
-      {parts.map((part, i) => {
-        // If this part matches one of our terms
-        if (i % 2 === 1) {
-          const term = matches[matchIndex++];
-          return (
-            <button
-              key={`glossary-btn-${i}-${term}`}
-              onClick={(e) => {
-                e.stopPropagation();
-                onNavigate(term);
-              }}
-              className="text-blue-600 hover:underline font-bold decoration-blue-300 underline-offset-2 transition-all"
-              title={`View definition for ${term}`}
-            >
-              {part}
-            </button>
-          );
-        }
-        return <span key={`glossary-text-${i}`}>{part}</span>;
-      })}
+      {parts.map((part, i) => {})}
     </>
   );

[NoCoverage] ArithmeticOperator
components/GlossaryLink.tsx:30:13
     <>
       {parts.map((part, i) => {
         // If this part matches one of our terms
-        if (i % 2 === 1) {
+        if (i * 2 === 1) {
           const term = matches[matchIndex++];
           return (

[NoCoverage] EqualityOperator
components/GlossaryLink.tsx:30:13
     <>
       {parts.map((part, i) => {
         // If this part matches one of our terms
-        if (i % 2 === 1) {
+        if (i % 2 !== 1) {
           const term = matches[matchIndex++];
           return (

[NoCoverage] UpdateOperator
components/GlossaryLink.tsx:31:32
       {parts.map((part, i) => {
         // If this part matches one of our terms
         if (i % 2 === 1) {
-          const term = matches[matchIndex++];
+          const term = matches[matchIndex--];
           return (
             <button

[NoCoverage] StringLiteral
components/GlossaryLink.tsx:34:20
           const term = matches[matchIndex++];
           return (
             <button
-              key={`glossary-btn-${i}-${term}`}
+              key={``}
               onClick={(e) => {
                 e.stopPropagation();

[NoCoverage] BlockStatement
components/GlossaryLink.tsx:35:31
           return (
             <button
               key={`glossary-btn-${i}-${term}`}
-              onClick={(e) => {
-                e.stopPropagation();
-                onNavigate(term);
-              }}
+              onClick={(e) => {}}
               className="text-blue-600 hover:underline font-bold decoration-blue-300 underline-offset-2 transition-all"
               title={`View definition for ${term}`}

[NoCoverage] StringLiteral
components/GlossaryLink.tsx:46:27
             </button>
           );
         }
-        return <span key={`glossary-text-${i}`}>{part}</span>;
+        return <span key={``}>{part}</span>;
       })}
     </>
