[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:7:3
 import { useClinicalSearch } from '../hooks/useClinicalSearch';
 
 const GLOSSARY_DATA: GlossaryEntry[] = [
-  {
-    term: 'Auscultation',
-    definition:
-      'The act of listening to sounds from the heart, lungs, or other organs, typically with a stethoscope, as a part of medical diagnosis.'
-  },
+  {},
   {
     term: 'Palpation',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:8:11
 
 const GLOSSARY_DATA: GlossaryEntry[] = [
   {
-    term: 'Auscultation',
+    term: "",
     definition:
       'The act of listening to sounds from the heart, lungs, or other organs, typically with a stethoscope, as a part of medical diagnosis.'

[NoCoverage] StringLiteral
components/GlossaryView.tsx:13:11
       'The act of listening to sounds from the heart, lungs, or other organs, typically with a stethoscope, as a part of medical diagnosis.'
   },
   {
-    term: 'Palpation',
+    term: "",
     definition:
       'A method of feeling with the fingers or hands during a physical examination to examine the size, consistency, texture, location, and tenderness of an organ or body part.'

[NoCoverage] StringLiteral
components/GlossaryView.tsx:20:7
   {
     term: 'Percussion',
     definition:
-      'A method of tapping on a surface to determine the underlying structure, and is used in clinical examinations to assess the condition of the thorax or abdomen.'
+      ""
   },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:23:11
       'A method of tapping on a surface to determine the underlying structure, and is used in clinical examinations to assess the condition of the thorax or abdomen.'
   },
   {
-    term: 'Inspection',
+    term: "",
     definition:
       'The visual examination of the patient to observe for any abnormalities, such as changes in color, shape, or movement.'

[NoCoverage] StringLiteral
components/GlossaryView.tsx:25:7
   {
     term: 'Inspection',
     definition:
-      'The visual examination of the patient to observe for any abnormalities, such as changes in color, shape, or movement.'
+      ""
   },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:30:7
   {
     term: 'Cyanosis',
     definition:
-      'A bluish discoloration of the skin and mucous membranes resulting from inadequate oxygenation of the blood.'
+      ""
   },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:43:11
       'A yellowing of the skin and the whites of the eyes caused by an accumulation of bile pigment (bilirubin) in the blood.'
   },
   {
-    term: 'Ascites',
+    term: "",
     definition: 'The accumulation of fluid in the peritoneal cavity, causing abdominal swelling.'
   },

[NoCoverage] StringLiteral
components/GlossaryView.tsx:46:39
     term: 'Ascites',
     definition: 'The accumulation of fluid in the peritoneal cavity, causing abdominal swelling.'
   },
-  { term: 'Splenomegaly', definition: 'Abnormal enlargement of the spleen.' },
+  { term: 'Splenomegaly', definition: "" },
   { term: 'Hepatomegaly', definition: 'Abnormal enlargement of the liver.' },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:47:3
     definition: 'The accumulation of fluid in the peritoneal cavity, causing abdominal swelling.'
   },
   { term: 'Splenomegaly', definition: 'Abnormal enlargement of the spleen.' },
-  { term: 'Hepatomegaly', definition: 'Abnormal enlargement of the liver.' },
+  {},
   {
     term: 'Lymphadenopathy',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:50:17
   { term: 'Hepatomegaly', definition: 'Abnormal enlargement of the liver.' },
   {
     term: 'Lymphadenopathy',
-    definition: 'A disease affecting the lymph nodes, which often become enlarged or swollen.'
+    definition: ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:52:3
     term: 'Lymphadenopathy',
     definition: 'A disease affecting the lymph nodes, which often become enlarged or swollen.'
   },
-  {
-    term: 'Murmur',
-    definition:
-      'An extra or unusual sound heard during a heartbeat, sometimes sounding like a whooshing or swishing noise.'
-  },
+  {},
   {
     term: 'Crepitations',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:53:11
     definition: 'A disease affecting the lymph nodes, which often become enlarged or swollen.'
   },
   {
-    term: 'Murmur',
+    term: "",
     definition:
       'An extra or unusual sound heard during a heartbeat, sometimes sounding like a whooshing or swishing noise.'

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:57:3
     definition:
       'An extra or unusual sound heard during a heartbeat, sometimes sounding like a whooshing or swishing noise.'
   },
-  {
-    term: 'Crepitations',
-    definition:
-      'Crackling or rattling sounds heard during auscultation of the lungs, often indicating fluid in the alveoli.'
-  },
+  {},
   {
     term: 'Wheeze',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:60:7
   {
     term: 'Crepitations',
     definition:
-      'Crackling or rattling sounds heard during auscultation of the lungs, often indicating fluid in the alveoli.'
+      ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:62:3
     definition:
       'Crackling or rattling sounds heard during auscultation of the lungs, often indicating fluid in the alveoli.'
   },
-  {
-    term: 'Wheeze',
-    definition:
-      'A continuous, coarse, whistling sound produced in the respiratory airways during breathing.'
-  },
+  {},
   {
     term: 'Bruit',

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:72:3
     definition:
       'An abnormal sound, usually a blowing or swishing noise, heard through a stethoscope over an artery or organ.'
   },
-  {
-    term: 'Pitting Edema',
-    definition:
-      'Swelling where a finger press leaves an indentation that persists for some time after the pressure is removed.'
-  },
+  {},
   {
     term: 'Tachycardia',

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:77:3
     definition:
       'Swelling where a finger press leaves an indentation that persists for some time after the pressure is removed.'
   },
-  {
-    term: 'Tachycardia',
-    definition: 'An abnormally rapid heart rate, typically over 100 beats per minute at rest.'
-  },
+  {},
   {
     term: 'Bradycardia',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:78:11
       'Swelling where a finger press leaves an indentation that persists for some time after the pressure is removed.'
   },
   {
-    term: 'Tachycardia',
+    term: "",
     definition: 'An abnormally rapid heart rate, typically over 100 beats per minute at rest.'
   },

[NoCoverage] StringLiteral
components/GlossaryView.tsx:82:11
     definition: 'An abnormally rapid heart rate, typically over 100 beats per minute at rest.'
   },
   {
-    term: 'Bradycardia',
+    term: "",
     definition: 'An abnormally slow heart rate, typically under 60 beats per minute at rest.'
   },

[NoCoverage] StringLiteral
components/GlossaryView.tsx:85:34
     term: 'Bradycardia',
     definition: 'An abnormally slow heart rate, typically under 60 beats per minute at rest.'
   },
-  { term: 'Dyspnea', definition: 'Difficult or labored breathing; shortness of breath.' },
+  { term: 'Dyspnea', definition: "" },
   {
     term: 'Orthopnea',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:87:11
   },
   { term: 'Dyspnea', definition: 'Difficult or labored breathing; shortness of breath.' },
   {
-    term: 'Orthopnea',
+    term: "",
     definition:
       'Shortness of breath that occurs when lying flat, causing the person to have to sleep propped up in bed or sitting in a chair.'

[NoCoverage] StringLiteral
components/GlossaryView.tsx:92:11
       'Shortness of breath that occurs when lying flat, causing the person to have to sleep propped up in bed or sitting in a chair.'
   },
   {
-    term: 'Hemoptysis',
+    term: "",
     definition:
       'The coughing up of blood or blood-stained mucus from the bronchi, larynx, trachea, or lungs.'

[NoCoverage] StringLiteral
components/GlossaryView.tsx:94:7
   {
     term: 'Hemoptysis',
     definition:
-      'The coughing up of blood or blood-stained mucus from the bronchi, larynx, trachea, or lungs.'
+      ""
   },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:99:7
   {
     term: 'Melena',
     definition:
-      'Dark sticky feces containing partly digested blood, typically following internal bleeding or the swallowing of blood.'
+      ""
   },
   { term: 'Hematemesis', definition: 'The vomiting of blood.' },

[NoCoverage] StringLiteral
components/GlossaryView.tsx:101:38
     definition:
       'Dark sticky feces containing partly digested blood, typically following internal bleeding or the swallowing of blood.'
   },
-  { term: 'Hematemesis', definition: 'The vomiting of blood.' },
+  { term: 'Hematemesis', definition: "" },
   {
     term: 'Syncope',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:104:17
   { term: 'Hematemesis', definition: 'The vomiting of blood.' },
   {
     term: 'Syncope',
-    definition: 'Temporary loss of consciousness caused by a fall in blood pressure; fainting.'
+    definition: ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:106:3
     term: 'Syncope',
     definition: 'Temporary loss of consciousness caused by a fall in blood pressure; fainting.'
   },
-  {
-    term: 'Ataxia',
-    definition:
-      'The loss of full control of bodily movements, often resulting in a lack of coordination.'
-  },
+  {},
   { term: 'Nystagmus', definition: 'Rapid involuntary movements of the eyes.' },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:111:3
     definition:
       'The loss of full control of bodily movements, often resulting in a lack of coordination.'
   },
-  { term: 'Nystagmus', definition: 'Rapid involuntary movements of the eyes.' },
+  {},
   {
     term: 'Proprioception',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:115:7
   {
     term: 'Proprioception',
     definition:
-      'The sense of the relative position of neighboring parts of the body and strength of effort being employed in movement.'
+      ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:117:3
     definition:
       'The sense of the relative position of neighboring parts of the body and strength of effort being employed in movement.'
   },
-  {
-    term: 'Stridor',
-    definition:
-      'A harsh or grating sound when breathing, caused by obstruction of the windpipe or larynx.'
-  },
+  {},
   {
     term: 'Tremor',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:118:11
       'The sense of the relative position of neighboring parts of the body and strength of effort being employed in movement.'
   },
   {
-    term: 'Stridor',
+    term: "",
     definition:
       'A harsh or grating sound when breathing, caused by obstruction of the windpipe or larynx.'

[NoCoverage] StringLiteral
components/GlossaryView.tsx:120:7
   {
     term: 'Stridor',
     definition:
-      'A harsh or grating sound when breathing, caused by obstruction of the windpipe or larynx.'
+      ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:127:3
     definition:
       'An involuntary, somewhat rhythmic, muscle contraction and relaxation involving oscillations or twitching movements of one or more body parts.'
   },
-  {
-    term: 'Fasciculation',
-    definition:
-      'A brief, spontaneous contraction affecting a small number of muscle fibers, often causing a flicker of movement under the skin.'
-  },
+  {},
   { term: 'Hyperreflexia', definition: 'Overactive or overresponsive reflexes.' },
   { term: 'Hyporeflexia', definition: 'Below normal or absent reflexes.' },

[NoCoverage] StringLiteral
components/GlossaryView.tsx:132:11
     definition:
       'A brief, spontaneous contraction affecting a small number of muscle fibers, often causing a flicker of movement under the skin.'
   },
-  { term: 'Hyperreflexia', definition: 'Overactive or overresponsive reflexes.' },
+  { term: "", definition: 'Overactive or overresponsive reflexes.' },
   { term: 'Hyporeflexia', definition: 'Below normal or absent reflexes.' },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:132:40
     definition:
       'A brief, spontaneous contraction affecting a small number of muscle fibers, often causing a flicker of movement under the skin.'
   },
-  { term: 'Hyperreflexia', definition: 'Overactive or overresponsive reflexes.' },
+  { term: 'Hyperreflexia', definition: "" },
   { term: 'Hyporeflexia', definition: 'Below normal or absent reflexes.' },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:133:3
       'A brief, spontaneous contraction affecting a small number of muscle fibers, often causing a flicker of movement under the skin.'
   },
   { term: 'Hyperreflexia', definition: 'Overactive or overresponsive reflexes.' },
-  { term: 'Hyporeflexia', definition: 'Below normal or absent reflexes.' },
+  {},
   {
     term: 'Babinski Sign',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:137:7
   {
     term: 'Babinski Sign',
     definition:
-      'An upward response (extension) of the big toe when the sole of the foot is stimulated, indicating damage to the central nervous system.'
+      ""
   },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:142:7
   {
     term: 'Romberg Test',
     definition:
-      'A test used in an exam of neurological function for balance, and also as a test for drunken driving.'
+      ""
   },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:149:36
     definition: 'Excessive outward curvature of the spine, causing hunching of the back.'
   },
   { term: 'Lordosis', definition: 'Excessive inward curvature of the spine.' },
-  { term: 'Scoliosis', definition: 'Abnormal lateral curvature of the spine.' },
+  { term: 'Scoliosis', definition: "" },
   { term: 'Pruritus', definition: 'Severe itching of the skin, as a symptom of various ailments.' },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:149:3
     definition: 'Excessive outward curvature of the spine, causing hunching of the back.'
   },
   { term: 'Lordosis', definition: 'Excessive inward curvature of the spine.' },
-  { term: 'Scoliosis', definition: 'Abnormal lateral curvature of the spine.' },
+  {},
   { term: 'Pruritus', definition: 'Severe itching of the skin, as a symptom of various ailments.' },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:151:3
   { term: 'Lordosis', definition: 'Excessive inward curvature of the spine.' },
   { term: 'Scoliosis', definition: 'Abnormal lateral curvature of the spine.' },
   { term: 'Pruritus', definition: 'Severe itching of the skin, as a symptom of various ailments.' },
-  {
-    term: 'Erythema',
-    definition:
-      'Superficial reddening of the skin, usually in patches, as a result of injury or irritation causing dilatation of the blood capillaries.'
-  },
+  {},
   { term: 'Petechiae', definition: 'Small red or purple spots caused by bleeding into the skin.' },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:154:7
   {
     term: 'Erythema',
     definition:
-      'Superficial reddening of the skin, usually in patches, as a result of injury or irritation causing dilatation of the blood capillaries.'
+      ""
   },
   { term: 'Petechiae', definition: 'Small red or purple spots caused by bleeding into the skin.' },

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:167:3
     definition:
       'A discoloration of the skin resulting from bleeding underneath, typically caused by bruising.'
   },
-  {
-    term: 'Xanthelasma',
-    definition:
-      'A sharply demarcated yellowish deposit of fat underneath the skin around the eyelids.'
-  },
+  {},
   {
     term: 'Koilonychia',

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:172:3
     definition:
       'A sharply demarcated yellowish deposit of fat underneath the skin around the eyelids.'
   },
-  {
-    term: 'Koilonychia',
-    definition: 'Spoon-shaped nails, often a sign of iron-deficiency anemia.'
-  },
+  {},
   { term: 'Leukonychia', definition: 'White spots or lines on the fingernails or toenails.' },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:176:38
     term: 'Koilonychia',
     definition: 'Spoon-shaped nails, often a sign of iron-deficiency anemia.'
   },
-  { term: 'Leukonychia', definition: 'White spots or lines on the fingernails or toenails.' },
+  { term: 'Leukonychia', definition: "" },
   {
     term: 'Spider Naevi',

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:177:3
     definition: 'Spoon-shaped nails, often a sign of iron-deficiency anemia.'
   },
   { term: 'Leukonychia', definition: 'White spots or lines on the fingernails or toenails.' },
-  {
-    term: 'Spider Naevi',
-    definition:
-      "A type of telangiectasia found slightly beneath the skin surface, often containing a central red spot and reddish extensions which radiate outwards like a spider's web."
-  },
+  {},
   {
     term: 'Palmar Erythema',

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:182:3
     definition:
       "A type of telangiectasia found slightly beneath the skin surface, often containing a central red spot and reddish extensions which radiate outwards like a spider's web."
   },
-  {
-    term: 'Palmar Erythema',
-    definition:
-      'Reddening of the palms of the hands, often associated with liver disease or pregnancy.'
-  },
+  {},
   {
     term: "Dupuytren's Contracture",

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:187:3
     definition:
       'Reddening of the palms of the hands, often associated with liver disease or pregnancy.'
   },
-  {
-    term: "Dupuytren's Contracture",
-    definition:
-      'A condition in which one or more fingers become permanently bent in a flexed position.'
-  },
+  {},
   {
     term: 'Asterixis',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:188:11
       'Reddening of the palms of the hands, often associated with liver disease or pregnancy.'
   },
   {
-    term: "Dupuytren's Contracture",
+    term: "",
     definition:
       'A condition in which one or more fingers become permanently bent in a flexed position.'

[NoCoverage] StringLiteral
components/GlossaryView.tsx:190:7
   {
     term: "Dupuytren's Contracture",
     definition:
-      'A condition in which one or more fingers become permanently bent in a flexed position.'
+      ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:192:3
     definition:
       'A condition in which one or more fingers become permanently bent in a flexed position.'
   },
-  {
-    term: 'Asterixis',
-    definition:
-      'A tremor of the hand when the wrist is extended, sometimes said to resemble a bird flapping its wings; often associated with hepatic encephalopathy.'
-  },
+  {},
   {
     term: 'Caput Medusae',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:193:11
       'A condition in which one or more fingers become permanently bent in a flexed position.'
   },
   {
-    term: 'Asterixis',
+    term: "",
     definition:
       'A tremor of the hand when the wrist is extended, sometimes said to resemble a bird flapping its wings; often associated with hepatic encephalopathy.'

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:207:3
     definition:
       "A sign of gallbladder disease (cholecystitis) consisting of pain on taking a deep breath when the examiner's fingers are on the approximate location of the gallbladder."
   },
-  {
-    term: "McBurney's Point",
-    definition:
-      'A point on the right side of the abdomen, about two-thirds of the distance between the umbilicus and the anterior superior iliac spine, where tenderness is a sign of appendicitis.'
-  },
+  {},
   {
     term: "Rovsing's Sign",

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:212:3
     definition:
       'A point on the right side of the abdomen, about two-thirds of the distance between the umbilicus and the anterior superior iliac spine, where tenderness is a sign of appendicitis.'
   },
-  {
-    term: "Rovsing's Sign",
-    definition:
-      "A sign of appendicitis; if palpation of the left lower quadrant of a person's abdomen increases the pain felt in the right lower quadrant."
-  },
+  {},
   {
     term: 'Rebound Tenderness',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:232:11
     definition: 'Involuntary stiffness of the abdominal muscles, indicating peritonitis.'
   },
   {
-    term: 'Bruit',
+    term: "",
     definition:
       'An abnormal sound, usually a blowing or swishing noise, heard through a stethoscope over an artery or organ.'

[NoCoverage] StringLiteral
components/GlossaryView.tsx:237:11
       'An abnormal sound, usually a blowing or swishing noise, heard through a stethoscope over an artery or organ.'
   },
   {
-    term: 'Thrill',
+    term: "",
     definition: 'A vibratory sensation felt on the skin overlying an area of turbulent blood flow.'
   },

[NoCoverage] StringLiteral
components/GlossaryView.tsx:238:17
   },
   {
     term: 'Thrill',
-    definition: 'A vibratory sensation felt on the skin overlying an area of turbulent blood flow.'
+    definition: ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:240:3
     term: 'Thrill',
     definition: 'A vibratory sensation felt on the skin overlying an area of turbulent blood flow.'
   },
-  {
-    term: 'Heave',
-    definition:
-      'A palpable lifting sensation felt over the precordium, indicating ventricular hypertrophy.'
-  },
+  {},
   {
     term: 'Apex Beat',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:243:7
   {
     term: 'Heave',
     definition:
-      'A palpable lifting sensation felt over the precordium, indicating ventricular hypertrophy.'
+      ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:245:3
     definition:
       'A palpable lifting sensation felt over the precordium, indicating ventricular hypertrophy.'
   },
-  {
-    term: 'Apex Beat',
-    definition:
-      'The furthermost point outwards and downwards from the sternum at which the cardiac impulse can be felt.'
-  },
+  {},
   {
     term: 'Jugular Venous Pressure (JVP)',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:248:7
   {
     term: 'Apex Beat',
     definition:
-      'The furthermost point outwards and downwards from the sternum at which the cardiac impulse can be felt.'
+      ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:255:3
     definition:
       'The indirectly observed pressure over the venous system via visualization of the internal jugular vein.'
   },
-  {
-    term: 'Hepatojugular Reflux',
-    definition:
-      'The distension of the neck veins precipitated by the maneuver of firm pressure over the liver.'
-  },
+  {},
   {
     term: 'Pulsus Paradoxus',

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:260:3
     definition:
       'The distension of the neck veins precipitated by the maneuver of firm pressure over the liver.'
   },
-  {
-    term: 'Pulsus Paradoxus',
-    definition:
-      'An abnormally large decrease in systolic blood pressure and pulse wave amplitude during inspiration.'
-  },
+  {},
   {
     term: 'Water-hammer Pulse',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:261:11
       'The distension of the neck veins precipitated by the maneuver of firm pressure over the liver.'
   },
   {
-    term: 'Pulsus Paradoxus',
+    term: "",
     definition:
       'An abnormally large decrease in systolic blood pressure and pulse wave amplitude during inspiration.'

[NoCoverage] StringLiteral
components/GlossaryView.tsx:268:7
   {
     term: 'Water-hammer Pulse',
     definition:
-      'A pulse that is bounding and forceful, rapidly increasing and then collapsing, as occurs in aortic regurgitation.'
+      ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:275:3
     definition:
       'A clinical sign in which there is a forceful distension and collapse of the carotid arteries.'
   },
-  {
-    term: "Quincke's Sign",
-    definition: 'Capillary pulsations in the fingernails, often seen in aortic regurgitation.'
-  },
+  {},
   {
     term: "Duroziez's Sign",

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:279:3
     term: "Quincke's Sign",
     definition: 'Capillary pulsations in the fingernails, often seen in aortic regurgitation.'
   },
-  {
-    term: "Duroziez's Sign",
-    definition:
-      'A systolic and diastolic bruit heard over the femoral artery when it is compressed with a stethoscope.'
-  },
+  {},
   {
     term: "Traube's Sign",

[NoCoverage] StringLiteral
components/GlossaryView.tsx:289:11
     definition: 'A booming "pistol-shot" sound heard over the femoral artery.'
   },
   {
-    term: "De Musset's Sign",
+    term: "",
     definition:
       'A condition in which there is rhythmic nodding or bobbing of the head in synchrony with the beating of the heart, seen in aortic regurgitation.'

[NoCoverage] StringLiteral
components/GlossaryView.tsx:291:7
   {
     term: "De Musset's Sign",
     definition:
-      'A condition in which there is rhythmic nodding or bobbing of the head in synchrony with the beating of the heart, seen in aortic regurgitation.'
+      ""
   },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:296:7
   {
     term: 'Graham Steell Murmur',
     definition:
-      'An early diastolic murmur heard at the left sternal border, indicating pulmonary regurgitation.'
+      ""
   },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:299:11
       'An early diastolic murmur heard at the left sternal border, indicating pulmonary regurgitation.'
   },
   {
-    term: 'Austin Flint Murmur',
+    term: "",
     definition: 'A low-pitched rumbling diastolic murmur heard at the apex in aortic regurgitation.'
   },

[NoCoverage] StringLiteral
components/GlossaryView.tsx:300:17
   },
   {
     term: 'Austin Flint Murmur',
-    definition: 'A low-pitched rumbling diastolic murmur heard at the apex in aortic regurgitation.'
+    definition: ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:302:3
     term: 'Austin Flint Murmur',
     definition: 'A low-pitched rumbling diastolic murmur heard at the apex in aortic regurgitation.'
   },
-  {
-    term: "Carvallo's Sign",
-    definition:
-      'A clinical sign found in patients with tricuspid regurgitation; the pansystolic murmur becomes louder during inspiration.'
-  },
+  {},
   {
     term: "Kussmaul's Sign",

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:307:3
     definition:
       'A clinical sign found in patients with tricuspid regurgitation; the pansystolic murmur becomes louder during inspiration.'
   },
-  {
-    term: "Kussmaul's Sign",
-    definition:
-      'A paradoxical rise in jugular venous pressure (JVP) on inspiration, or a failure in the appropriate fall of the JVP with inspiration.'
-  },
+  {},
   {
     term: "Friedreich's Sign",

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:312:3
     definition:
       'A paradoxical rise in jugular venous pressure (JVP) on inspiration, or a failure in the appropriate fall of the JVP with inspiration.'
   },
-  {
-    term: "Friedreich's Sign",
-    definition:
-      'A rapid fall and rise in the JVP (the "y" descent), seen in constrictive pericarditis.'
-  },
+  {},
   {
     term: "Beck's Triad",

[NoCoverage] StringLiteral
components/GlossaryView.tsx:313:11
       'A paradoxical rise in jugular venous pressure (JVP) on inspiration, or a failure in the appropriate fall of the JVP with inspiration.'
   },
   {
-    term: "Friedreich's Sign",
+    term: "",
     definition:
       'A rapid fall and rise in the JVP (the "y" descent), seen in constrictive pericarditis.'

[NoCoverage] StringLiteral
components/GlossaryView.tsx:315:7
   {
     term: "Friedreich's Sign",
     definition:
-      'A rapid fall and rise in the JVP (the "y" descent), seen in constrictive pericarditis.'
+      ""
   },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:323:11
       'A collection of three medical signs associated with cardiac tamponade: low blood pressure, muffled heart sounds, and raised JVP.'
   },
   {
-    term: 'Pulsus Alternans',
+    term: "",
     definition:
       'A physical finding with arterial pulse waveform showing alternating strong and weak beats.'

[NoCoverage] StringLiteral
components/GlossaryView.tsx:330:7
   {
     term: 'Pulsus Bisferiens',
     definition:
-      'A physical finding with two systolic peaks per cardiac cycle, seen in aortic regurgitation and hypertrophic cardiomyopathy.'
+      ""
   },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:337:11
     definition: 'A pulse that is slow to rise and small in amplitude, seen in aortic stenosis.'
   },
   {
-    term: 'Gallop Rhythm',
+    term: "",
     definition:
       'The presence of a third (S3) or fourth (S4) heart sound, creating a rhythm reminiscent of a galloping horse.'

[NoCoverage] StringLiteral
components/GlossaryView.tsx:339:7
   {
     term: 'Gallop Rhythm',
     definition:
-      'The presence of a third (S3) or fourth (S4) heart sound, creating a rhythm reminiscent of a galloping horse.'
+      ""
   },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:347:11
       'The sound produced when both S3 and S4 are present and occur simultaneously during tachycardia.'
   },
   {
-    term: 'Opening Snap',
+    term: "",
     definition:
       'A high-pitched diastolic sound heard in mitral stenosis, caused by the sudden opening of the stenotic mitral valve.'
