[NoCoverage] StringLiteral
components/GlossaryView.tsx:349:7
   {
     term: 'Opening Snap',
     definition:
-      'A high-pitched diastolic sound heard in mitral stenosis, caused by the sudden opening of the stenotic mitral valve.'
+      ""
   },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:354:7
   {
     term: 'Ejection Click',
     definition:
-      'A high-pitched systolic sound heard in aortic or pulmonary stenosis, caused by the sudden opening of the semilunar valves.'
+      ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:356:3
     definition:
       'A high-pitched systolic sound heard in aortic or pulmonary stenosis, caused by the sudden opening of the semilunar valves.'
   },
-  {
-    term: 'Mid-systolic Click',
-    definition:
-      'A high-pitched sound heard in mitral valve prolapse, often followed by a late systolic murmur.'
-  },
+  {},
   {
     term: 'Pericardial Friction Rub',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:359:7
   {
     term: 'Mid-systolic Click',
     definition:
-      'A high-pitched sound heard in mitral valve prolapse, often followed by a late systolic murmur.'
+      ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:361:3
     definition:
       'A high-pitched sound heard in mitral valve prolapse, often followed by a late systolic murmur.'
   },
-  {
-    term: 'Pericardial Friction Rub',
-    definition: 'A scratchy, high-pitched sound heard on auscultation, indicating pericarditis.'
-  },
+  {},
   {
     term: 'Pericardial Knock',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:362:11
       'A high-pitched sound heard in mitral valve prolapse, often followed by a late systolic murmur.'
   },
   {
-    term: 'Pericardial Friction Rub',
+    term: "",
     definition: 'A scratchy, high-pitched sound heard on auscultation, indicating pericarditis.'
   },

[NoCoverage] StringLiteral
components/GlossaryView.tsx:363:17
   },
   {
     term: 'Pericardial Friction Rub',
-    definition: 'A scratchy, high-pitched sound heard on auscultation, indicating pericarditis.'
+    definition: ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:365:3
     term: 'Pericardial Friction Rub',
     definition: 'A scratchy, high-pitched sound heard on auscultation, indicating pericarditis.'
   },
-  {
-    term: 'Pericardial Knock',
-    definition:
-      'A high-pitched diastolic sound heard in constrictive pericarditis, occurring slightly earlier than an S3.'
-  },
+  {},
   {
     term: "Hamman's Sign",

[NoCoverage] StringLiteral
components/GlossaryView.tsx:368:7
   {
     term: 'Pericardial Knock',
     definition:
-      'A high-pitched diastolic sound heard in constrictive pericarditis, occurring slightly earlier than an S3.'
+      ""
   },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:373:7
   {
     term: "Hamman's Sign",
     definition:
-      'A crunching sound heard over the precordium in synchrony with the heartbeat, indicating pneumomediastinum.'
+      ""
   },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:376:11
       'A crunching sound heard over the precordium in synchrony with the heartbeat, indicating pneumomediastinum.'
   },
   {
-    term: 'Tactile Vocal Fremitus',
+    term: "",
     definition: "The vibration felt by a hand placed on a patient's chest while the patient speaks."
   },

[NoCoverage] StringLiteral
components/GlossaryView.tsx:377:17
   },
   {
     term: 'Tactile Vocal Fremitus',
-    definition: "The vibration felt by a hand placed on a patient's chest while the patient speaks."
+    definition: ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:384:3
     definition:
       "The sound heard through a stethoscope placed on a patient's chest while the patient speaks."
   },
-  {
-    term: 'Bronchophony',
-    definition: 'The abnormal transmission of sounds from the lungs or bony ridges of the body.'
-  },
+  {},
   {
     term: 'Egophony',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:389:11
     definition: 'The abnormal transmission of sounds from the lungs or bony ridges of the body.'
   },
   {
-    term: 'Egophony',
+    term: "",
     definition:
       'An increased resonance of voice sounds heard when auscultating the lungs, often described as having a nasal or bleating quality.'

[NoCoverage] StringLiteral
components/GlossaryView.tsx:394:11
       'An increased resonance of voice sounds heard when auscultating the lungs, often described as having a nasal or bleating quality.'
   },
   {
-    term: 'Whispered Pectoriloquy',
+    term: "",
     definition:
       'The increased loudness of whispering heard through a stethoscope on the lung fields.'

[NoCoverage] StringLiteral
components/GlossaryView.tsx:396:7
   {
     term: 'Whispered Pectoriloquy',
     definition:
-      'The increased loudness of whispering heard through a stethoscope on the lung fields.'
+      ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:398:3
     definition:
       'The increased loudness of whispering heard through a stethoscope on the lung fields.'
   },
-  {
-    term: 'Tracheal Tug',
-    definition:
-      'An abnormal downward movement of the trachea during inspiration, seen in severe respiratory distress or aortic aneurysm.'
-  },
+  {},
   {
     term: 'Pectus Excavatum',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:401:7
   {
     term: 'Tracheal Tug',
     definition:
-      'An abnormal downward movement of the trachea during inspiration, seen in severe respiratory distress or aortic aneurysm.'
+      ""
   },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:405:17
   },
   {
     term: 'Pectus Excavatum',
-    definition: 'A condition in which the breastbone is sunken into the chest.'
+    definition: ""
   },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:409:17
   },
   {
     term: 'Pectus Carinatum',
-    definition: 'A condition in which the breastbone protrudes from the chest.'
+    definition: ""
   },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:414:7
   {
     term: 'Barrel Chest',
     definition:
-      'A large, rounded thorax, often seen in patients with chronic obstructive pulmonary disease (COPD).'
+      ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:421:3
     definition:
       'A horizontal groove along the lower border of the thorax corresponding to the costal insertion of the diaphragm.'
   },
-  {
-    term: "Hoover's Sign",
-    definition:
-      'The inward movement of the lower rib cage during inspiration, indicating a flat diaphragm as seen in COPD.'
-  },
+  {},
   {
     term: "Pemberton's Sign",

[NoCoverage] StringLiteral
components/GlossaryView.tsx:427:11
       'The inward movement of the lower rib cage during inspiration, indicating a flat diaphragm as seen in COPD.'
   },
   {
-    term: "Pemberton's Sign",
+    term: "",
     definition:
       'Facial flushing and neck vein distension when the patient raises both arms above their head, indicating superior vena cava syndrome.'

[NoCoverage] StringLiteral
components/GlossaryView.tsx:429:7
   {
     term: "Pemberton's Sign",
     definition:
-      'Facial flushing and neck vein distension when the patient raises both arms above their head, indicating superior vena cava syndrome.'
+      ""
   },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:434:7
   {
     term: "Trousseau's Sign",
     definition:
-      'A sign of hypocalcemia; carpal spasm induced by inflating a blood pressure cuff above systolic pressure.'
+      ""
   },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:441:11
     definition:
       'A sign of hypocalcemia; twitching of the facial muscles in response to tapping over the facial nerve.'
   },
-  { term: 'Exophthalmos', definition: 'Protrusion of the eyeball from the orbit.' },
+  { term: "", definition: 'Protrusion of the eyeball from the orbit.' },
   {
     term: 'Lid Lag',

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:442:3
       'A sign of hypocalcemia; twitching of the facial muscles in response to tapping over the facial nerve.'
   },
   { term: 'Exophthalmos', definition: 'Protrusion of the eyeball from the orbit.' },
-  {
-    term: 'Lid Lag',
-    definition: 'The failure of the upper eyelid to follow the downward movement of the eyeball.'
-  },
+  {},
   {
     term: 'Pretibial Myxedema',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:443:11
   },
   { term: 'Exophthalmos', definition: 'Protrusion of the eyeball from the orbit.' },
   {
-    term: 'Lid Lag',
+    term: "",
     definition: 'The failure of the upper eyelid to follow the downward movement of the eyeball.'
   },

[NoCoverage] StringLiteral
components/GlossaryView.tsx:451:11
     definition: "Thickening of the skin over the shins, often seen in Graves' disease."
   },
   {
-    term: 'Acanthosis Nigricans',
+    term: "",
     definition:
       'A skin condition characterized by areas of dark, velvety discoloration in body folds and creases.'

[NoCoverage] StringLiteral
components/GlossaryView.tsx:453:7
   {
     term: 'Acanthosis Nigricans',
     definition:
-      'A skin condition characterized by areas of dark, velvety discoloration in body folds and creases.'
+      ""
   },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:456:11
       'A skin condition characterized by areas of dark, velvety discoloration in body folds and creases.'
   },
   {
-    term: 'Hirsutism',
+    term: "",
     definition: 'Excessive body hair in parts of the body where hair is normally absent or minimal.'
   },

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:464:3
     definition: "Enlargement of a man's breasts, usually due to hormone imbalance."
   },
   { term: 'Striae', definition: 'Stretch marks; linear marks, ridges, or grooves on the skin.' },
-  {
-    term: 'Moon Facies',
-    definition:
-      'A medical sign where the face develops a rounded appearance due to fat deposits on the sides of the face.'
-  },
+  {},
   { term: 'Buffalo Hump', definition: 'A hump of fat on the back of the neck and upper back.' },
   {

[NoCoverage] StringLiteral
components/GlossaryView.tsx:469:11
     definition:
       'A medical sign where the face develops a rounded appearance due to fat deposits on the sides of the face.'
   },
-  { term: 'Buffalo Hump', definition: 'A hump of fat on the back of the neck and upper back.' },
+  { term: "", definition: 'A hump of fat on the back of the neck and upper back.' },
   {
     term: 'Proximal Myopathy',

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:470:3
       'A medical sign where the face develops a rounded appearance due to fat deposits on the sides of the face.'
   },
   { term: 'Buffalo Hump', definition: 'A hump of fat on the back of the neck and upper back.' },
-  {
-    term: 'Proximal Myopathy',
-    definition:
-      'Weakness of the muscles closest to the center of the body, such as the shoulders and hips.'
-  },
+  {},
   {
     term: 'Trendelenburg Sign',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:477:17
   },
   {
     term: 'Trendelenburg Sign',
-    definition: 'A sign of hip abductor weakness; the pelvis drops on the side of the lifted leg.'
+    definition: ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:479:3
     term: 'Trendelenburg Sign',
     definition: 'A sign of hip abductor weakness; the pelvis drops on the side of the lifted leg.'
   },
-  {
-    term: 'Antalgic Gait',
-    definition: 'A limp adopted to avoid pain on weight-bearing structures.'
-  },
+  {},
   {
     term: 'Ataxic Gait',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:480:11
     definition: 'A sign of hip abductor weakness; the pelvis drops on the side of the lifted leg.'
   },
   {
-    term: 'Antalgic Gait',
+    term: "",
     definition: 'A limp adopted to avoid pain on weight-bearing structures.'
   },

[NoCoverage] StringLiteral
components/GlossaryView.tsx:485:17
   },
   {
     term: 'Ataxic Gait',
-    definition: 'An unsteady, uncoordinated walk, with a wide base and the feet thrown out.'
+    definition: ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:487:3
     term: 'Ataxic Gait',
     definition: 'An unsteady, uncoordinated walk, with a wide base and the feet thrown out.'
   },
-  {
-    term: 'Festinating Gait',
-    definition:
-      "A gait characterized by small, shuffling steps that accelerate, often seen in Parkinson's disease."
-  },
+  {},
   {
     term: 'Steppage Gait',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:488:11
     definition: 'An unsteady, uncoordinated walk, with a wide base and the feet thrown out.'
   },
   {
-    term: 'Festinating Gait',
+    term: "",
     definition:
       "A gait characterized by small, shuffling steps that accelerate, often seen in Parkinson's disease."

[NoCoverage] StringLiteral
components/GlossaryView.tsx:490:7
   {
     term: 'Festinating Gait',
     definition:
-      "A gait characterized by small, shuffling steps that accelerate, often seen in Parkinson's disease."
+      ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:492:3
     definition:
       "A gait characterized by small, shuffling steps that accelerate, often seen in Parkinson's disease."
   },
-  {
-    term: 'Steppage Gait',
-    definition:
-      'A gait characterized by lifting the leg high to avoid dragging the toes, often seen in foot drop.'
-  },
+  {},
   {
     term: 'Hemiplegic Gait',

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:497:3
     definition:
       'A gait characterized by lifting the leg high to avoid dragging the toes, often seen in foot drop.'
   },
-  {
-    term: 'Hemiplegic Gait',
-    definition: 'A gait where the patient circumducts the paralyzed leg, often seen after a stroke.'
-  },
+  {},
   {
     term: 'Scissoring Gait',

[NoCoverage] StringLiteral
components/GlossaryView.tsx:498:11
       'A gait characterized by lifting the leg high to avoid dragging the toes, often seen in foot drop.'
   },
   {
-    term: 'Hemiplegic Gait',
+    term: "",
     definition: 'A gait where the patient circumducts the paralyzed leg, often seen after a stroke.'
   },

[NoCoverage] StringLiteral
components/GlossaryView.tsx:499:17
   },
   {
     term: 'Hemiplegic Gait',
-    definition: 'A gait where the patient circumducts the paralyzed leg, often seen after a stroke.'
+    definition: ""
   },
   {

[NoCoverage] ObjectLiteral
components/GlossaryView.tsx:501:3
     term: 'Hemiplegic Gait',
     definition: 'A gait where the patient circumducts the paralyzed leg, often seen after a stroke.'
   },
-  {
-    term: 'Scissoring Gait',
-    definition:
-      'A gait where the legs cross over each other like scissors, often seen in cerebral palsy.'
-  },
+  {},
   {
     term: 'Waddling Gait',

[NoCoverage] LogicalOperator
components/GlossaryView.tsx:519:50
 }
 
 const GlossaryView: React.FC<GlossaryViewProps> = ({ onBack, initialTerm }) => {
-  const [searchQuery, setSearchQuery] = useState(initialTerm || '');
+  const [searchQuery, setSearchQuery] = useState(initialTerm && '');
   const [selectedTerm, setSelectedTerm] = useState<GlossaryEntry | null>(null);
 

[NoCoverage] ConditionalExpression
components/GlossaryView.tsx:519:50
 }
 
 const GlossaryView: React.FC<GlossaryViewProps> = ({ onBack, initialTerm }) => {
-  const [searchQuery, setSearchQuery] = useState(initialTerm || '');
+  const [searchQuery, setSearchQuery] = useState(false);
   const [selectedTerm, setSelectedTerm] = useState<GlossaryEntry | null>(null);
 

[NoCoverage] BlockStatement
components/GlossaryView.tsx:522:40
   const [searchQuery, setSearchQuery] = useState(initialTerm || '');
   const [selectedTerm, setSelectedTerm] = useState<GlossaryEntry | null>(null);
 
-  const sortedGlossary = useMemo(() => {
-    return [...GLOSSARY_DATA].sort((a, b) => a.term.localeCompare(b.term));
-  }, []);
+  const sortedGlossary = useMemo(() => {}, []);
 
   const { results: filteredGlossary, didYouMean } = useClinicalSearch(sortedGlossary, searchQuery, [

[NoCoverage] ArrowFunction
components/GlossaryView.tsx:523:36
   const [selectedTerm, setSelectedTerm] = useState<GlossaryEntry | null>(null);
 
   const sortedGlossary = useMemo(() => {
-    return [...GLOSSARY_DATA].sort((a, b) => a.term.localeCompare(b.term));
+    return [...GLOSSARY_DATA].sort(() => undefined);
   }, []);
 

[NoCoverage] MethodExpression
components/GlossaryView.tsx:523:12
   const [selectedTerm, setSelectedTerm] = useState<GlossaryEntry | null>(null);
 
   const sortedGlossary = useMemo(() => {
-    return [...GLOSSARY_DATA].sort((a, b) => a.term.localeCompare(b.term));
+    return [...GLOSSARY_DATA];
   }, []);
 

[NoCoverage] BlockStatement
components/GlossaryView.tsx:531:41
     'definition'
   ]);
 
-  const groupedGlossary = useMemo(() => {
-    const groups: Record<string, GlossaryEntry[]> = {};
-    filteredGlossary.forEach((entry) => {
-      const firstLetter = entry.term[0].toUpperCase();
-      if (!groups[firstLetter]) groups[firstLetter] = [];
-      groups[firstLetter].push(entry);
-    });
-    return groups;
-  }, [filteredGlossary]);
+  const groupedGlossary = useMemo(() => {}, [filteredGlossary]);
 
   const alphabet = 'ABCDEFGHIJKLMNOPQRSTUVWXYZ'.split('');

[NoCoverage] BlockStatement
components/GlossaryView.tsx:533:41
 
   const groupedGlossary = useMemo(() => {
     const groups: Record<string, GlossaryEntry[]> = {};
-    filteredGlossary.forEach((entry) => {
-      const firstLetter = entry.term[0].toUpperCase();
-      if (!groups[firstLetter]) groups[firstLetter] = [];
-      groups[firstLetter].push(entry);
-    });
+    filteredGlossary.forEach((entry) => {});
     return groups;
   }, [filteredGlossary]);

[NoCoverage] MethodExpression
components/GlossaryView.tsx:534:27
   const groupedGlossary = useMemo(() => {
     const groups: Record<string, GlossaryEntry[]> = {};
     filteredGlossary.forEach((entry) => {
-      const firstLetter = entry.term[0].toUpperCase();
+      const firstLetter = entry.term[0].toLowerCase();
       if (!groups[firstLetter]) groups[firstLetter] = [];
       groups[firstLetter].push(entry);

[NoCoverage] ConditionalExpression
components/GlossaryView.tsx:535:11
     const groups: Record<string, GlossaryEntry[]> = {};
     filteredGlossary.forEach((entry) => {
       const firstLetter = entry.term[0].toUpperCase();
-      if (!groups[firstLetter]) groups[firstLetter] = [];
+      if (true) groups[firstLetter] = [];
       groups[firstLetter].push(entry);
     });

[NoCoverage] BooleanLiteral
components/GlossaryView.tsx:535:11
     const groups: Record<string, GlossaryEntry[]> = {};
     filteredGlossary.forEach((entry) => {
       const firstLetter = entry.term[0].toUpperCase();
-      if (!groups[firstLetter]) groups[firstLetter] = [];
+      if (groups[firstLetter]) groups[firstLetter] = [];
       groups[firstLetter].push(entry);
     });

[NoCoverage] StringLiteral
components/GlossaryView.tsx:541:20
     return groups;
   }, [filteredGlossary]);
 
-  const alphabet = 'ABCDEFGHIJKLMNOPQRSTUVWXYZ'.split('');
+  const alphabet = "".split('');
 
   return (

[NoCoverage] ConditionalExpression
components/GlossaryView.tsx:548:14
       <header className="mb-12">
         <div className="flex items-center justify-between mb-8">
           <div className="flex items-center gap-4">
-            {onBack && (
-              <button
-                onClick={onBack}
-                className="p-2 hover:bg-slate-900 rounded-xl text-slate-400 transition-colors"
-              >
-                <ArrowLeft className="w-5 h-5" />
-              </button>
-            )}
+            {false}
             <div className="p-4 bg-blue-600 text-white rounded-[24px] shadow-2xl shadow-blue-600/20">
               <Book className="w-8 h-8" />

[NoCoverage] ConditionalExpression
components/GlossaryView.tsx:548:14
       <header className="mb-12">
         <div className="flex items-center justify-between mb-8">
           <div className="flex items-center gap-4">
-            {onBack && (
-              <button
-                onClick={onBack}
-                className="p-2 hover:bg-slate-900 rounded-xl text-slate-400 transition-colors"
-              >
-                <ArrowLeft className="w-5 h-5" />
-              </button>
-            )}
+            {true}
             <div className="p-4 bg-blue-600 text-white rounded-[24px] shadow-2xl shadow-blue-600/20">
               <Book className="w-8 h-8" />

[NoCoverage] ConditionalExpression
components/GlossaryView.tsx:586:12
             placeholder="Search medical terms or definitions..."
           />
-          {didYouMean && (
-            <div className="mt-4 flex justify-start">
-              <button
-                onClick={() => setSearchQuery(didYouMean)}
-                className="flex items-center gap-2 px-4 py-2 bg-blue-950/20 hover:bg-blue-100 text-blue-600 rounded-xl transition-all shadow-sm w-full"
-              >
-                <span className="text-[10px] font-black uppercase tracking-widest text-blue-400 shrink-0">
-                  Did you mean
-                </span>
-                <span className="text-xs font-bold border-b border-blue-600 border-dashed truncate">
-                  {didYouMean}
-                </span>
-                <span className="text-[10px] font-black uppercase tracking-widest text-blue-400 shrink-0">
-                  ?
-                </span>
-              </button>
-            </div>
-          )}
+          {false}
         </div>
       </header>

[NoCoverage] ConditionalExpression
components/GlossaryView.tsx:586:12
             placeholder="Search medical terms or definitions..."
           />
-          {didYouMean && (
-            <div className="mt-4 flex justify-start">
-              <button
-                onClick={() => setSearchQuery(didYouMean)}
-                className="flex items-center gap-2 px-4 py-2 bg-blue-950/20 hover:bg-blue-100 text-blue-600 rounded-xl transition-all shadow-sm w-full"
-              >
-                <span className="text-[10px] font-black uppercase tracking-widest text-blue-400 shrink-0">
-                  Did you mean
-                </span>
-                <span className="text-xs font-bold border-b border-blue-600 border-dashed truncate">
-                  {didYouMean}
-                </span>
-                <span className="text-[10px] font-black uppercase tracking-widest text-blue-400 shrink-0">
-                  ?
-                </span>
-              </button>
-            </div>
-          )}
+          {true}
         </div>
       </header>

[NoCoverage] BlockStatement
components/GlossaryView.tsx:611:39
         {/* Alphabet Navigation */}
         <div className="hidden lg:block sticky top-24 w-16 shrink-0">
           <div className="flex flex-col gap-1">
-            {alphabet.map((letter) => {
-              const hasTerms = groupedGlossary[letter];
-              return (
-                <button
-                  key={letter}
-                  onClick={() => {
-                    const element = document.getElementById(`letter-${letter}`);
-                    if (element) element.scrollIntoView({ behavior: 'smooth', block: 'start' });
-                  }}
-                  disabled={!hasTerms}
-                  className={`w-10 h-10 flex items-center justify-center rounded-xl text-[11px] font-black transition-all ${
-                    hasTerms
-                      ? 'text-slate-400 hover:bg-blue-600 hover:text-white cursor-pointer'
-                      : 'text-slate-200 cursor-default'
-                  }`}
-                >
-                  {letter}
-                </button>
-              );
-            })}
+            {alphabet.map((letter) => {})}
           </div>
         </div>

[NoCoverage] BlockStatement
components/GlossaryView.tsx:616:34
               return (
                 <button
                   key={letter}
-                  onClick={() => {
-                    const element = document.getElementById(`letter-${letter}`);
-                    if (element) element.scrollIntoView({ behavior: 'smooth', block: 'start' });
-                  }}
+                  onClick={() => {}}
                   disabled={!hasTerms}
                   className={`w-10 h-10 flex items-center justify-center rounded-xl text-[11px] font-black transition-all ${

[NoCoverage] StringLiteral
components/GlossaryView.tsx:617:61
                 <button
                   key={letter}
                   onClick={() => {
-                    const element = document.getElementById(`letter-${letter}`);
+                    const element = document.getElementById(``);
                     if (element) element.scrollIntoView({ behavior: 'smooth', block: 'start' });
                   }}

[NoCoverage] ConditionalExpression
components/GlossaryView.tsx:618:25
                   key={letter}
                   onClick={() => {
                     const element = document.getElementById(`letter-${letter}`);
-                    if (element) element.scrollIntoView({ behavior: 'smooth', block: 'start' });
+                    if (true) element.scrollIntoView({ behavior: 'smooth', block: 'start' });
                   }}
                   disabled={!hasTerms}

[NoCoverage] ConditionalExpression
components/GlossaryView.tsx:618:25
                   key={letter}
                   onClick={() => {
                     const element = document.getElementById(`letter-${letter}`);
-                    if (element) element.scrollIntoView({ behavior: 'smooth', block: 'start' });
+                    if (false) element.scrollIntoView({ behavior: 'smooth', block: 'start' });
                   }}
                   disabled={!hasTerms}

[NoCoverage] BooleanLiteral
components/GlossaryView.tsx:620:29
                     const element = document.getElementById(`letter-${letter}`);
                     if (element) element.scrollIntoView({ behavior: 'smooth', block: 'start' });
                   }}
-                  disabled={!hasTerms}
+                  disabled={hasTerms}
                   className={`w-10 h-10 flex items-center justify-center rounded-xl text-[11px] font-black transition-all ${
                     hasTerms

[NoCoverage] StringLiteral
components/GlossaryView.tsx:621:30
                     if (element) element.scrollIntoView({ behavior: 'smooth', block: 'start' });
                   }}
                   disabled={!hasTerms}
-                  className={`w-10 h-10 flex items-center justify-center rounded-xl text-[11px] font-black transition-all ${
-                    hasTerms
-                      ? 'text-slate-400 hover:bg-blue-600 hover:text-white cursor-pointer'
-                      : 'text-slate-200 cursor-default'
-                  }`}
+                  className={``}
                 >
                   {letter}

[NoCoverage] ConditionalExpression
components/GlossaryView.tsx:635:12
         </div>
 
         <div className="flex-1 space-y-12 w-full">
-          {Object.keys(groupedGlossary).length === 0 ? (
+          {true ? (
             <div className="py-20 flex flex-col items-center justify-center text-center space-y-6 bg-slate-950/20 rounded-[50px] border-2 border-dashed border-white/5">
               <div className="p-8 bg-slate-950/40 rounded-full shadow-inner border border-white/5">

[NoCoverage] EqualityOperator
components/GlossaryView.tsx:635:12
         </div>
 
         <div className="flex-1 space-y-12 w-full">
-          {Object.keys(groupedGlossary).length === 0 ? (
+          {Object.keys(groupedGlossary).length !== 0 ? (
             <div className="py-20 flex flex-col items-center justify-center text-center space-y-6 bg-slate-950/20 rounded-[50px] border-2 border-dashed border-white/5">
               <div className="p-8 bg-slate-950/40 rounded-full shadow-inner border border-white/5">

[NoCoverage] MethodExpression
components/GlossaryView.tsx:650:13
               </div>
             </div>
           ) : (
-            Object.entries(groupedGlossary)
-              .sort(([a], [b]) => a.localeCompare(b))
+            Object.entries(groupedGlossary)
               .map(([letter, entries]) => {
                 const typedEntries = entries as GlossaryEntry[];

[NoCoverage] ArrowFunction
components/GlossaryView.tsx:651:21
             </div>
           ) : (
             Object.entries(groupedGlossary)
-              .sort(([a], [b]) => a.localeCompare(b))
+              .sort(() => undefined)
               .map(([letter, entries]) => {
                 const typedEntries = entries as GlossaryEntry[];

[NoCoverage] StringLiteral
components/GlossaryView.tsx:655:41
               .map(([letter, entries]) => {
                 const typedEntries = entries as GlossaryEntry[];
                 return (
-                  <div key={letter} id={`letter-${letter}`} className="scroll-mt-24">
+                  <div key={letter} id={``} className="scroll-mt-24">
                     <div className="flex items-center gap-4 mb-6">
                       <div className="w-12 h-12 bg-slate-900 text-white rounded-2xl flex items-center justify-center text-xl font-black">
