[NoCoverage] ArrowFunction
components/GlossaryView.tsx:664:41
                     </div>
 
                     <div className="grid grid-cols-1 md:grid-cols-2 gap-6">
-                      {typedEntries.map((entry, idx) => (
-                        <div
-                          key={idx}
-                          className="group p-6 bg-slate-950/40 rounded-[32px] border border-white/5 shadow-sm hover:shadow-xl hover:border-blue-950/30 transition-all"
-                        >
-                          <div className="flex items-start justify-between mb-3">
-                            <h3 className="text-base font-black text-white group-hover:text-blue-600 transition-colors">
-                              {entry.term}
-                            </h3>
-                            <div className="p-1.5 bg-slate-950/20 rounded-lg opacity-0 group-hover:opacity-100 transition-opacity">
-                              <ChevronRight className="w-3.5 h-3.5 text-slate-400" />
-                            </div>
-                          </div>
-                          <p className="text-[13px] text-slate-400 font-medium leading-relaxed">
-                            {entry.definition}
-                          </p>
-                        </div>
-                      ))}
+                      {typedEntries.map(() => undefined)}
                     </div>
                   </div>
