[NoCoverage] BlockStatement
components/ImageModal.tsx:11:19
 }
 
 const ImageModal: React.FC<ImageModalProps> = ({ src, alt, onClose }) => {
-  useEffect(() => {
-    document.body.style.overflow = 'hidden';
-    return () => {
-      document.body.style.overflow = 'unset';
-    };
-  }, []);
+  useEffect(() => {}, []);
 
   return (

[NoCoverage] StringLiteral
components/ImageModal.tsx:12:36
 
 const ImageModal: React.FC<ImageModalProps> = ({ src, alt, onClose }) => {
   useEffect(() => {
-    document.body.style.overflow = 'hidden';
+    document.body.style.overflow = "";
     return () => {
       document.body.style.overflow = 'unset';

[NoCoverage] BlockStatement
components/ImageModal.tsx:13:18
 const ImageModal: React.FC<ImageModalProps> = ({ src, alt, onClose }) => {
   useEffect(() => {
     document.body.style.overflow = 'hidden';
-    return () => {
-      document.body.style.overflow = 'unset';
-    };
+    return () => {};
   }, []);
 
