[NoCoverage] ArrayDeclaration
components/ImmunisationView.tsx:29:40
 }
 
 const NIP_SCHEDULE = [
-  { age: 'Birth', months: 0, vaccines: ['Hepatitis B'] },
+  { age: 'Birth', months: 0, vaccines: [] },
   {
     age: '2 months',

[NoCoverage] ObjectLiteral
components/ImmunisationView.tsx:29:3
 }
 
 const NIP_SCHEDULE = [
-  { age: 'Birth', months: 0, vaccines: ['Hepatitis B'] },
+  {},
   {
     age: '2 months',

[NoCoverage] ObjectLiteral
components/ImmunisationView.tsx:30:3
 
 const NIP_SCHEDULE = [
   { age: 'Birth', months: 0, vaccines: ['Hepatitis B'] },
-  {
-    age: '2 months',
-    months: 2,
-    vaccines: ['DTPa-hepB-IPV-Hib', 'Rotavirus', 'Pneumococcal (13vPCV)'],
-    indigenousVaccines: ['Meningococcal B']
-  },
+  {},
   {
     age: '4 months',

[NoCoverage] ArrayDeclaration
components/ImmunisationView.tsx:34:25
     age: '2 months',
     months: 2,
     vaccines: ['DTPa-hepB-IPV-Hib', 'Rotavirus', 'Pneumococcal (13vPCV)'],
-    indigenousVaccines: ['Meningococcal B']
+    indigenousVaccines: []
   },
   {

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:39:37
   {
     age: '4 months',
     months: 4,
-    vaccines: ['DTPa-hepB-IPV-Hib', 'Rotavirus', 'Pneumococcal (13vPCV)'],
+    vaccines: ['DTPa-hepB-IPV-Hib', "", 'Pneumococcal (13vPCV)'],
     indigenousVaccines: ['Meningococcal B']
   },

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:40:26
     age: '4 months',
     months: 4,
     vaccines: ['DTPa-hepB-IPV-Hib', 'Rotavirus', 'Pneumococcal (13vPCV)'],
-    indigenousVaccines: ['Meningococcal B']
+    indigenousVaccines: [""]
   },
   {

[NoCoverage] ArrayDeclaration
components/ImmunisationView.tsx:45:15
   {
     age: '6 months',
     months: 6,
-    vaccines: ['DTPa-hepB-IPV-Hib', 'Pneumococcal (13vPCV)'],
+    vaccines: [],
     indigenousVaccines: ['Influenza (Annual)']
   },

[NoCoverage] ArrayDeclaration
components/ImmunisationView.tsx:46:25
     age: '6 months',
     months: 6,
     vaccines: ['DTPa-hepB-IPV-Hib', 'Pneumococcal (13vPCV)'],
-    indigenousVaccines: ['Influenza (Annual)']
+    indigenousVaccines: []
   },
   {

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:51:38
   {
     age: '12 months',
     months: 12,
-    vaccines: ['Meningococcal ACWY', 'MMR', 'Pneumococcal (13vPCV)'],
+    vaccines: ['Meningococcal ACWY', "", 'Pneumococcal (13vPCV)'],
     indigenousVaccines: ['Meningococcal B', 'Hepatitis A']
   },

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:55:10
     indigenousVaccines: ['Meningococcal B', 'Hepatitis A']
   },
   {
-    age: '18 months',
+    age: "",
     months: 18,
     vaccines: ['MMRV', 'DTPa', 'Hib'],

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:57:16
   {
     age: '18 months',
     months: 18,
-    vaccines: ['MMRV', 'DTPa', 'Hib'],
+    vaccines: ["", 'DTPa', 'Hib'],
     indigenousVaccines: ['Hepatitis A']
   },

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:57:24
   {
     age: '18 months',
     months: 18,
-    vaccines: ['MMRV', 'DTPa', 'Hib'],
+    vaccines: ['MMRV', "", 'Hib'],
     indigenousVaccines: ['Hepatitis A']
   },

[NoCoverage] ArrayDeclaration
components/ImmunisationView.tsx:58:25
     age: '18 months',
     months: 18,
     vaccines: ['MMRV', 'DTPa', 'Hib'],
-    indigenousVaccines: ['Hepatitis A']
+    indigenousVaccines: []
   },
   {

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:61:10
     indigenousVaccines: ['Hepatitis A']
   },
   {
-    age: '4 years',
+    age: "",
     months: 48,
     vaccines: ['DTPa-IPV'],

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:63:16
   {
     age: '4 years',
     months: 48,
-    vaccines: ['DTPa-IPV'],
+    vaccines: [""],
     indigenousVaccines: ['Influenza (Annual)']
   },

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:64:26
     age: '4 years',
     months: 48,
     vaccines: ['DTPa-IPV'],
-    indigenousVaccines: ['Influenza (Annual)']
+    indigenousVaccines: [""]
   },
   {

[NoCoverage] ObjectLiteral
components/ImmunisationView.tsx:66:3
     vaccines: ['DTPa-IPV'],
     indigenousVaccines: ['Influenza (Annual)']
   },
-  {
-    age: '12-13 years',
-    months: 144,
-    vaccines: ['HPV', 'dTpa'],
-    indigenousVaccines: ['Influenza (Annual)']
-  },
+  {},
   {
     age: '50 years+',

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:69:16
   {
     age: '12-13 years',
     months: 144,
-    vaccines: ['HPV', 'dTpa'],
+    vaccines: ["", 'dTpa'],
     indigenousVaccines: ['Influenza (Annual)']
   },

[NoCoverage] ArrayDeclaration
components/ImmunisationView.tsx:69:15
   {
     age: '12-13 years',
     months: 144,
-    vaccines: ['HPV', 'dTpa'],
+    vaccines: [],
     indigenousVaccines: ['Influenza (Annual)']
   },

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:70:26
     age: '12-13 years',
     months: 144,
     vaccines: ['HPV', 'dTpa'],
-    indigenousVaccines: ['Influenza (Annual)']
+    indigenousVaccines: [""]
   },
   {

[NoCoverage] ObjectLiteral
components/ImmunisationView.tsx:78:3
     vaccines: [],
     indigenousVaccines: ['Pneumococcal (23vPPV)', 'Influenza (Annual)']
   },
-  {
-    age: '65 years+',
-    months: 780,
-    vaccines: ['Pneumococcal (13vPCV)', 'Shingles (Shingrix)'],
-    indigenousVaccines: ['Influenza (Annual)']
-  }
+  {}
 ];
 

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:81:41
   {
     age: '65 years+',
     months: 780,
-    vaccines: ['Pneumococcal (13vPCV)', 'Shingles (Shingrix)'],
+    vaccines: ['Pneumococcal (13vPCV)', ""],
     indigenousVaccines: ['Influenza (Annual)']
   }

[NoCoverage] ArrayDeclaration
components/ImmunisationView.tsx:81:15
   {
     age: '65 years+',
     months: 780,
-    vaccines: ['Pneumococcal (13vPCV)', 'Shingles (Shingrix)'],
+    vaccines: [],
     indigenousVaccines: ['Influenza (Annual)']
   }

[NoCoverage] ObjectLiteral
components/ImmunisationView.tsx:86:49
   }
 ];
 
-const VACCINE_DETAILS: Record<string, string> = {
-  'Hepatitis B': 'Protects against Hepatitis B virus which causes liver damage.',
-  'DTPa-hepB-IPV-Hib':
-    'Combination vaccine for Diphtheria, Tetanus, Pertussis, Hep B, Polio, and Hib.',
-  Rotavirus: 'Oral vaccine against severe gastroenteritis caused by rotavirus.',
-  'Pneumococcal (13vPCV)':
-    'Protects against 13 strains of pneumococcal bacteria (pneumonia, meningitis).',
-  'Meningococcal ACWY': 'Protects against four strains of meningococcal disease.',
-  MMR: 'Measles, Mumps, and Rubella.',
-  MMRV: 'Measles, Mumps, Rubella, and Varicella (Chickenpox).',
-  DTPa: 'Diphtheria, Tetanus, and acellular Pertussis (Whooping Cough).',
-  Hib: 'Haemophilus influenzae type b.',
-  'DTPa-IPV': 'Diphtheria, Tetanus, Pertussis, and Polio.',
-  HPV: 'Human Papillomavirus (prevents cervical and other cancers).',
-  dTpa: 'Reduced dose Diphtheria, Tetanus, and acellular Pertussis (booster).',
-  'Shingles (Shingrix)': 'Protects against herpes zoster (shingles).',
-  'Meningococcal B':
-    'Protects against strain B of meningococcal disease. Recommended for Indigenous infants.',
-  'Hepatitis A':
-    'Protects against Hepatitis A. Recommended for Indigenous children in high-risk areas.',
-  'Influenza (Annual)':
-    'Annual flu vaccine recommended for all Indigenous Australians from 6 months of age.',
-  'Pneumococcal (23vPPV)': 'Booster protection against 23 strains of pneumococcal disease.'
-};
+const VACCINE_DETAILS: Record<string, string> = {};
 
 const ImmunisationView: React.FC = () => {

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:90:14
   'Hepatitis B': 'Protects against Hepatitis B virus which causes liver damage.',
   'DTPa-hepB-IPV-Hib':
     'Combination vaccine for Diphtheria, Tetanus, Pertussis, Hep B, Polio, and Hib.',
-  Rotavirus: 'Oral vaccine against severe gastroenteritis caused by rotavirus.',
+  Rotavirus: "",
   'Pneumococcal (13vPCV)':
     'Protects against 13 strains of pneumococcal bacteria (pneumonia, meningitis).',

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:93:25
   Rotavirus: 'Oral vaccine against severe gastroenteritis caused by rotavirus.',
   'Pneumococcal (13vPCV)':
     'Protects against 13 strains of pneumococcal bacteria (pneumonia, meningitis).',
-  'Meningococcal ACWY': 'Protects against four strains of meningococcal disease.',
+  'Meningococcal ACWY': "",
   MMR: 'Measles, Mumps, and Rubella.',
   MMRV: 'Measles, Mumps, Rubella, and Varicella (Chickenpox).',

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:94:8
   'Pneumococcal (13vPCV)':
     'Protects against 13 strains of pneumococcal bacteria (pneumonia, meningitis).',
   'Meningococcal ACWY': 'Protects against four strains of meningococcal disease.',
-  MMR: 'Measles, Mumps, and Rubella.',
+  MMR: "",
   MMRV: 'Measles, Mumps, Rubella, and Varicella (Chickenpox).',
   DTPa: 'Diphtheria, Tetanus, and acellular Pertussis (Whooping Cough).',

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:105:5
   'Meningococcal B':
     'Protects against strain B of meningococcal disease. Recommended for Indigenous infants.',
   'Hepatitis A':
-    'Protects against Hepatitis A. Recommended for Indigenous children in high-risk areas.',
+    "",
   'Influenza (Annual)':
     'Annual flu vaccine recommended for all Indigenous Australians from 6 months of age.',

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:107:5
   'Hepatitis A':
     'Protects against Hepatitis A. Recommended for Indigenous children in high-risk areas.',
   'Influenza (Annual)':
-    'Annual flu vaccine recommended for all Indigenous Australians from 6 months of age.',
+    "",
   'Pneumococcal (23vPPV)': 'Booster protection against 23 strains of pneumococcal disease.'
 };

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:112:73
 };
 
 const ImmunisationView: React.FC = () => {
-  const [activeTab, setActiveTab] = useState<'schedule' | 'calculator'>('schedule');
+  const [activeTab, setActiveTab] = useState<'schedule' | 'calculator'>("");
   const [ageMonths, setAgeMonths] = useState<number>(0);
   const [givenVaccines, setGivenVaccines] = useState<string[]>([]);

[NoCoverage] ArrayDeclaration
components/ImmunisationView.tsx:114:64
 const ImmunisationView: React.FC = () => {
   const [activeTab, setActiveTab] = useState<'schedule' | 'calculator'>('schedule');
   const [ageMonths, setAgeMonths] = useState<number>(0);
-  const [givenVaccines, setGivenVaccines] = useState<string[]>([]);
+  const [givenVaccines, setGivenVaccines] = useState<string[]>(["Stryker was here"]);
   const [searchQuery, setSearchQuery] = useState('');
   const [isIndigenous, setIsIndigenous] = useState(false);

[NoCoverage] BooleanLiteral
components/ImmunisationView.tsx:116:52
   const [ageMonths, setAgeMonths] = useState<number>(0);
   const [givenVaccines, setGivenVaccines] = useState<string[]>([]);
   const [searchQuery, setSearchQuery] = useState('');
-  const [isIndigenous, setIsIndigenous] = useState(false);
+  const [isIndigenous, setIsIndigenous] = useState(true);
 
   const { results: filteredSchedule, didYouMean } = useClinicalSearch(

[NoCoverage] ArrowFunction
components/ImmunisationView.tsx:120:7
 
   const { results: filteredSchedule, didYouMean } = useClinicalSearch(
     useMemo(
-      () =>
-        NIP_SCHEDULE.map((item) => ({
-          ...item,
-          // Create a single searchable string of all vaccines for easier filtering
-          combinedVaccinesStr: isIndigenous
-            ? [...item.vaccines, ...(item.indigenousVaccines || [])].join(' ')
-            : item.vaccines.join(' '),
-          combinedVaccines: isIndigenous
-            ? [...item.vaccines, ...(item.indigenousVaccines || [])]
-            : item.vaccines
-        })).filter((item) => item.combinedVaccines.length > 0),
+      () => undefined,
       [isIndigenous]
     ),

[NoCoverage] ArrowFunction
components/ImmunisationView.tsx:121:26
   const { results: filteredSchedule, didYouMean } = useClinicalSearch(
     useMemo(
       () =>
-        NIP_SCHEDULE.map((item) => ({
-          ...item,
-          // Create a single searchable string of all vaccines for easier filtering
-          combinedVaccinesStr: isIndigenous
-            ? [...item.vaccines, ...(item.indigenousVaccines || [])].join(' ')
-            : item.vaccines.join(' '),
-          combinedVaccines: isIndigenous
-            ? [...item.vaccines, ...(item.indigenousVaccines || [])]
-            : item.vaccines
-        })).filter((item) => item.combinedVaccines.length > 0),
+        NIP_SCHEDULE.map(() => undefined).filter((item) => item.combinedVaccines.length > 0),
       [isIndigenous]
     ),

[NoCoverage] MethodExpression
components/ImmunisationView.tsx:121:9
   const { results: filteredSchedule, didYouMean } = useClinicalSearch(
     useMemo(
       () =>
-        NIP_SCHEDULE.map((item) => ({
-          ...item,
-          // Create a single searchable string of all vaccines for easier filtering
-          combinedVaccinesStr: isIndigenous
-            ? [...item.vaccines, ...(item.indigenousVaccines || [])].join(' ')
-            : item.vaccines.join(' '),
-          combinedVaccines: isIndigenous
-            ? [...item.vaccines, ...(item.indigenousVaccines || [])]
-            : item.vaccines
-        })).filter((item) => item.combinedVaccines.length > 0),
+        NIP_SCHEDULE.map(item => ({
+  ...item,
+  // Create a single searchable string of all vaccines for easier filtering
+  combinedVaccinesStr: isIndigenous ? [...item.vaccines, ...(item.indigenousVaccines || [])].join(' ') : item.vaccines.join(' '),
+  combinedVaccines: isIndigenous ? [...item.vaccines, ...(item.indigenousVaccines || [])] : item.vaccines
+})),
       [isIndigenous]
     ),

[NoCoverage] LogicalOperator
components/ImmunisationView.tsx:125:38
           ...item,
           // Create a single searchable string of all vaccines for easier filtering
           combinedVaccinesStr: isIndigenous
-            ? [...item.vaccines, ...(item.indigenousVaccines || [])].join(' ')
+            ? [...item.vaccines, ...(item.indigenousVaccines && [])].join(' ')
             : item.vaccines.join(' '),
           combinedVaccines: isIndigenous

[NoCoverage] ConditionalExpression
components/ImmunisationView.tsx:125:38
           ...item,
           // Create a single searchable string of all vaccines for easier filtering
           combinedVaccinesStr: isIndigenous
-            ? [...item.vaccines, ...(item.indigenousVaccines || [])].join(' ')
+            ? [...item.vaccines, ...(true)].join(' ')
             : item.vaccines.join(' '),
           combinedVaccines: isIndigenous

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:126:34
           // Create a single searchable string of all vaccines for easier filtering
           combinedVaccinesStr: isIndigenous
             ? [...item.vaccines, ...(item.indigenousVaccines || [])].join(' ')
-            : item.vaccines.join(' '),
+            : item.vaccines.join(""),
           combinedVaccines: isIndigenous
             ? [...item.vaccines, ...(item.indigenousVaccines || [])]

[NoCoverage] ConditionalExpression
components/ImmunisationView.tsx:128:38
             ? [...item.vaccines, ...(item.indigenousVaccines || [])].join(' ')
             : item.vaccines.join(' '),
           combinedVaccines: isIndigenous
-            ? [...item.vaccines, ...(item.indigenousVaccines || [])]
+            ? [...item.vaccines, ...(true)]
             : item.vaccines
         })).filter((item) => item.combinedVaccines.length > 0),

[NoCoverage] LogicalOperator
components/ImmunisationView.tsx:128:38
             ? [...item.vaccines, ...(item.indigenousVaccines || [])].join(' ')
             : item.vaccines.join(' '),
           combinedVaccines: isIndigenous
-            ? [...item.vaccines, ...(item.indigenousVaccines || [])]
+            ? [...item.vaccines, ...(item.indigenousVaccines && [])]
             : item.vaccines
         })).filter((item) => item.combinedVaccines.length > 0),

[NoCoverage] ConditionalExpression
components/ImmunisationView.tsx:130:30
           combinedVaccines: isIndigenous
             ? [...item.vaccines, ...(item.indigenousVaccines || [])]
             : item.vaccines
-        })).filter((item) => item.combinedVaccines.length > 0),
+        })).filter((item) => true),
       [isIndigenous]
     ),

[NoCoverage] EqualityOperator
components/ImmunisationView.tsx:130:30
           combinedVaccines: isIndigenous
             ? [...item.vaccines, ...(item.indigenousVaccines || [])]
             : item.vaccines
-        })).filter((item) => item.combinedVaccines.length > 0),
+        })).filter((item) => item.combinedVaccines.length <= 0),
       [isIndigenous]
     ),

[NoCoverage] ArrayDeclaration
components/ImmunisationView.tsx:134:5
       [isIndigenous]
     ),
     searchQuery,
-    ['age', 'combinedVaccinesStr']
+    []
   );
 

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:134:13
       [isIndigenous]
     ),
     searchQuery,
-    ['age', 'combinedVaccinesStr']
+    ['age', ""]
   );
 

[NoCoverage] BlockStatement
components/ImmunisationView.tsx:137:38
     ['age', 'combinedVaccinesStr']
   );
 
-  const catchUpDoses = useMemo(() => {
-    const due: { age: string; vaccine: string }[] = [];
-    NIP_SCHEDULE.forEach((item) => {
-      if (ageMonths >= item.months) {
-        const vaccines = isIndigenous
-          ? [...item.vaccines, ...(item.indigenousVaccines || [])]
-          : item.vaccines;
-
-        vaccines.forEach((v) => {
-          if (!givenVaccines.includes(`${item.months}-${v}`)) {
-            due.push({ age: item.age, vaccine: v });
-          }
-        });
-      }
-    });
-    return due;
-  }, [ageMonths, givenVaccines, isIndigenous]);
+  const catchUpDoses = useMemo(() => {}, [ageMonths, givenVaccines, isIndigenous]);
 
   const toggleVaccine = (months: number, vaccine: string) => {

[NoCoverage] BlockStatement
components/ImmunisationView.tsx:139:36
 
   const catchUpDoses = useMemo(() => {
     const due: { age: string; vaccine: string }[] = [];
-    NIP_SCHEDULE.forEach((item) => {
-      if (ageMonths >= item.months) {
-        const vaccines = isIndigenous
-          ? [...item.vaccines, ...(item.indigenousVaccines || [])]
-          : item.vaccines;
-
-        vaccines.forEach((v) => {
-          if (!givenVaccines.includes(`${item.months}-${v}`)) {
-            due.push({ age: item.age, vaccine: v });
-          }
-        });
-      }
-    });
+    NIP_SCHEDULE.forEach((item) => {});
     return due;
   }, [ageMonths, givenVaccines, isIndigenous]);

[NoCoverage] EqualityOperator
components/ImmunisationView.tsx:140:11
   const catchUpDoses = useMemo(() => {
     const due: { age: string; vaccine: string }[] = [];
     NIP_SCHEDULE.forEach((item) => {
-      if (ageMonths >= item.months) {
+      if (ageMonths > item.months) {
         const vaccines = isIndigenous
           ? [...item.vaccines, ...(item.indigenousVaccines || [])]

[NoCoverage] ConditionalExpression
components/ImmunisationView.tsx:140:11
   const catchUpDoses = useMemo(() => {
     const due: { age: string; vaccine: string }[] = [];
     NIP_SCHEDULE.forEach((item) => {
-      if (ageMonths >= item.months) {
+      if (false) {
         const vaccines = isIndigenous
           ? [...item.vaccines, ...(item.indigenousVaccines || [])]

[NoCoverage] ConditionalExpression
components/ImmunisationView.tsx:142:36
     NIP_SCHEDULE.forEach((item) => {
       if (ageMonths >= item.months) {
         const vaccines = isIndigenous
-          ? [...item.vaccines, ...(item.indigenousVaccines || [])]
+          ? [...item.vaccines, ...(true)]
           : item.vaccines;
 

[NoCoverage] ConditionalExpression
components/ImmunisationView.tsx:142:36
     NIP_SCHEDULE.forEach((item) => {
       if (ageMonths >= item.months) {
         const vaccines = isIndigenous
-          ? [...item.vaccines, ...(item.indigenousVaccines || [])]
+          ? [...item.vaccines, ...(false)]
           : item.vaccines;
 

[NoCoverage] BlockStatement
components/ImmunisationView.tsx:145:33
           ? [...item.vaccines, ...(item.indigenousVaccines || [])]
           : item.vaccines;
 
-        vaccines.forEach((v) => {
-          if (!givenVaccines.includes(`${item.months}-${v}`)) {
-            due.push({ age: item.age, vaccine: v });
-          }
-        });
+        vaccines.forEach((v) => {});
       }
     });

[NoCoverage] BlockStatement
components/ImmunisationView.tsx:146:63
           : item.vaccines;
 
         vaccines.forEach((v) => {
-          if (!givenVaccines.includes(`${item.months}-${v}`)) {
-            due.push({ age: item.age, vaccine: v });
-          }
+          if (!givenVaccines.includes(`${item.months}-${v}`)) {}
         });
       }

[NoCoverage] ConditionalExpression
components/ImmunisationView.tsx:146:15
           : item.vaccines;
 
         vaccines.forEach((v) => {
-          if (!givenVaccines.includes(`${item.months}-${v}`)) {
+          if (false) {
             due.push({ age: item.age, vaccine: v });
           }

[NoCoverage] BlockStatement
components/ImmunisationView.tsx:155:62
     return due;
   }, [ageMonths, givenVaccines, isIndigenous]);
 
-  const toggleVaccine = (months: number, vaccine: string) => {
-    const key = `${months}-${vaccine}`;
-    setGivenVaccines((prev) =>
-      prev.includes(key) ? prev.filter((v) => v !== key) : [...prev, key]
-    );
-  };
+  const toggleVaccine = (months: number, vaccine: string) => {};
 
   return (

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:156:17
   }, [ageMonths, givenVaccines, isIndigenous]);
 
   const toggleVaccine = (months: number, vaccine: string) => {
-    const key = `${months}-${vaccine}`;
+    const key = ``;
     setGivenVaccines((prev) =>
       prev.includes(key) ? prev.filter((v) => v !== key) : [...prev, key]

[NoCoverage] ArrowFunction
components/ImmunisationView.tsx:157:22
 
   const toggleVaccine = (months: number, vaccine: string) => {
     const key = `${months}-${vaccine}`;
-    setGivenVaccines((prev) =>
-      prev.includes(key) ? prev.filter((v) => v !== key) : [...prev, key]
+    setGivenVaccines(() => undefined
     );
   };

[NoCoverage] ArrowFunction
components/ImmunisationView.tsx:158:40
   const toggleVaccine = (months: number, vaccine: string) => {
     const key = `${months}-${vaccine}`;
     setGivenVaccines((prev) =>
-      prev.includes(key) ? prev.filter((v) => v !== key) : [...prev, key]
+      prev.includes(key) ? prev.filter(() => undefined) : [...prev, key]
     );
   };

[NoCoverage] ConditionalExpression
components/ImmunisationView.tsx:158:47
   const toggleVaccine = (months: number, vaccine: string) => {
     const key = `${months}-${vaccine}`;
     setGivenVaccines((prev) =>
-      prev.includes(key) ? prev.filter((v) => v !== key) : [...prev, key]
+      prev.includes(key) ? prev.filter((v) => true) : [...prev, key]
     );
   };

[NoCoverage] ArrowFunction
components/ImmunisationView.tsx:181:24
 
           <nav className="flex bg-slate-900 p-1 rounded-xl">
             <button
-              onClick={() => setActiveTab('schedule')}
+              onClick={() => undefined}
               className={`flex items-center gap-2 px-6 py-2 rounded-lg text-[10px] font-black uppercase tracking-widest transition-all ${
                 activeTab === 'schedule'

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:182:26
           <nav className="flex bg-slate-900 p-1 rounded-xl">
             <button
               onClick={() => setActiveTab('schedule')}
-              className={`flex items-center gap-2 px-6 py-2 rounded-lg text-[10px] font-black uppercase tracking-widest transition-all ${
-                activeTab === 'schedule'
-                  ? 'bg-slate-950/40 text-indigo-600 shadow-sm'
-                  : 'text-slate-400 hover:text-slate-400'
-              }`}
+              className={``}
             >
               <Calendar className="w-4 h-4" />

[NoCoverage] ConditionalExpression
components/ImmunisationView.tsx:183:17
             <button
               onClick={() => setActiveTab('schedule')}
               className={`flex items-center gap-2 px-6 py-2 rounded-lg text-[10px] font-black uppercase tracking-widest transition-all ${
-                activeTab === 'schedule'
+                true
                   ? 'bg-slate-950/40 text-indigo-600 shadow-sm'
                   : 'text-slate-400 hover:text-slate-400'

[NoCoverage] ConditionalExpression
components/ImmunisationView.tsx:183:17
             <button
               onClick={() => setActiveTab('schedule')}
               className={`flex items-center gap-2 px-6 py-2 rounded-lg text-[10px] font-black uppercase tracking-widest transition-all ${
-                activeTab === 'schedule'
+                false
                   ? 'bg-slate-950/40 text-indigo-600 shadow-sm'
                   : 'text-slate-400 hover:text-slate-400'

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:185:21
               className={`flex items-center gap-2 px-6 py-2 rounded-lg text-[10px] font-black uppercase tracking-widest transition-all ${
                 activeTab === 'schedule'
                   ? 'bg-slate-950/40 text-indigo-600 shadow-sm'
-                  : 'text-slate-400 hover:text-slate-400'
+                  : ""
               }`}
             >

[NoCoverage] ArrowFunction
components/ImmunisationView.tsx:192:24
               NIP Schedule
             </button>
             <button
-              onClick={() => setActiveTab('calculator')}
+              onClick={() => undefined}
               className={`flex items-center gap-2 px-6 py-2 rounded-lg text-[10px] font-black uppercase tracking-widest transition-all ${
                 activeTab === 'calculator'

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:193:26
             </button>
             <button
               onClick={() => setActiveTab('calculator')}
-              className={`flex items-center gap-2 px-6 py-2 rounded-lg text-[10px] font-black uppercase tracking-widest transition-all ${
-                activeTab === 'calculator'
-                  ? 'bg-slate-950/40 text-indigo-600 shadow-sm'
-                  : 'text-slate-400 hover:text-slate-400'
-              }`}
+              className={``}
             >
               <Calculator className="w-4 h-4" />

[NoCoverage] ConditionalExpression
components/ImmunisationView.tsx:194:17
             <button
               onClick={() => setActiveTab('calculator')}
               className={`flex items-center gap-2 px-6 py-2 rounded-lg text-[10px] font-black uppercase tracking-widest transition-all ${
-                activeTab === 'calculator'
+                true
                   ? 'bg-slate-950/40 text-indigo-600 shadow-sm'
                   : 'text-slate-400 hover:text-slate-400'

[NoCoverage] ConditionalExpression
components/ImmunisationView.tsx:194:17
             <button
               onClick={() => setActiveTab('calculator')}
               className={`flex items-center gap-2 px-6 py-2 rounded-lg text-[10px] font-black uppercase tracking-widest transition-all ${
-                activeTab === 'calculator'
+                false
                   ? 'bg-slate-950/40 text-indigo-600 shadow-sm'
                   : 'text-slate-400 hover:text-slate-400'

[NoCoverage] ArrowFunction
components/ImmunisationView.tsx:209:24
               Indigenous Status
             </span>
             <button
-              onClick={() => setIsIndigenous(!isIndigenous)}
+              onClick={() => undefined}
               className={`relative w-12 h-6 rounded-full transition-colors ${isIndigenous ? 'bg-indigo-600' : 'bg-slate-300'}`}
             >

[NoCoverage] BooleanLiteral
components/ImmunisationView.tsx:209:46
               Indigenous Status
             </span>
             <button
-              onClick={() => setIsIndigenous(!isIndigenous)}
+              onClick={() => setIsIndigenous(isIndigenous)}
               className={`relative w-12 h-6 rounded-full transition-colors ${isIndigenous ? 'bg-indigo-600' : 'bg-slate-300'}`}
             >

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:210:93
             </span>
             <button
               onClick={() => setIsIndigenous(!isIndigenous)}
-              className={`relative w-12 h-6 rounded-full transition-colors ${isIndigenous ? 'bg-indigo-600' : 'bg-slate-300'}`}
+              className={`relative w-12 h-6 rounded-full transition-colors ${isIndigenous ? "" : 'bg-slate-300'}`}
             >
               <div

[NoCoverage] StringLiteral
components/ImmunisationView.tsx:210:111
             </span>
             <button
               onClick={() => setIsIndigenous(!isIndigenous)}
-              className={`relative w-12 h-6 rounded-full transition-colors ${isIndigenous ? 'bg-indigo-600' : 'bg-slate-300'}`}
+              className={`relative w-12 h-6 rounded-full transition-colors ${isIndigenous ? 'bg-indigo-600' : ""}`}
             >
               <div

[NoCoverage] ConditionalExpression
components/ImmunisationView.tsx:222:12
 
       <main className="max-w-6xl mx-auto p-8">
         <AnimatePresence mode="wait">
-          {activeTab === 'schedule' ? (
+          {true ? (
             <motion.div
               key="schedule"

[NoCoverage] ConditionalExpression
components/ImmunisationView.tsx:222:12
 
       <main className="max-w-6xl mx-auto p-8">
         <AnimatePresence mode="wait">
-          {activeTab === 'schedule' ? (
+          {false ? (
             <motion.div
               key="schedule"
