[NoCoverage] BlockStatement
components/MSKExaminationListView.tsx:21:34
   downloadedIds,
   syncingIds
 }) => {
-  const mskExams = useMemo(() => {
-    return examinations.filter(
-      (e) =>
-        e.id.startsWith('msk-') ||
-        e.system === ExamSystem.RHEUMATOLOGICAL ||
-        e.keywords.some((k) => k.toLowerCase().includes('musculoskeletal'))
-    );
-  }, [examinations]);
+  const mskExams = useMemo(() => {}, [examinations]);
 
   return (

[NoCoverage] MethodExpression
components/MSKExaminationListView.tsx:22:12
   syncingIds
 }) => {
   const mskExams = useMemo(() => {
-    return examinations.filter(
-      (e) =>
-        e.id.startsWith('msk-') ||
-        e.system === ExamSystem.RHEUMATOLOGICAL ||
-        e.keywords.some((k) => k.toLowerCase().includes('musculoskeletal'))
-    );
+    return examinations;
   }, [examinations]);
 

[NoCoverage] ArrowFunction
components/MSKExaminationListView.tsx:23:7
 }) => {
   const mskExams = useMemo(() => {
     return examinations.filter(
-      (e) =>
-        e.id.startsWith('msk-') ||
-        e.system === ExamSystem.RHEUMATOLOGICAL ||
-        e.keywords.some((k) => k.toLowerCase().includes('musculoskeletal'))
+      () => undefined
     );
   }, [examinations]);

[NoCoverage] ConditionalExpression
components/MSKExaminationListView.tsx:24:9
   const mskExams = useMemo(() => {
     return examinations.filter(
       (e) =>
-        e.id.startsWith('msk-') ||
-        e.system === ExamSystem.RHEUMATOLOGICAL ||
-        e.keywords.some((k) => k.toLowerCase().includes('musculoskeletal'))
+        false
     );
   }, [examinations]);

[NoCoverage] ConditionalExpression
components/MSKExaminationListView.tsx:24:9
   const mskExams = useMemo(() => {
     return examinations.filter(
       (e) =>
-        e.id.startsWith('msk-') ||
-        e.system === ExamSystem.RHEUMATOLOGICAL ||
+        false ||
         e.keywords.some((k) => k.toLowerCase().includes('musculoskeletal'))
     );

[NoCoverage] ConditionalExpression
components/MSKExaminationListView.tsx:25:9
     return examinations.filter(
       (e) =>
         e.id.startsWith('msk-') ||
-        e.system === ExamSystem.RHEUMATOLOGICAL ||
+        false ||
         e.keywords.some((k) => k.toLowerCase().includes('musculoskeletal'))
     );

[NoCoverage] EqualityOperator
components/MSKExaminationListView.tsx:25:9
     return examinations.filter(
       (e) =>
         e.id.startsWith('msk-') ||
-        e.system === ExamSystem.RHEUMATOLOGICAL ||
+        e.system !== ExamSystem.RHEUMATOLOGICAL ||
         e.keywords.some((k) => k.toLowerCase().includes('musculoskeletal'))
     );

[NoCoverage] MethodExpression
components/MSKExaminationListView.tsx:26:9
       (e) =>
         e.id.startsWith('msk-') ||
         e.system === ExamSystem.RHEUMATOLOGICAL ||
-        e.keywords.some((k) => k.toLowerCase().includes('musculoskeletal'))
+        e.keywords.every(k => k.toLowerCase().includes('musculoskeletal'))
     );
   }, [examinations]);

[NoCoverage] ArrowFunction
components/MSKExaminationListView.tsx:26:25
       (e) =>
         e.id.startsWith('msk-') ||
         e.system === ExamSystem.RHEUMATOLOGICAL ||
-        e.keywords.some((k) => k.toLowerCase().includes('musculoskeletal'))
+        e.keywords.some(() => undefined)
     );
   }, [examinations]);

[NoCoverage] ArrowFunction
components/MSKExaminationListView.tsx:99:23
       </header>
 
       <div className="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-8">
-        {mskExams.map((exam) => (
-          <ExaminationCard
-            key={exam.id}
-            exam={exam}
-            onSelect={() => onSelectExam(exam)}
-            onSync={() => onSyncExam(exam.id)}
-            isDownloaded={downloadedIds.has(exam.id)}
-            isSyncing={syncingIds.has(exam.id)}
-          />
-        ))}
+        {mskExams.map(() => undefined)}
       </div>
 

[NoCoverage] ArrowFunction
components/MSKExaminationListView.tsx:103:23
           <ExaminationCard
             key={exam.id}
             exam={exam}
-            onSelect={() => onSelectExam(exam)}
+            onSelect={() => undefined}
             onSync={() => onSyncExam(exam.id)}
             isDownloaded={downloadedIds.has(exam.id)}

[NoCoverage] ArrowFunction
components/MSKExaminationListView.tsx:104:21
             key={exam.id}
             exam={exam}
             onSelect={() => onSelectExam(exam)}
-            onSync={() => onSyncExam(exam.id)}
+            onSync={() => undefined}
             isDownloaded={downloadedIds.has(exam.id)}
             isSyncing={syncingIds.has(exam.id)}

[NoCoverage] EqualityOperator
components/MSKExaminationListView.tsx:111:8
         ))}
       </div>
 
-      {mskExams.length === 0 && (
+      {mskExams.length !== 0 && (
         <div className="flex flex-col items-center justify-center py-32 opacity-20">
           <Search className="w-16 h-16 mb-4" />

[NoCoverage] LogicalOperator
components/MSKExaminationListView.tsx:111:8
         ))}
       </div>
 
-      {mskExams.length === 0 && (
-        <div className="flex flex-col items-center justify-center py-32 opacity-20">
-          <Search className="w-16 h-16 mb-4" />
-          <p className="text-xl font-black uppercase tracking-widest">No MSK Modules Found</p>
-        </div>
-      )}
+      {mskExams.length === 0 || <div className="flex flex-col items-center justify-center py-32 opacity-20">
+          <Search className="w-16 h-16 mb-4" />
+          <p className="text-xl font-black uppercase tracking-widest">No MSK Modules Found</p>
+        </div>}
     </div>
   );
