[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:61:11
 const NEUROPRAXIA_DATA: NeuropraxiaCondition[] = [
   {
     id: 'tos',
-    name: 'Thoracic Outlet Syndrome (TOS)',
+    name: "",
     category: 'Entrapment',
     plexus: 'Brachial',

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:63:13
     id: 'tos',
     name: 'Thoracic Outlet Syndrome (TOS)',
     category: 'Entrapment',
-    plexus: 'Brachial',
+    plexus: "",
     clinicalFeatures: [
       'Upper limb pain/heaviness',

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:70:24
       'Coldness or pallor in hand (if vascular)',
       'Weakness in hand intrinsics'
     ],
-    sensationChanges: ['Paresthesia in C8/T1 distribution', 'Medial forearm numbness'],
+    sensationChanges: ["", 'Medial forearm numbness'],
     motorDeficits: [
       'Gilliatt-Sumner hand (atrophy of thenar/hypothenar eminence)',

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:70:61
       'Coldness or pallor in hand (if vascular)',
       'Weakness in hand intrinsics'
     ],
-    sensationChanges: ['Paresthesia in C8/T1 distribution', 'Medial forearm numbness'],
+    sensationChanges: ['Paresthesia in C8/T1 distribution', ""],
     motorDeficits: [
       'Gilliatt-Sumner hand (atrophy of thenar/hypothenar eminence)',

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:73:7
     sensationChanges: ['Paresthesia in C8/T1 distribution', 'Medial forearm numbness'],
     motorDeficits: [
       'Gilliatt-Sumner hand (atrophy of thenar/hypothenar eminence)',
-      'Weakness in finger abduction/adduction'
+      ""
     ],
     anatomy: {

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:76:26
       'Weakness in finger abduction/adduction'
     ],
     anatomy: {
-      dermatomes: ['C8', 'T1'],
+      dermatomes: ['C8', ""],
       myotomes: ['T1 (Finger Abduction)'],
       description:

[NoCoverage] ArrayDeclaration
components/NeuropraxiaView.tsx:77:17
     ],
     anatomy: {
       dermatomes: ['C8', 'T1'],
-      myotomes: ['T1 (Finger Abduction)'],
+      myotomes: [],
       description:
         'Compression at the scalene triangle, costoclavicular space, or sub-coracoid space. Usually involves the lower trunk (C8-T1).'

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:77:18
     ],
     anatomy: {
       dermatomes: ['C8', 'T1'],
-      myotomes: ['T1 (Finger Abduction)'],
+      myotomes: [""],
       description:
         'Compression at the scalene triangle, costoclavicular space, or sub-coracoid space. Usually involves the lower trunk (C8-T1).'

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:85:11
       {
         testName: "Adson's Maneuver",
         useCaseExample:
-          'Suspected compression at the Interscalene Triangle (Scalene Anticus Syndrome).',
+          "",
         method:

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:92:13
           positive:
             "A significant diminution or complete obliteration of the radial pulse, coupled with a replication of the patient's neurological symptoms.",
           negative:
-            'Radial pulse remains strong and symmetric; no paresthesias or pain are reproduced.'
+            ""
         },
         clinicalRelevance:

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:100:11
       {
         testName: "Military Brace (Eden's Test)",
         useCaseExample:
-          'Suspected compression in the Costoclavicular Space (between the clavicle and the 1st rib).',
+          "",
         method:

[NoCoverage] ObjectLiteral
components/NeuropraxiaView.tsx:103:33
           'Suspected compression in the Costoclavicular Space (between the clavicle and the 1st rib).',
         method:
-        findingsInterpretation: {
-          positive:
-            'Significant reduction or loss of the radial pulse, accompanied by the reproduction of shoulder or arm pain/paresthesia.',
-          negative: 'Pulse amplitude remains unchanged; no symptoms are replicated.'
-        },
+        findingsInterpretation: {},
         clinicalRelevance:
           'Suggests costoclavicular compression. Often positive in patients who wear heavy backpacks or have hypertrophied subclavius muscles.'

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:105:13
         findingsInterpretation: {
           positive:
-            'Significant reduction or loss of the radial pulse, accompanied by the reproduction of shoulder or arm pain/paresthesia.',
+            "",
           negative: 'Pulse amplitude remains unchanged; no symptoms are replicated.'
         },

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:112:19
           'Suggests costoclavicular compression. Often positive in patients who wear heavy backpacks or have hypertrophied subclavius muscles.'
       },
       {
-        testName: "Wright's Hyperabduction Test",
+        testName: "",
         useCaseExample: 'Suspected compression in the Subcoracoid or Pectoralis Minor Space.',
         method:

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:115:11
         testName: "Wright's Hyperabduction Test",
         useCaseExample: 'Suspected compression in the Subcoracoid or Pectoralis Minor Space.',
         method:
-          '1. Locate the radial pulse.\n2. Passive hyperabduction of the arm to 180 degrees with external rotation.\n3. Note when the radial pulse changes and if symptoms are reproduced.',
+          "",
         findingsInterpretation: {
           positive: 'Obliteration of the radial pulse and replication of upper limb paresthesias.',

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:117:21
         method:
           '1. Locate the radial pulse.\n2. Passive hyperabduction of the arm to 180 degrees with external rotation.\n3. Note when the radial pulse changes and if symptoms are reproduced.',
         findingsInterpretation: {
-          positive: 'Obliteration of the radial pulse and replication of upper limb paresthesias.',
+          positive: "",
           negative: 'Normal pulse volume is maintained; no neurological symptoms.'
         },

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:118:21
           '1. Locate the radial pulse.\n2. Passive hyperabduction of the arm to 180 degrees with external rotation.\n3. Note when the radial pulse changes and if symptoms are reproduced.',
         findingsInterpretation: {
           positive: 'Obliteration of the radial pulse and replication of upper limb paresthesias.',
-          negative: 'Normal pulse volume is maintained; no neurological symptoms.'
+          negative: ""
         },
         clinicalRelevance:

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:121:11
           negative: 'Normal pulse volume is maintained; no neurological symptoms.'
         },
         clinicalRelevance:
-          'Identifies entrapment under the pectoralis minor tendon near the coracoid process. Useful for differentiating distal vs. proximal TOS sites.'
+          ""
       },
       {

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:125:25
       },
       {
         testName: 'Roos Stress Test (East Test)',
-        useCaseExample: 'General screening and functional assessment for Thoracic Outlet Syndrome.',
+        useCaseExample: "",
         method:

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:144:9
     ]
   },
   {
-    id: 'cts',
+    id: "",
     name: 'Carpal Tunnel Syndrome (CTS)',
     category: 'Entrapment',

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:145:11
   },
   {
     id: 'cts',
-    name: 'Carpal Tunnel Syndrome (CTS)',
+    name: "",
     category: 'Entrapment',
     plexus: 'Other',

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:149:7
     category: 'Entrapment',
     plexus: 'Other',
     clinicalFeatures: [
-      'Paresthesia in radial 3.5 digits (thumb to ring finger)',
+      "",
       'Nocturnal pain / "Flick sign" (shaking hand for relief)',
       'Weakness in thumb opposition',

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:152:7
       'Paresthesia in radial 3.5 digits (thumb to ring finger)',
       'Nocturnal pain / "Flick sign" (shaking hand for relief)',
       'Weakness in thumb opposition',
-      'Ache in the forearm or shoulder (referred pain)'
+      ""
     ],
     sensationChanges: [

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:156:7
     ],
     sensationChanges: [
       'Numbness in the median nerve distribution (radial 3.5 fingers)',
-      'Key marker: Sparing of the palm (palmar cutaneous branch spares the tunnel)'
+      ""
     ],
     motorDeficits: [

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:161:7
     motorDeficits: [
       'Abductor Pollicis Brevis (Thumb Abduction)',
       'Opponens Pollicis (Opposition)',
-      'Thenar atrophy in chronic cases'
+      ""
     ],
     anatomy: {

[NoCoverage] ObjectLiteral
components/NeuropraxiaView.tsx:163:14
       'Opponens Pollicis (Opposition)',
       'Thenar atrophy in chronic cases'
     ],
-    anatomy: {
-      dermatomes: ['C6', 'C7', 'C8'],
-      myotomes: ['T1 (Thumb Abduction)'],
-      description:
-        'Compression of the median nerve beneath the transverse carpal ligament. Spares the thenar eminence sensation as the palmar cutaneous branch passes superficial to the retinaculum.'
-    },
+    anatomy: {},
     specialTests: [
       {

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:164:32
       'Thenar atrophy in chronic cases'
     ],
     anatomy: {
-      dermatomes: ['C6', 'C7', 'C8'],
+      dermatomes: ['C6', 'C7', ""],
       myotomes: ['T1 (Thumb Abduction)'],
       description:

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:167:9
       dermatomes: ['C6', 'C7', 'C8'],
       myotomes: ['T1 (Thumb Abduction)'],
       description:
-        'Compression of the median nerve beneath the transverse carpal ligament. Spares the thenar eminence sensation as the palmar cutaneous branch passes superficial to the retinaculum.'
+        ""
     },
     specialTests: [

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:171:19
     },
     specialTests: [
       {
-        testName: "Phalen's Wrist Flexion Test",
+        testName: "",
         useCaseExample: 'Suspected Carpal Tunnel Syndrome (median nerve compression at wrist).',
         method:

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:177:13
         findingsInterpretation: {
           positive:
-            'Development or worsening of paresthesias, numbness, or tingling in the median nerve distribution (thumb, index, middle, and radial half of ring finger).',
+            "",
           negative: 'No sensory changes or pain in the median nerve distribution after 60 seconds.'
         },

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:178:21
         findingsInterpretation: {
           positive:
             'Development or worsening of paresthesias, numbness, or tingling in the median nerve distribution (thumb, index, middle, and radial half of ring finger).',
-          negative: 'No sensory changes or pain in the median nerve distribution after 60 seconds.'
+          negative: ""
         },
         clinicalRelevance:

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:185:25
       },
       {
         testName: "Reverse Phalen's (Prayer Test)",
-        useCaseExample: 'Alternative provocative test for Carpal Tunnel Syndrome.',
+        useCaseExample: "",
         method:

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:196:19
           "Extension increases pressure in the carpal tunnel significantly (even higher than flexion), making it useful if standard Phalen's is equivocal."
       },
       {
-        testName: "Tinel's Tap at the Wrist",
+        testName: "",
         useCaseExample:
           'Assessing local nerve irritability or regenerating fibers in median nerve entrapment.',

[NoCoverage] ObjectLiteral
components/NeuropraxiaView.tsx:201:33
           'Assessing local nerve irritability or regenerating fibers in median nerve entrapment.',
         method:
-        findingsInterpretation: {
-          positive:
-            'A sudden, electric shock-like sensation, tingling, or paresthesia radiating into the median-innervated digits.',
-          negative: 'No radiating paresthesias; only local tapping sensation.'
-        },
+        findingsInterpretation: {},
         clinicalRelevance:
           "Sensitivity ~50%, Specificity ~77%. Useful for tracking nerve recovery: a positive Tinel's sign that migrates distally over time indicates axonal regeneration."

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:203:13
         findingsInterpretation: {
           positive:
-            'A sudden, electric shock-like sensation, tingling, or paresthesia radiating into the median-innervated digits.',
+            "",
           negative: 'No radiating paresthesias; only local tapping sensation.'
         },

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:204:21
         findingsInterpretation: {
           positive:
             'A sudden, electric shock-like sensation, tingling, or paresthesia radiating into the median-innervated digits.',
-          negative: 'No radiating paresthesias; only local tapping sensation.'
+          negative: ""
         },
         clinicalRelevance:

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:211:7
       }
     ],
     pearls: [
-      'Most common entrapment neuropathy.',
+      "",
       'Sparing of the thenar eminence (palm) differentiates CTS from a more proximal median nerve lesion.',
       'Check for systemic associations: Diabetes, Hypothyroidism, Pregnancy, RA.'

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:219:15
   {
     id: 'sciatic',
     name: 'Sciatic Nerve Entrapment (Piriformis Syndrome)',
-    category: 'Entrapment',
+    category: "",
     plexus: 'Lumbosacral',
     clinicalFeatures: [

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:220:13
     id: 'sciatic',
     name: 'Sciatic Nerve Entrapment (Piriformis Syndrome)',
     category: 'Entrapment',
-    plexus: 'Lumbosacral',
+    plexus: "",
     clinicalFeatures: [
       'Deep buttock pain',

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:224:7
     clinicalFeatures: [
       'Deep buttock pain',
       'Sciatic-like pain down the thigh',
-      'Aggravated by prolonged sitting'
+      ""
     ],
     sensationChanges: ['Lateral leg and foot numbness', 'Posterior thigh paresthesia'],

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:226:24
       'Sciatic-like pain down the thigh',
       'Aggravated by prolonged sitting'
     ],
-    sensationChanges: ['Lateral leg and foot numbness', 'Posterior thigh paresthesia'],
+    sensationChanges: ["", 'Posterior thigh paresthesia'],
     motorDeficits: ['Weakness in knee flexion (Hamstrings)', 'Weakness in foot inversion/eversion'],
     anatomy: {

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:226:57
       'Sciatic-like pain down the thigh',
       'Aggravated by prolonged sitting'
     ],
-    sensationChanges: ['Lateral leg and foot numbness', 'Posterior thigh paresthesia'],
+    sensationChanges: ['Lateral leg and foot numbness', ""],
     motorDeficits: ['Weakness in knee flexion (Hamstrings)', 'Weakness in foot inversion/eversion'],
     anatomy: {

[NoCoverage] ArrayDeclaration
components/NeuropraxiaView.tsx:227:20
       'Aggravated by prolonged sitting'
     ],
     sensationChanges: ['Lateral leg and foot numbness', 'Posterior thigh paresthesia'],
-    motorDeficits: ['Weakness in knee flexion (Hamstrings)', 'Weakness in foot inversion/eversion'],
+    motorDeficits: [],
     anatomy: {
       dermatomes: ['L4', 'L5', 'S1', 'S2', 'S3'],

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:227:21
       'Aggravated by prolonged sitting'
     ],
     sensationChanges: ['Lateral leg and foot numbness', 'Posterior thigh paresthesia'],
-    motorDeficits: ['Weakness in knee flexion (Hamstrings)', 'Weakness in foot inversion/eversion'],
+    motorDeficits: ["", 'Weakness in foot inversion/eversion'],
     anatomy: {
       dermatomes: ['L4', 'L5', 'S1', 'S2', 'S3'],

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:229:44
     sensationChanges: ['Lateral leg and foot numbness', 'Posterior thigh paresthesia'],
     motorDeficits: ['Weakness in knee flexion (Hamstrings)', 'Weakness in foot inversion/eversion'],
     anatomy: {
-      dermatomes: ['L4', 'L5', 'S1', 'S2', 'S3'],
+      dermatomes: ['L4', 'L5', 'S1', 'S2', ""],
       myotomes: ['L5 (Dorsiflexion)', 'S1 (Plantarflexion)'],
       description:

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:229:20
     sensationChanges: ['Lateral leg and foot numbness', 'Posterior thigh paresthesia'],
     motorDeficits: ['Weakness in knee flexion (Hamstrings)', 'Weakness in foot inversion/eversion'],
     anatomy: {
-      dermatomes: ['L4', 'L5', 'S1', 'S2', 'S3'],
+      dermatomes: ["", 'L5', 'S1', 'S2', 'S3'],
       myotomes: ['L5 (Dorsiflexion)', 'S1 (Plantarflexion)'],
       description:

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:245:13
           positive:
             'Reproduction of sharp, radicular pain shooting down the posterior leg below the knee (suggests disc herniation/L5-S1 root compression).',
           negative:
-            'No radicular pain below the knee (local hamstring tightness or buttock-only pain is negative).'
+            ""
         },
         clinicalRelevance:

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:257:9
     ]
   },
   {
-    id: 'obturator',
+    id: "",
     name: 'Obturator Nerve Entrapment',
     category: 'Entrapment',

[NoCoverage] ArrayDeclaration
components/NeuropraxiaView.tsx:261:23
     name: 'Obturator Nerve Entrapment',
     category: 'Entrapment',
     plexus: 'Lumbosacral',
-    clinicalFeatures: [
-      'Medial thigh pain/paresthesia',
-      'Groin pain aggravated by adduction',
-      'Often secondary to pelvic surgery or trauma'
-    ],
+    clinicalFeatures: [],
     sensationChanges: ['Small area of numbness on the medial distal thigh'],
     motorDeficits: [

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:266:24
       'Groin pain aggravated by adduction',
       'Often secondary to pelvic surgery or trauma'
     ],
-    sensationChanges: ['Small area of numbness on the medial distal thigh'],
+    sensationChanges: [""],
     motorDeficits: [
       'Weakness in thigh adduction (Adductor Longus/Magnus/Brevis)',

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:275:9
       dermatomes: ['L2', 'L3', 'L4'],
       myotomes: ['L3 (Thigh Adduction)'],
       description:
-        'Arises from L2-L4. Passes through the obturator canal. Supplies adductors and medial thigh skin.'
+        ""
     },
     specialTests: [

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:279:19
     },
     specialTests: [
       {
-        testName: 'Hip Internal/External Rotation Test',
+        testName: "",
         useCaseExample:
           'Differentiating obturator nerve entrapment from hip joint arthritis or labral tears.',

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:281:11
       {
         testName: 'Hip Internal/External Rotation Test',
         useCaseExample:
-          'Differentiating obturator nerve entrapment from hip joint arthritis or labral tears.',
+          "",
         method:

[NoCoverage] ArrayDeclaration
components/NeuropraxiaView.tsx:294:13
           'Helps rule out primary hip pathology. If rotation replicates medial thigh paresthesias, it points to compression of the obturator nerve within the obturator canal.'
       }
     ],
-    pearls: [
-      'Howship-Romberg sign: Inner thigh pain with hip extension/adduction (seen in obturator hernia).'
-    ]
+    pearls: []
   },
   {

[NoCoverage] ArrayDeclaration
components/NeuropraxiaView.tsx:308:20
       'Loss of sensation in lateral shoulder/arm'
     ],
     sensationChanges: ['C5/C6 dermatomes (Lateral shoulder, forearm)'],
-    motorDeficits: [
-      'Deltoid (Abduction)',
-      'Biceps (Flexion/Supination)',
-      'Infraspinatus (External rotation)'
-    ],
+    motorDeficits: [],
     anatomy: {
       dermatomes: ['C5', 'C6'],

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:309:7
     ],
     sensationChanges: ['C5/C6 dermatomes (Lateral shoulder, forearm)'],
     motorDeficits: [
-      'Deltoid (Abduction)',
+      "",
       'Biceps (Flexion/Supination)',
       'Infraspinatus (External rotation)'

[NoCoverage] ObjectLiteral
components/NeuropraxiaView.tsx:313:14
       'Biceps (Flexion/Supination)',
       'Infraspinatus (External rotation)'
     ],
-    anatomy: {
-      dermatomes: ['C5', 'C6'],
-      myotomes: ['C5 (Abduction)', 'C6 (Flexion)'],
-      description:
-        'Upper trunk lesion (C5-C6 roots). Often due to excessive lateral neck stretch during birth or trauma.'
-    },
+    anatomy: {},
     specialTests: [
       {

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:314:26
       'Infraspinatus (External rotation)'
     ],
     anatomy: {
-      dermatomes: ['C5', 'C6'],
+      dermatomes: ['C5', ""],
       myotomes: ['C5 (Abduction)', 'C6 (Flexion)'],
       description:

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:315:36
     ],
     anatomy: {
       dermatomes: ['C5', 'C6'],
-      myotomes: ['C5 (Abduction)', 'C6 (Flexion)'],
+      myotomes: ['C5 (Abduction)', ""],
       description:
         'Upper trunk lesion (C5-C6 roots). Often due to excessive lateral neck stretch during birth or trauma.'

[NoCoverage] ArrayDeclaration
components/NeuropraxiaView.tsx:315:17
     ],
     anatomy: {
       dermatomes: ['C5', 'C6'],
-      myotomes: ['C5 (Abduction)', 'C6 (Flexion)'],
+      myotomes: [],
       description:
         'Upper trunk lesion (C5-C6 roots). Often due to excessive lateral neck stretch during birth or trauma.'

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:321:19
     },
     specialTests: [
       {
-        testName: "Cervical Spine Spurling's Test",
+        testName: "",
         useCaseExample:
           "Differentiating Erb's Palsy (upper trunk plexopathy) from acute C5/C6 cervical radiculopathy.",

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:339:11
   },
   {
     id: 'radial-palsy',
-    name: 'Radial Nerve Palsy (Saturday Night Palsy)',
+    name: "",
     category: 'Neuropraxia',
     plexus: 'Brachial',

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:343:7
     category: 'Neuropraxia',
     plexus: 'Brachial',
     clinicalFeatures: [
-      'Wrist drop (extensor weakness)',
+      "",
       'Weakness in finger extension at MCP joints',
       'Weakness in thumb abduction'

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:347:24
       'Weakness in finger extension at MCP joints',
       'Weakness in thumb abduction'
     ],
-    sensationChanges: ['Numbness on the dorsal aspect of the first web space'],
+    sensationChanges: [""],
     motorDeficits: [
       'Extensor carpi radialis (Wrist extension)',

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:350:7
     sensationChanges: ['Numbness on the dorsal aspect of the first web space'],
     motorDeficits: [
       'Extensor carpi radialis (Wrist extension)',
-      'Brachioradialis (Flexion in mid-prone)',
+      "",
       'Triceps (if lesion is high in the axilla)'
     ],

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:361:19
     },
     specialTests: [
       {
-        testName: 'Triceps Strength Check',
+        testName: "",
         useCaseExample: 'Localizing a radial nerve lesion (spiral groove vs. axillary level).',
         method:

[NoCoverage] ObjectLiteral
components/NeuropraxiaView.tsx:365:33
         useCaseExample: 'Localizing a radial nerve lesion (spiral groove vs. axillary level).',
         method:
           "1. Flex the patient's elbow to 90 degrees.\n2. Instruct the patient to extend the elbow against your resistance.\n3. Palpate the triceps muscle belly to assess contraction.",
-        findingsInterpretation: {
-          positive:
-            'Normal triceps strength with coexisting wrist drop (indicates a distal compression at the spiral groove, sparing the triceps branches).',
-          negative:
-            'Weakness in triceps extension and wrist extension (indicates a high radial nerve lesion in the axilla or a C7 radiculopathy).'
-        },
+        findingsInterpretation: {},
         clinicalRelevance:

[NoCoverage] ArrayDeclaration
components/NeuropraxiaView.tsx:375:13
       }
     ],
-    pearls: [
-      'Supeination is preserved (Biceps - Musculocutaneous).',
-      'Crutch palsy involves the axilla.'
-    ]
+    pearls: []
   },
   {

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:377:7
     ],
     pearls: [
       'Supeination is preserved (Biceps - Musculocutaneous).',
-      'Crutch palsy involves the axilla.'
+      ""
     ]
   },

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:382:11
   },
   {
     id: 'peroneal-palsy',
-    name: 'Common Peroneal Nerve Palsy',
+    name: "",
     category: 'Neuropraxia',
     plexus: 'Lumbosacral',

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:383:15
   {
     id: 'peroneal-palsy',
     name: 'Common Peroneal Nerve Palsy',
-    category: 'Neuropraxia',
+    category: "",
     plexus: 'Lumbosacral',
     clinicalFeatures: [

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:384:13
     id: 'peroneal-palsy',
     name: 'Common Peroneal Nerve Palsy',
     category: 'Neuropraxia',
-    plexus: 'Lumbosacral',
+    plexus: "",
     clinicalFeatures: [
       'Foot drop (weakness in dorsiflexion)',

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:387:7
     plexus: 'Lumbosacral',
     clinicalFeatures: [
       'Foot drop (weakness in dorsiflexion)',
-      'Slapping gait',
+      "",
       'Often due to habitual leg crossing or compression at the fibular head'
     ],

[NoCoverage] ArrayDeclaration
components/NeuropraxiaView.tsx:390:23
       'Slapping gait',
       'Often due to habitual leg crossing or compression at the fibular head'
     ],
-    sensationChanges: ['Numbness on the lateral leg and dorsal foot'],
+    sensationChanges: [],
     motorDeficits: [
       'Tibialis Anterior (Dorsiflexion)',

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:393:7
     sensationChanges: ['Numbness on the lateral leg and dorsal foot'],
     motorDeficits: [
       'Tibialis Anterior (Dorsiflexion)',
-      'Extensor Digitorum (Toe extension)',
+      "",
       'Peroneals (Eversion)'
     ],

[NoCoverage] ObjectLiteral
components/NeuropraxiaView.tsx:396:14
       'Extensor Digitorum (Toe extension)',
       'Peroneals (Eversion)'
     ],
-    anatomy: {
-      dermatomes: ['L4', 'L5', 'S1'],
-      myotomes: ['L4/L5 (Dorsiflexion)'],
-      description:
-        'Common Fibular (Peroneal) nerve splits into deep and superficial at the neck of the fibula.'
-    },
+    anatomy: {},
     specialTests: [
       {

[NoCoverage] ArrayDeclaration
components/NeuropraxiaView.tsx:398:17
     ],
     anatomy: {
       dermatomes: ['L4', 'L5', 'S1'],
-      myotomes: ['L4/L5 (Dorsiflexion)'],
+      myotomes: [],
       description:
         'Common Fibular (Peroneal) nerve splits into deep and superficial at the neck of the fibula.'

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:400:9
       dermatomes: ['L4', 'L5', 'S1'],
       myotomes: ['L4/L5 (Dorsiflexion)'],
       description:
-        'Common Fibular (Peroneal) nerve splits into deep and superficial at the neck of the fibula.'
+        ""
     },
     specialTests: [

[NoCoverage] ArrayDeclaration
components/NeuropraxiaView.tsx:402:19
       description:
         'Common Fibular (Peroneal) nerve splits into deep and superficial at the neck of the fibula.'
     },
-    specialTests: [
-      {
-        testName: 'Foot Inversion Check',
-        useCaseExample:
-          'Differentiating common peroneal nerve palsy at the fibular neck from an L5 radiculopathy.',
-        method:
-          "1. Support the patient's ankle.\n2. Instruct the patient to turn their foot inward (inversion) against your resistance.\n3. Palpate the tibialis posterior tendon.",
-        findingsInterpretation: {
-          positive:
-            'Normal inversion strength in the presence of foot drop (confirms peroneal nerve palsy, as inversion is mediated by the tibial nerve).',
-          negative:
-            'Weakness in both dorsiflexion/eversion and inversion (points to an L5 radiculopathy, as L5 supplies both tibial and peroneal nerve pathways).'
-        },
-        clinicalRelevance:
-          'Crucial OSCE differentiator. Peroneal nerve palsy spares foot inversion, while L5 radiculopathy compromises it because the tibialis posterior is innervated by the tibial nerve (L5 root).'
-      }
-    ],
+    specialTests: [],
     pearls: [
       'The most common entrapment neuropathy in the lower limb.',

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:404:19
     },
     specialTests: [
       {
-        testName: 'Foot Inversion Check',
+        testName: "",
         useCaseExample:
           'Differentiating common peroneal nerve palsy at the fibular neck from an L5 radiculopathy.',
