[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:408:11
         useCaseExample:
           'Differentiating common peroneal nerve palsy at the fibular neck from an L5 radiculopathy.',
         method:
-          "1. Support the patient's ankle.\n2. Instruct the patient to turn their foot inward (inversion) against your resistance.\n3. Palpate the tibialis posterior tendon.",
+          "",
         findingsInterpretation: {
           positive:

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:413:13
           positive:
             'Normal inversion strength in the presence of foot drop (confirms peroneal nerve palsy, as inversion is mediated by the tibial nerve).',
           negative:
-            'Weakness in both dorsiflexion/eversion and inversion (points to an L5 radiculopathy, as L5 supplies both tibial and peroneal nerve pathways).'
+            ""
         },
         clinicalRelevance:

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:416:11
             'Weakness in both dorsiflexion/eversion and inversion (points to an L5 radiculopathy, as L5 supplies both tibial and peroneal nerve pathways).'
         },
         clinicalRelevance:
-          'Crucial OSCE differentiator. Peroneal nerve palsy spares foot inversion, while L5 radiculopathy compromises it because the tibialis posterior is innervated by the tibial nerve (L5 root).'
+          ""
       }
     ],

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:429:50
 const gemini = new GeminiService();
 
 export const NeuropraxiaView: React.FC = () => {
-  const [searchQuery, setSearchQuery] = useState('');
+  const [searchQuery, setSearchQuery] = useState("Stryker was here!");
   const [selectedId, setSelectedId] = useState<string | null>(null);
   const [isIllustrationLoading, setIsIllustrationLoading] = useState(false);

[NoCoverage] BooleanLiteral
components/NeuropraxiaView.tsx:431:70
 export const NeuropraxiaView: React.FC = () => {
   const [searchQuery, setSearchQuery] = useState('');
   const [selectedId, setSelectedId] = useState<string | null>(null);
-  const [isIllustrationLoading, setIsIllustrationLoading] = useState(false);
+  const [isIllustrationLoading, setIsIllustrationLoading] = useState(true);
   const [illustrationUrl, setIllustrationUrl] = useState<string | null>(null);
   const [enlargedImage, setEnlargedImage] = useState<{ src: string; alt: string } | null>(null);

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:438:6
   const { results: filteredConditions, didYouMean } = useClinicalSearch(
     NEUROPRAXIA_DATA,
     searchQuery,
-    ['name', 'plexus', 'category']
+    ["", 'plexus', 'category']
   );
 

[NoCoverage] ConditionalExpression
components/NeuropraxiaView.tsx:442:40
   );
 
   const activeCondition = useMemo(
-    () => NEUROPRAXIA_DATA.find((c) => c.id === selectedId),
+    () => NEUROPRAXIA_DATA.find((c) => true),
     [selectedId]
   );

[NoCoverage] ArrowFunction
components/NeuropraxiaView.tsx:442:33
   );
 
   const activeCondition = useMemo(
-    () => NEUROPRAXIA_DATA.find((c) => c.id === selectedId),
+    () => NEUROPRAXIA_DATA.find(() => undefined),
     [selectedId]
   );

[NoCoverage] BooleanLiteral
components/NeuropraxiaView.tsx:449:30
   const handleSelect = async (id: string) => {
     setSelectedId(id);
     setIllustrationUrl(null);
-    setIsIllustrationLoading(true);
+    setIsIllustrationLoading(false);
 
     // Generate an illustration for the specific plexus anatomy

[NoCoverage] EqualityOperator
components/NeuropraxiaView.tsx:452:52
     setIsIllustrationLoading(true);
 
     // Generate an illustration for the specific plexus anatomy
-    const condition = NEUROPRAXIA_DATA.find((c) => c.id === id);
+    const condition = NEUROPRAXIA_DATA.find((c) => c.id !== id);
     if (condition) {
       try {

[NoCoverage] ArrowFunction
components/NeuropraxiaView.tsx:452:45
     setIsIllustrationLoading(true);
 
     // Generate an illustration for the specific plexus anatomy
-    const condition = NEUROPRAXIA_DATA.find((c) => c.id === id);
+    const condition = NEUROPRAXIA_DATA.find(() => undefined);
     if (condition) {
       try {

[NoCoverage] ConditionalExpression
components/NeuropraxiaView.tsx:453:9
 
     // Generate an illustration for the specific plexus anatomy
     const condition = NEUROPRAXIA_DATA.find((c) => c.id === id);
-    if (condition) {
+    if (true) {
       try {
         const url = await gemini.generateIllustration(

[NoCoverage] ConditionalExpression
components/NeuropraxiaView.tsx:453:9
 
     // Generate an illustration for the specific plexus anatomy
     const condition = NEUROPRAXIA_DATA.find((c) => c.id === id);
-    if (condition) {
+    if (false) {
       try {
         const url = await gemini.generateIllustration(

[NoCoverage] BooleanLiteral
components/NeuropraxiaView.tsx:457:11
       try {
         const url = await gemini.generateIllustration(
-          false
+          true
         );
         setIllustrationUrl(url || null);

[NoCoverage] ConditionalExpression
components/NeuropraxiaView.tsx:459:28
           false
         );
-        setIllustrationUrl(url || null);
+        setIllustrationUrl(true);
       } catch (e) {
         console.error('Failed to generate anatomy illustration', e);

[NoCoverage] LogicalOperator
components/NeuropraxiaView.tsx:459:28
           false
         );
-        setIllustrationUrl(url || null);
+        setIllustrationUrl(url && null);
       } catch (e) {
         console.error('Failed to generate anatomy illustration', e);

[NoCoverage] BlockStatement
components/NeuropraxiaView.tsx:460:19
           false
         );
         setIllustrationUrl(url || null);
-      } catch (e) {
-        console.error('Failed to generate anatomy illustration', e);
-      } finally {
+      } catch (e) {} finally {
         setIsIllustrationLoading(false);
       }

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:461:23
         );
         setIllustrationUrl(url || null);
       } catch (e) {
-        console.error('Failed to generate anatomy illustration', e);
+        console.error("", e);
       } finally {
         setIsIllustrationLoading(false);

[NoCoverage] BlockStatement
components/NeuropraxiaView.tsx:462:17
         setIllustrationUrl(url || null);
       } catch (e) {
         console.error('Failed to generate anatomy illustration', e);
-      } finally {
-        setIsIllustrationLoading(false);
-      }
+      } finally {}
     }
   };

[NoCoverage] BooleanLiteral
components/NeuropraxiaView.tsx:463:34
       } catch (e) {
         console.error('Failed to generate anatomy illustration', e);
       } finally {
-        setIsIllustrationLoading(false);
+        setIsIllustrationLoading(true);
       }
     }

[NoCoverage] ConditionalExpression
components/NeuropraxiaView.tsx:500:12
             />
           </div>
 
-          {didYouMean && (
-            <div className="flex justify-start">
-              <button
-                onClick={() => setSearchQuery(didYouMean)}
-                className="flex items-center gap-2 px-4 py-2 bg-orange-50 hover:bg-orange-100 text-orange-600 rounded-xl transition-all shadow-sm w-full"
-              >
-                <span className="text-[10px] font-black uppercase tracking-widest text-orange-400 shrink-0">
-                  Did you mean
-                </span>
-                <span className="text-xs font-bold border-b border-orange-600 border-dashed truncate">
-                  {didYouMean}
-                </span>
-                <span className="text-[10px] font-black uppercase tracking-widest text-orange-400 shrink-0">
-                  ?
-                </span>
-              </button>
-            </div>
-          )}
+          {true}
 
           <div className="space-y-3">

[NoCoverage] ConditionalExpression
components/NeuropraxiaView.tsx:500:12
             />
           </div>
 
-          {didYouMean && (
-            <div className="flex justify-start">
-              <button
-                onClick={() => setSearchQuery(didYouMean)}
-                className="flex items-center gap-2 px-4 py-2 bg-orange-50 hover:bg-orange-100 text-orange-600 rounded-xl transition-all shadow-sm w-full"
-              >
-                <span className="text-[10px] font-black uppercase tracking-widest text-orange-400 shrink-0">
-                  Did you mean
-                </span>
-                <span className="text-xs font-bold border-b border-orange-600 border-dashed truncate">
-                  {didYouMean}
-                </span>
-                <span className="text-[10px] font-black uppercase tracking-widest text-orange-400 shrink-0">
-                  ?
-                </span>
-              </button>
-            </div>
-          )}
+          {false}
 
           <div className="space-y-3">

[NoCoverage] ArrowFunction
components/NeuropraxiaView.tsx:523:26
             {filteredConditions.map((c) => (
               <button
                 key={c.id}
-                onClick={() => handleSelect(c.id)}
+                onClick={() => undefined}
                 className={`w-full flex items-center gap-4 p-4 rounded-2xl transition-all text-left group ${
                   selectedId === c.id

[NoCoverage] EqualityOperator
components/NeuropraxiaView.tsx:525:19
                 key={c.id}
                 onClick={() => handleSelect(c.id)}
                 className={`w-full flex items-center gap-4 p-4 rounded-2xl transition-all text-left group ${
-                  selectedId === c.id
+                  selectedId !== c.id
                     ? 'bg-orange-600 text-white shadow-xl shadow-orange-200'
                     : 'bg-slate-950/40 border border-white/5 text-slate-400 hover:border-orange-200 hover:bg-orange-50/30'

[NoCoverage] ConditionalExpression
components/NeuropraxiaView.tsx:525:19
                 key={c.id}
                 onClick={() => handleSelect(c.id)}
                 className={`w-full flex items-center gap-4 p-4 rounded-2xl transition-all text-left group ${
-                  selectedId === c.id
+                  true
                     ? 'bg-orange-600 text-white shadow-xl shadow-orange-200'
                     : 'bg-slate-950/40 border border-white/5 text-slate-400 hover:border-orange-200 hover:bg-orange-50/30'

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:527:23
                 className={`w-full flex items-center gap-4 p-4 rounded-2xl transition-all text-left group ${
                   selectedId === c.id
                     ? 'bg-orange-600 text-white shadow-xl shadow-orange-200'
-                    : 'bg-slate-950/40 border border-white/5 text-slate-400 hover:border-orange-200 hover:bg-orange-50/30'
+                    : ""
                 }`}
               >

[NoCoverage] EqualityOperator
components/NeuropraxiaView.tsx:532:21
               >
                 <div
                   className={`w-12 h-12 rounded-xl flex items-center justify-center transition-colors ${
-                    selectedId === c.id
+                    selectedId !== c.id
                       ? 'bg-slate-950/40/20'
                       : 'bg-orange-50 text-orange-600 group-hover:bg-orange-100'

[NoCoverage] ConditionalExpression
components/NeuropraxiaView.tsx:532:21
               >
                 <div
                   className={`w-12 h-12 rounded-xl flex items-center justify-center transition-colors ${
-                    selectedId === c.id
+                    true
                       ? 'bg-slate-950/40/20'
                       : 'bg-orange-50 text-orange-600 group-hover:bg-orange-100'

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:534:25
                   className={`w-12 h-12 rounded-xl flex items-center justify-center transition-colors ${
                     selectedId === c.id
                       ? 'bg-slate-950/40/20'
-                      : 'bg-orange-50 text-orange-600 group-hover:bg-orange-100'
+                      : ""
                   }`}
                 >

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:541:32
                 </div>
                 <div className="flex-1 min-w-0">
                   <div
-                    className={`text-xs font-black uppercase tracking-widest mb-0.5 ${
-                      selectedId === c.id ? 'text-orange-100' : 'text-orange-600'
-                    }`}
+                    className={``}
                   >
                     {c.category}

[NoCoverage] ConditionalExpression
components/NeuropraxiaView.tsx:542:23
                 <div className="flex-1 min-w-0">
                   <div
                     className={`text-xs font-black uppercase tracking-widest mb-0.5 ${
-                      selectedId === c.id ? 'text-orange-100' : 'text-orange-600'
+                      false ? 'text-orange-100' : 'text-orange-600'
                     }`}
                   >

[NoCoverage] ConditionalExpression
components/NeuropraxiaView.tsx:542:23
                 <div className="flex-1 min-w-0">
                   <div
                     className={`text-xs font-black uppercase tracking-widest mb-0.5 ${
-                      selectedId === c.id ? 'text-orange-100' : 'text-orange-600'
+                      true ? 'text-orange-100' : 'text-orange-600'
                     }`}
                   >

[NoCoverage] EqualityOperator
components/NeuropraxiaView.tsx:550:62
                   <div className="font-bold truncate">{c.name}</div>
                 </div>
                 <ChevronRight
-                  className={`w-4 h-4 transition-transform ${selectedId === c.id ? 'rotate-90 text-white' : 'text-slate-300 group-hover:translate-x-1'}`}
+                  className={`w-4 h-4 transition-transform ${selectedId !== c.id ? 'rotate-90 text-white' : 'text-slate-300 group-hover:translate-x-1'}`}
                 />
               </button>

[NoCoverage] ConditionalExpression
components/NeuropraxiaView.tsx:550:62
                   <div className="font-bold truncate">{c.name}</div>
                 </div>
                 <ChevronRight
-                  className={`w-4 h-4 transition-transform ${selectedId === c.id ? 'rotate-90 text-white' : 'text-slate-300 group-hover:translate-x-1'}`}
+                  className={`w-4 h-4 transition-transform ${false ? 'rotate-90 text-white' : 'text-slate-300 group-hover:translate-x-1'}`}
                 />
               </button>

[NoCoverage] ArrowFunction
components/NeuropraxiaView.tsx:597:63
                         <AlertTriangle className="w-4 h-4 text-orange-500" /> Clinical Features
                       </h3>
                       <ul className="space-y-4">
-                        {activeCondition.clinicalFeatures.map((f, i) => (
-                          <li key={i} className="flex gap-4">
-                            <div className="w-1.5 h-1.5 rounded-full bg-orange-200 mt-2 shrink-0" />
-                            <span className="text-sm font-bold text-slate-400 leading-relaxed">
-                              {f}
-                            </span>
-                          </li>
-                        ))}
+                        {activeCondition.clinicalFeatures.map(() => undefined)}
                       </ul>
                     </div>

[NoCoverage] ArrowFunction
components/NeuropraxiaView.tsx:618:67
                             Sensory Loss
                           </div>
                           <ul className="space-y-3">
-                            {activeCondition.sensationChanges.map((s, i) => (
-                              <li key={i} className="text-xs font-bold text-slate-400">
-                                {s}
-                              </li>
-                            ))}
+                            {activeCondition.sensationChanges.map(() => undefined)}
                           </ul>
                         </div>

[NoCoverage] ArrowFunction
components/NeuropraxiaView.tsx:630:64
                             Motor Deficits
                           </div>
                           <ul className="space-y-3">
-                            {activeCondition.motorDeficits.map((m, i) => (
-                              <li key={i} className="text-xs font-bold text-slate-400">
-                                {m}
-                              </li>
-                            ))}
+                            {activeCondition.motorDeficits.map(() => undefined)}
                           </ul>
                         </div>

[NoCoverage] StringLiteral
components/NeuropraxiaView.tsx:657:61
                           alt={activeCondition.name}
                           label="Anatomy"
                           className="w-full h-full object-cover"
-                          config={{ size: 'full', position: 'top' }}
+                          config={{ size: 'full', position: "" }}
                           onEnlarge={(src, alt) => setEnlargedImage({ src, alt })}
                         />

[NoCoverage] ObjectLiteral
components/NeuropraxiaView.tsx:657:35
                           alt={activeCondition.name}
                           label="Anatomy"
                           className="w-full h-full object-cover"
-                          config={{ size: 'full', position: 'top' }}
+                          config={{}}
                           onEnlarge={(src, alt) => setEnlargedImage({ src, alt })}
                         />

[NoCoverage] ArrowFunction
components/NeuropraxiaView.tsx:658:38
                           label="Anatomy"
                           className="w-full h-full object-cover"
                           config={{ size: 'full', position: 'top' }}
-                          onEnlarge={(src, alt) => setEnlargedImage({ src, alt })}
+                          onEnlarge={() => undefined}
                         />
                       ) : (

[NoCoverage] ArrowFunction
components/NeuropraxiaView.tsx:670:67
                           Dermatomes / Myotomes
                         </div>
                         <div className="flex gap-2">
-                          {activeCondition.anatomy.dermatomes.map((d) => (
-                            <span
-                              key={d}
-                              className="px-2 py-0.5 bg-slate-950/40/10 rounded text-[9px] font-bold text-white uppercase"
-                            >
-                              {d}
-                            </span>
-                          ))}
+                          {activeCondition.anatomy.dermatomes.map(() => undefined)}
                         </div>
                       </div>

[NoCoverage] ArithmeticOperator
components/NeuropraxiaView.tsx:707:30
                       >
                         <div className="flex items-center gap-4 border-b border-white/5 pb-3">
                           <div className="w-8 h-8 rounded-full bg-orange-600 flex items-center justify-center text-white text-xs font-black">
-                            {i + 1}
+                            {i - 1}
                           </div>
                           <div>

[NoCoverage] ArrowFunction
components/NeuropraxiaView.tsx:762:47
 
                 {/* Pearls */}
                 <div className="grid grid-cols-1 md:grid-cols-3 gap-6">
-                  {activeCondition.pearls.map((p, i) => (
-                    <div
-                      key={i}
-                      className="p-6 bg-slate-950/40 border border-white/5 rounded-3xl group hover:border-orange-200 transition-all"
-                    >
-                      <Zap className="w-5 h-5 text-orange-400 mb-4 group-hover:scale-110 transition-transform" />
-                      <p className="text-xs font-bold text-slate-400 leading-relaxed">{p}</p>
-                    </div>
-                  ))}
+                  {activeCondition.pearls.map(() => undefined)}
                 </div>
               </motion.div>
