[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:20:66
 type PharmacologyToxTab = 'atods' | 'toxidromes' | 'agitation';
 
 export const PharmacologyToxView: React.FC = () => {
-  const [activeTab, setActiveTab] = useState<PharmacologyToxTab>('atods');
+  const [activeTab, setActiveTab] = useState<PharmacologyToxTab>("");
   const [searchQuery, setSearchQuery] = useState('');
 

[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:26:18
   const { results: filteredATODs, didYouMean: didYouMeanATODs } = useClinicalSearch(
     ATODS_DATA,
     searchQuery,
-    ['category', 'substances']
+    ['category', ""]
   );
 

[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:32:15
   const { results: filteredAgitation, didYouMean: didYouMeanAgitation } = useClinicalSearch(
     AGITATION_MANAGEMENT,
     searchQuery,
-    ['class', 'medications']
+    ['class', ""]
   );
 

[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:38:14
   const { results: filteredToxidromes, didYouMean: didYouMeanToxidromes } = useClinicalSearch(
     TOXIDROMES_DATA,
     searchQuery,
-    ['name', 'features']
+    ['name', ""]
   );
 

[NoCoverage] ConditionalExpression
components/PharmacologyToxView.tsx:41:22
     ['name', 'features']
   );
 
-  const didYouMean = didYouMeanATODs || didYouMeanAgitation || didYouMeanToxidromes;
+  const didYouMean = false;
 
   return (

[NoCoverage] ConditionalExpression
components/PharmacologyToxView.tsx:41:22
     ['name', 'features']
   );
 
-  const didYouMean = didYouMeanATODs || didYouMeanAgitation || didYouMeanToxidromes;
+  const didYouMean = false || didYouMeanToxidromes;
 
   return (

[NoCoverage] ArrowFunction
components/PharmacologyToxView.tsx:62:20
       {/* Tabs */}
       <div className="flex bg-slate-950/80 p-1.5 rounded-2xl mb-12 w-fit border border-white/5">
         <button
-          onClick={() => setActiveTab('atods')}
+          onClick={() => undefined}
           className={`flex items-center gap-2 px-6 py-3 rounded-xl text-[11px] font-black uppercase tracking-widest transition-all cursor-pointer ${
             activeTab === 'atods'

[NoCoverage] EqualityOperator
components/PharmacologyToxView.tsx:64:13
         <button
           onClick={() => setActiveTab('atods')}
           className={`flex items-center gap-2 px-6 py-3 rounded-xl text-[11px] font-black uppercase tracking-widest transition-all cursor-pointer ${
-            activeTab === 'atods'
+            activeTab !== 'atods'
               ? 'bg-indigo-600 text-white shadow-sm'
               : 'text-slate-400 hover:text-slate-200'

[NoCoverage] ConditionalExpression
components/PharmacologyToxView.tsx:64:13
         <button
           onClick={() => setActiveTab('atods')}
           className={`flex items-center gap-2 px-6 py-3 rounded-xl text-[11px] font-black uppercase tracking-widest transition-all cursor-pointer ${
-            activeTab === 'atods'
+            false
               ? 'bg-indigo-600 text-white shadow-sm'
               : 'text-slate-400 hover:text-slate-200'

[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:66:17
           className={`flex items-center gap-2 px-6 py-3 rounded-xl text-[11px] font-black uppercase tracking-widest transition-all cursor-pointer ${
             activeTab === 'atods'
               ? 'bg-indigo-600 text-white shadow-sm'
-              : 'text-slate-400 hover:text-slate-200'
+              : ""
           }`}
         >

[NoCoverage] ArrowFunction
components/PharmacologyToxView.tsx:72:20
           <Pill className="w-4 h-4" /> ATODs
         </button>
         <button
-          onClick={() => setActiveTab('toxidromes')}
+          onClick={() => undefined}
           className={`flex items-center gap-2 px-6 py-3 rounded-xl text-[11px] font-black uppercase tracking-widest transition-all cursor-pointer ${
             activeTab === 'toxidromes'

[NoCoverage] EqualityOperator
components/PharmacologyToxView.tsx:74:13
         <button
           onClick={() => setActiveTab('toxidromes')}
           className={`flex items-center gap-2 px-6 py-3 rounded-xl text-[11px] font-black uppercase tracking-widest transition-all cursor-pointer ${
-            activeTab === 'toxidromes'
+            activeTab !== 'toxidromes'
               ? 'bg-indigo-600 text-white shadow-sm'
               : 'text-slate-400 hover:text-slate-200'

[NoCoverage] ConditionalExpression
components/PharmacologyToxView.tsx:74:13
         <button
           onClick={() => setActiveTab('toxidromes')}
           className={`flex items-center gap-2 px-6 py-3 rounded-xl text-[11px] font-black uppercase tracking-widest transition-all cursor-pointer ${
-            activeTab === 'toxidromes'
+            false
               ? 'bg-indigo-600 text-white shadow-sm'
               : 'text-slate-400 hover:text-slate-200'

[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:75:17
           onClick={() => setActiveTab('toxidromes')}
           className={`flex items-center gap-2 px-6 py-3 rounded-xl text-[11px] font-black uppercase tracking-widest transition-all cursor-pointer ${
             activeTab === 'toxidromes'
-              ? 'bg-indigo-600 text-white shadow-sm'
+              ? ""
               : 'text-slate-400 hover:text-slate-200'
           }`}

[NoCoverage] ArrowFunction
components/PharmacologyToxView.tsx:82:20
           <Skull className="w-4 h-4" /> Toxidromes
         </button>
         <button
-          onClick={() => setActiveTab('agitation')}
+          onClick={() => undefined}
           className={`flex items-center gap-2 px-6 py-3 rounded-xl text-[11px] font-black uppercase tracking-widest transition-all cursor-pointer ${
             activeTab === 'agitation'

[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:83:22
         </button>
         <button
           onClick={() => setActiveTab('agitation')}
-          className={`flex items-center gap-2 px-6 py-3 rounded-xl text-[11px] font-black uppercase tracking-widest transition-all cursor-pointer ${
-            activeTab === 'agitation'
-              ? 'bg-indigo-600 text-white shadow-sm'
-              : 'text-slate-400 hover:text-slate-200'
-          }`}
+          className={``}
         >
           <AlertCircle className="w-4 h-4" /> Agitation

[NoCoverage] ConditionalExpression
components/PharmacologyToxView.tsx:84:13
         <button
           onClick={() => setActiveTab('agitation')}
           className={`flex items-center gap-2 px-6 py-3 rounded-xl text-[11px] font-black uppercase tracking-widest transition-all cursor-pointer ${
-            activeTab === 'agitation'
+            false
               ? 'bg-indigo-600 text-white shadow-sm'
               : 'text-slate-400 hover:text-slate-200'

[NoCoverage] EqualityOperator
components/PharmacologyToxView.tsx:84:13
         <button
           onClick={() => setActiveTab('agitation')}
           className={`flex items-center gap-2 px-6 py-3 rounded-xl text-[11px] font-black uppercase tracking-widest transition-all cursor-pointer ${
-            activeTab === 'agitation'
+            activeTab !== 'agitation'
               ? 'bg-indigo-600 text-white shadow-sm'
               : 'text-slate-400 hover:text-slate-200'

[NoCoverage] ConditionalExpression
components/PharmacologyToxView.tsx:107:8
         />
       </div>
 
-      {didYouMean && (
-        <div className="max-w-4xl mx-auto mb-8 flex justify-center">
-          <button
-            onClick={() => setSearchQuery(didYouMean)}
-            className="flex items-center gap-2 px-6 py-3 bg-indigo-950/40 hover:bg-indigo-900/50 text-indigo-400 rounded-2xl transition-all shadow-sm border border-indigo-500/15 cursor-pointer"
-          >
-            <span className="text-xs font-black uppercase tracking-widest text-indigo-500">
-              Did you mean
-            </span>
-            <span className="text-sm font-bold border-b border-indigo-400 border-dashed">
-              {didYouMean}
-            </span>
-            <span className="text-xs font-black uppercase tracking-widest text-indigo-500">?</span>
-          </button>
-        </div>
-      )}
+      {false}
 
       <AnimatePresence mode="wait">

[NoCoverage] ConditionalExpression
components/PharmacologyToxView.tsx:107:8
         />
       </div>
 
-      {didYouMean && (
-        <div className="max-w-4xl mx-auto mb-8 flex justify-center">
-          <button
-            onClick={() => setSearchQuery(didYouMean)}
-            className="flex items-center gap-2 px-6 py-3 bg-indigo-950/40 hover:bg-indigo-900/50 text-indigo-400 rounded-2xl transition-all shadow-sm border border-indigo-500/15 cursor-pointer"
-          >
-            <span className="text-xs font-black uppercase tracking-widest text-indigo-500">
-              Did you mean
-            </span>
-            <span className="text-sm font-bold border-b border-indigo-400 border-dashed">
-              {didYouMean}
-            </span>
-            <span className="text-xs font-black uppercase tracking-widest text-indigo-500">?</span>
-          </button>
-        </div>
-      )}
+      {true}
 
       <AnimatePresence mode="wait">

[NoCoverage] EqualityOperator
components/PharmacologyToxView.tsx:125:10
       )}
 
       <AnimatePresence mode="wait">
-        {activeTab === 'atods' && (
+        {activeTab !== 'atods' && (
           <motion.div
             key="atods"

[NoCoverage] ConditionalExpression
components/PharmacologyToxView.tsx:125:10
       )}
 
       <AnimatePresence mode="wait">
-        {activeTab === 'atods' && (
+        {true && (
           <motion.div
             key="atods"

[NoCoverage] ArrowFunction
components/PharmacologyToxView.tsx:133:32
             exit={{ opacity: 0, y: -20 }}
             className="grid grid-cols-1 gap-8"
           >
-            {filteredATODs.map((item, idx) => (
-              <ClinicalCard
-                key={idx}
-                title={item.category}
-                subtitle={item.substances}
-                icon={Pill}
-                details={[
-                  { label: 'Presentation', content: item.presentation, icon: Activity },
-                  {
-                    label: 'Acute Management',
-                    content: item.management,
-                    icon: ShieldCheck,
-                    labelColorClass: 'text-indigo-400'
-                  },
-                  {
-                    label: 'Withdrawal Protocol',
-                    content: item.withdrawal,
-                    icon: AlertCircle,
-                    labelColorClass: 'text-amber-450'
-                  }
-                ]}
-              />
-            ))}
+            {filteredATODs.map(() => undefined)}
           </motion.div>
         )}

[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:140:28
                 subtitle={item.substances}
                 icon={Pill}
                 details={[
-                  { label: 'Presentation', content: item.presentation, icon: Activity },
+                  { label: "", content: item.presentation, icon: Activity },
                   {
                     label: 'Acute Management',

[NoCoverage] ObjectLiteral
components/PharmacologyToxView.tsx:140:19
                 subtitle={item.substances}
                 icon={Pill}
                 details={[
-                  { label: 'Presentation', content: item.presentation, icon: Activity },
+                  {},
                   {
                     label: 'Acute Management',

[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:142:28
                 details={[
                   { label: 'Presentation', content: item.presentation, icon: Activity },
                   {
-                    label: 'Acute Management',
+                    label: "",
                     content: item.management,
                     icon: ShieldCheck,

[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:145:38
                     label: 'Acute Management',
                     content: item.management,
                     icon: ShieldCheck,
-                    labelColorClass: 'text-indigo-400'
+                    labelColorClass: ""
                   },
                   {

[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:151:38
                     label: 'Withdrawal Protocol',
                     content: item.withdrawal,
                     icon: AlertCircle,
-                    labelColorClass: 'text-amber-450'
+                    labelColorClass: ""
                   }
                 ]}

[NoCoverage] EqualityOperator
components/PharmacologyToxView.tsx:159:10
           </motion.div>
         )}
 
-        {activeTab === 'toxidromes' && (
+        {activeTab !== 'toxidromes' && (
           <motion.div
             key="toxidromes"

[NoCoverage] ConditionalExpression
components/PharmacologyToxView.tsx:159:10
           </motion.div>
         )}
 
-        {activeTab === 'toxidromes' && (
+        {true && (
           <motion.div
             key="toxidromes"

[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:177:28
                 details={[
                   { label: 'Classic Features', content: item.features, icon: Activity },
                   {
-                    label: 'Common Causes',
+                    label: "",
                     content: item.causes,
                     icon: Pill,

[NoCoverage] ObjectLiteral
components/PharmacologyToxView.tsx:182:19
                     icon: Pill,
                     labelColorClass: 'text-blue-400'
                   },
-                  {
-                    label: 'Stepwise Examination',
-                    content: item.examination,
-                    icon: Search,
-                    labelColorClass: 'text-amber-450'
-                  },
+                  {},
                   {
                     label: 'Typical Findings',

[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:186:38
                     label: 'Stepwise Examination',
                     content: item.examination,
                     icon: Search,
-                    labelColorClass: 'text-amber-450'
+                    labelColorClass: ""
                   },
                   {

[NoCoverage] ObjectLiteral
components/PharmacologyToxView.tsx:188:19
                     icon: Search,
                     labelColorClass: 'text-amber-450'
                   },
-                  {
-                    label: 'Typical Findings',
-                    content: item.findings,
-                    icon: Info,
-                    labelColorClass: 'text-indigo-400'
-                  },
+                  {},
                   {
                     label: 'Investigations',

[NoCoverage] ObjectLiteral
components/PharmacologyToxView.tsx:194:19
                     icon: Info,
                     labelColorClass: 'text-indigo-400'
                   },
-                  {
-                    label: 'Investigations',
-                    content: item.investigations,
-                    icon: Activity,
-                    labelColorClass: 'text-purple-400'
-                  },
+                  {},
                   {
                     label: 'Management',

[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:195:28
                     labelColorClass: 'text-indigo-400'
                   },
                   {
-                    label: 'Investigations',
+                    label: "",
                     content: item.investigations,
                     icon: Activity,

[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:198:38
                     label: 'Investigations',
                     content: item.investigations,
                     icon: Activity,
-                    labelColorClass: 'text-purple-400'
+                    labelColorClass: ""
                   },
                   {

[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:204:38
                     label: 'Management',
                     content: item.management,
                     icon: ShieldCheck,
-                    labelColorClass: 'text-emerald-450'
+                    labelColorClass: ""
                   }
                 ]}

[NoCoverage] ConditionalExpression
components/PharmacologyToxView.tsx:212:10
           </motion.div>
         )}
 
-        {activeTab === 'agitation' && (
+        {true && (
           <motion.div
             key="agitation"

[NoCoverage] EqualityOperator
components/PharmacologyToxView.tsx:212:10
           </motion.div>
         )}
 
-        {activeTab === 'agitation' && (
+        {activeTab !== 'agitation' && (
           <motion.div
             key="agitation"

[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:229:28
                 headerColorClass="bg-rose-950/20"
                 gridCols={4}
                 details={[
-                  { label: 'Indications', content: item.indications, icon: Info },
+                  { label: "", content: item.indications, icon: Info },
                   {
                     label: 'Typical Dosage',

[NoCoverage] ObjectLiteral
components/PharmacologyToxView.tsx:230:19
                 gridCols={4}
                 details={[
                   { label: 'Indications', content: item.indications, icon: Info },
-                  {
-                    label: 'Typical Dosage',
-                    content: item.dosage,
-                    icon: Syringe,
-                    labelColorClass: 'text-blue-400',
-                    colorClass: 'text-slate-100 font-bold'
-                  },
+                  {},
                   {
                     label: 'Benefits (Pros)',

[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:231:28
                 details={[
                   { label: 'Indications', content: item.indications, icon: Info },
                   {
-                    label: 'Typical Dosage',
+                    label: "",
                     content: item.dosage,
                     icon: Syringe,

[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:234:38
                     label: 'Typical Dosage',
                     content: item.dosage,
                     icon: Syringe,
-                    labelColorClass: 'text-blue-400',
+                    labelColorClass: "",
                     colorClass: 'text-slate-100 font-bold'
                   },

[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:238:28
                     colorClass: 'text-slate-100 font-bold'
                   },
                   {
-                    label: 'Benefits (Pros)',
+                    label: "",
                     content: item.pros,
                     icon: ShieldCheck,

[NoCoverage] StringLiteral
components/PharmacologyToxView.tsx:247:38
                     label: 'Risks (Cons)',
                     content: item.cons,
                     icon: AlertCircle,
-                    labelColorClass: 'text-rose-455'
+                    labelColorClass: ""
                   }
                 ]}
