[NoCoverage] StringLiteral
components/RadiologyView.tsx:25:9
 
 const DEFAULT_FINDINGS: RadiologyFinding[] = [
   {
-    id: 'pneumothorax',
+    id: "",
     name: 'Pneumothorax',
     modality: 'CXR',

[NoCoverage] StringLiteral
components/RadiologyView.tsx:27:15
   {
     id: 'pneumothorax',
     name: 'Pneumothorax',
-    modality: 'CXR',
+    modality: "",
     category: 'Chest',
     description: 'Presence of air in the pleural space.',

[NoCoverage] StringLiteral
components/RadiologyView.tsx:28:15
     id: 'pneumothorax',
     name: 'Pneumothorax',
     modality: 'CXR',
-    category: 'Chest',
+    category: "",
     description: 'Presence of air in the pleural space.',
     keySigns: [

[NoCoverage] StringLiteral
components/RadiologyView.tsx:29:18
     name: 'Pneumothorax',
     modality: 'CXR',
     category: 'Chest',
-    description: 'Presence of air in the pleural space.',
+    description: "",
     keySigns: [
       'Visible visceral pleural line',

[NoCoverage] StringLiteral
components/RadiologyView.tsx:32:7
     description: 'Presence of air in the pleural space.',
     keySigns: [
       'Visible visceral pleural line',
-      'Absence of lung markings peripheral to the line',
+      "",
       'Deep sulcus sign (on supine film)',
       'Mediastinal shift (if tension)'

[NoCoverage] StringLiteral
components/RadiologyView.tsx:33:7
     keySigns: [
       'Visible visceral pleural line',
       'Absence of lung markings peripheral to the line',
-      'Deep sulcus sign (on supine film)',
+      "",
       'Mediastinal shift (if tension)'
     ],

[NoCoverage] StringLiteral
components/RadiologyView.tsx:38:7
     ],
     clinicalSignificance: 'Can lead to tension pneumothorax and cardiovascular collapse.',
     management: [
-      'Needle decompression (if tension)',
+      "",
       'Chest tube insertion',
       'Observation (if small/stable)'

[NoCoverage] StringLiteral
components/RadiologyView.tsx:39:7
     clinicalSignificance: 'Can lead to tension pneumothorax and cardiovascular collapse.',
     management: [
       'Needle decompression (if tension)',
-      'Chest tube insertion',
+      "",
       'Observation (if small/stable)'
     ]

[NoCoverage] StringLiteral
components/RadiologyView.tsx:45:11
   },
   {
     id: 'bowel-obstruction',
-    name: 'Small Bowel Obstruction',
+    name: "",
     modality: 'AXR',
     category: 'Abdomen',

[NoCoverage] StringLiteral
components/RadiologyView.tsx:48:18
     name: 'Small Bowel Obstruction',
     modality: 'AXR',
     category: 'Abdomen',
-    description: 'Mechanical or functional blockage of the small intestine.',
+    description: "",
     keySigns: [
       'Dilated small bowel loops (> 3cm)',

[NoCoverage] StringLiteral
components/RadiologyView.tsx:51:7
     description: 'Mechanical or functional blockage of the small intestine.',
     keySigns: [
       'Dilated small bowel loops (> 3cm)',
-      'Valvulae conniventes (crossing the full width)',
+      "",
       'Central location of loops',
       'String of pearls sign (air-fluid levels)'

[NoCoverage] StringLiteral
components/RadiologyView.tsx:53:7
       'Dilated small bowel loops (> 3cm)',
       'Valvulae conniventes (crossing the full width)',
       'Central location of loops',
-      'String of pearls sign (air-fluid levels)'
+      ""
     ],
     clinicalSignificance: 'Risk of ischemia, perforation, and sepsis.',

[NoCoverage] StringLiteral
components/RadiologyView.tsx:56:40
       'String of pearls sign (air-fluid levels)'
     ],
     clinicalSignificance: 'Risk of ischemia, perforation, and sepsis.',
-    management: ['NBM (Nil By Mouth)', 'NG tube decompression', 'IV fluids', 'Surgical consult']
+    management: ['NBM (Nil By Mouth)', "", 'IV fluids', 'Surgical consult']
   },
   {

[NoCoverage] ArrayDeclaration
components/RadiologyView.tsx:56:17
       'String of pearls sign (air-fluid levels)'
     ],
     clinicalSignificance: 'Risk of ischemia, perforation, and sepsis.',
-    management: ['NBM (Nil By Mouth)', 'NG tube decompression', 'IV fluids', 'Surgical consult']
+    management: []
   },
   {

[NoCoverage] ObjectLiteral
components/RadiologyView.tsx:58:3
     clinicalSignificance: 'Risk of ischemia, perforation, and sepsis.',
     management: ['NBM (Nil By Mouth)', 'NG tube decompression', 'IV fluids', 'Surgical consult']
   },
-  {
-    id: 'ich',
-    name: 'Intracranial Hemorrhage',
-    modality: 'CT',
-    category: 'Neuro',
-    description: 'Bleeding within the skull vault.',
-    keySigns: [
-      'Hyperdense (bright) area on non-contrast CT',
-      'Mass effect (midline shift)',
-      'Ventricular effacement',
-      'Blood in ventricles (IVH)'
-    ],
-    clinicalSignificance: 'Life-threatening emergency. Risk of herniation.',
-    management: ['ABCDE', 'BP control', 'Neurosurgical consult', 'Reverse anticoagulation']
-  }
+  {}
 ];
 

[NoCoverage] StringLiteral
components/RadiologyView.tsx:62:15
     id: 'ich',
     name: 'Intracranial Hemorrhage',
     modality: 'CT',
-    category: 'Neuro',
+    category: "",
     description: 'Bleeding within the skull vault.',
     keySigns: [

[NoCoverage] StringLiteral
components/RadiologyView.tsx:66:7
     description: 'Bleeding within the skull vault.',
     keySigns: [
       'Hyperdense (bright) area on non-contrast CT',
-      'Mass effect (midline shift)',
+      "",
       'Ventricular effacement',
       'Blood in ventricles (IVH)'

[NoCoverage] StringLiteral
components/RadiologyView.tsx:68:7
       'Hyperdense (bright) area on non-contrast CT',
       'Mass effect (midline shift)',
       'Ventricular effacement',
-      'Blood in ventricles (IVH)'
+      ""
     ],
     clinicalSignificance: 'Life-threatening emergency. Risk of herniation.',

[NoCoverage] StringLiteral
components/RadiologyView.tsx:70:27
       'Ventricular effacement',
       'Blood in ventricles (IVH)'
     ],
-    clinicalSignificance: 'Life-threatening emergency. Risk of herniation.',
+    clinicalSignificance: "",
     management: ['ABCDE', 'BP control', 'Neurosurgical consult', 'Reverse anticoagulation']
   }

[NoCoverage] StringLiteral
components/RadiologyView.tsx:71:18
       'Blood in ventricles (IVH)'
     ],
     clinicalSignificance: 'Life-threatening emergency. Risk of herniation.',
-    management: ['ABCDE', 'BP control', 'Neurosurgical consult', 'Reverse anticoagulation']
+    management: ["", 'BP control', 'Neurosurgical consult', 'Reverse anticoagulation']
   }
 ];

[NoCoverage] StringLiteral
components/RadiologyView.tsx:77:50
 
 export const RadiologyView: React.FC = () => {
   const [activeFinding, setActiveFinding] = useState<string | null>(null);
-  const [searchQuery, setSearchQuery] = useState('');
+  const [searchQuery, setSearchQuery] = useState("Stryker was here!");
   const [customFindings, setCustomFindings] = useState<RadiologyFinding[]>([]);
   const [enlargedImage, setEnlargedImage] = useState<{ src: string; alt: string } | null>(null);

[NoCoverage] BlockStatement
components/RadiologyView.tsx:81:25
   const [customFindings, setCustomFindings] = useState<RadiologyFinding[]>([]);
   const [enlargedImage, setEnlargedImage] = useState<{ src: string; alt: string } | null>(null);
 
-  React.useEffect(() => {
-    const loadCustom = async () => {
-      const saved = await storage.getAllRadiologyFindings();
-      setCustomFindings(saved);
-    };
-    loadCustom();
-  }, []);
+  React.useEffect(() => {}, []);
 
   const allFindings = useMemo(() => {

[NoCoverage] BlockStatement
components/RadiologyView.tsx:82:36
   const [enlargedImage, setEnlargedImage] = useState<{ src: string; alt: string } | null>(null);
 
   React.useEffect(() => {
-    const loadCustom = async () => {
-      const saved = await storage.getAllRadiologyFindings();
-      setCustomFindings(saved);
-    };
+    const loadCustom = async () => {};
     loadCustom();
   }, []);

[NoCoverage] BlockStatement
components/RadiologyView.tsx:89:37
     loadCustom();
   }, []);
 
-  const allFindings = useMemo(() => {
-    return [...DEFAULT_FINDINGS, ...customFindings];
-  }, [customFindings]);
+  const allFindings = useMemo(() => {}, [customFindings]);
 
   const { results: filteredFindings, didYouMean } = useClinicalSearch(allFindings, searchQuery, [

[NoCoverage] ArrayDeclaration
components/RadiologyView.tsx:90:12
   }, []);
 
   const allFindings = useMemo(() => {
-    return [...DEFAULT_FINDINGS, ...customFindings];
+    return [];
   }, [customFindings]);
 

[NoCoverage] ArrayDeclaration
components/RadiologyView.tsx:93:97
     return [...DEFAULT_FINDINGS, ...customFindings];
   }, [customFindings]);
 
-  const { results: filteredFindings, didYouMean } = useClinicalSearch(allFindings, searchQuery, [
-    'name',
-    'modality',
-    'category'
-  ]);
+  const { results: filteredFindings, didYouMean } = useClinicalSearch(allFindings, searchQuery, []);
 
   const selectedFinding = useMemo(() => {

[NoCoverage] BlockStatement
components/RadiologyView.tsx:99:41
     'category'
   ]);
 
-  const selectedFinding = useMemo(() => {
-    return allFindings.find((f) => f.id === activeFinding);
-  }, [activeFinding, allFindings]);
+  const selectedFinding = useMemo(() => {}, [activeFinding, allFindings]);
 
   return (

[NoCoverage] ArrowFunction
components/RadiologyView.tsx:100:29
   ]);
 
   const selectedFinding = useMemo(() => {
-    return allFindings.find((f) => f.id === activeFinding);
+    return allFindings.find(() => undefined);
   }, [activeFinding, allFindings]);
 

[NoCoverage] ConditionalExpression
components/RadiologyView.tsx:100:36
   ]);
 
   const selectedFinding = useMemo(() => {
-    return allFindings.find((f) => f.id === activeFinding);
+    return allFindings.find((f) => true);
   }, [activeFinding, allFindings]);
 

[NoCoverage] ArrayDeclaration
components/RadiologyView.tsx:101:6
 
   const selectedFinding = useMemo(() => {
     return allFindings.find((f) => f.id === activeFinding);
-  }, [activeFinding, allFindings]);
+  }, []);
 
   return (

[NoCoverage] ArrowFunction
components/RadiologyView.tsx:157:26
             {filteredFindings.map((finding) => (
               <button
                 key={finding.id}
-                onClick={() => setActiveFinding(finding.id)}
+                onClick={() => undefined}
                 className={`w-full flex items-center gap-4 p-4 rounded-2xl transition-all text-left cursor-pointer ${
                   activeFinding === finding.id

[NoCoverage] StringLiteral
components/RadiologyView.tsx:158:28
               <button
                 key={finding.id}
                 onClick={() => setActiveFinding(finding.id)}
-                className={`w-full flex items-center gap-4 p-4 rounded-2xl transition-all text-left cursor-pointer ${
-                  activeFinding === finding.id
-                    ? 'bg-indigo-600 text-white shadow-lg shadow-indigo-950/50 border border-indigo-500/30'
-                    : 'bg-slate-900 border border-white/5 text-slate-350 hover:border-white/10 hover:bg-slate-900/80'
-                }`}
+                className={``}
               >
                 <div

[NoCoverage] ConditionalExpression
components/RadiologyView.tsx:159:19
                 key={finding.id}
                 onClick={() => setActiveFinding(finding.id)}
                 className={`w-full flex items-center gap-4 p-4 rounded-2xl transition-all text-left cursor-pointer ${
-                  activeFinding === finding.id
+                  true
                     ? 'bg-indigo-600 text-white shadow-lg shadow-indigo-950/50 border border-indigo-500/30'
                     : 'bg-slate-900 border border-white/5 text-slate-350 hover:border-white/10 hover:bg-slate-900/80'

[NoCoverage] EqualityOperator
components/RadiologyView.tsx:159:19
                 key={finding.id}
                 onClick={() => setActiveFinding(finding.id)}
                 className={`w-full flex items-center gap-4 p-4 rounded-2xl transition-all text-left cursor-pointer ${
-                  activeFinding === finding.id
+                  activeFinding !== finding.id
                     ? 'bg-indigo-600 text-white shadow-lg shadow-indigo-950/50 border border-indigo-500/30'
                     : 'bg-slate-900 border border-white/5 text-slate-350 hover:border-white/10 hover:bg-slate-900/80'

[NoCoverage] ConditionalExpression
components/RadiologyView.tsx:166:21
               >
                 <div
                   className={`w-10 h-10 rounded-xl flex items-center justify-center ${
-                    activeFinding === finding.id
+                    false
                       ? 'bg-slate-950/40/20'
                       : 'bg-slate-950 text-indigo-400 border border-white/5'

[NoCoverage] EqualityOperator
components/RadiologyView.tsx:166:21
               >
                 <div
                   className={`w-10 h-10 rounded-xl flex items-center justify-center ${
-                    activeFinding === finding.id
+                    activeFinding !== finding.id
                       ? 'bg-slate-950/40/20'
                       : 'bg-slate-950 text-indigo-400 border border-white/5'

[NoCoverage] StringLiteral
components/RadiologyView.tsx:167:25
                 <div
                   className={`w-10 h-10 rounded-xl flex items-center justify-center ${
                     activeFinding === finding.id
-                      ? 'bg-slate-950/40/20'
+                      ? ""
                       : 'bg-slate-950 text-indigo-400 border border-white/5'
                   }`}

[NoCoverage] ConditionalExpression
components/RadiologyView.tsx:180:62
                   </div>
                 </div>
                 <ChevronRight
-                  className={`w-4 h-4 transition-transform ${activeFinding === finding.id ? 'rotate-90' : ''}`}
+                  className={`w-4 h-4 transition-transform ${true ? 'rotate-90' : ''}`}
                 />
               </button>

[NoCoverage] EqualityOperator
components/RadiologyView.tsx:180:62
                   </div>
                 </div>
                 <ChevronRight
-                  className={`w-4 h-4 transition-transform ${activeFinding === finding.id ? 'rotate-90' : ''}`}
+                  className={`w-4 h-4 transition-transform ${activeFinding !== finding.id ? 'rotate-90' : ''}`}
                 />
               </button>

[NoCoverage] LogicalOperator
components/RadiologyView.tsx:223:22
                   </div>
 
                   <div className="space-y-6">
-                    {selectedFinding.imageUrl && (
-                      <div className="mb-8 rounded-2xl overflow-hidden border border-white/5 bg-slate-955/20">
-                        <MedImage
-                          src={selectedFinding.imageUrl}
-                          alt={selectedFinding.name}
-                          label="Radiology Reference"
-                          className="w-full h-auto"
-                          onEnlarge={() =>
-                            setEnlargedImage({
-                              src: selectedFinding.imageUrl!,
-                              alt: selectedFinding.name
-                            })
-                          }
-                        />
-                        <div className="p-3 bg-slate-950 text-[10px] font-bold text-slate-400 text-center uppercase tracking-widest border-t border-white/5">
-                          Clinical Imaging Reference
-                        </div>
-                      </div>
-                    )}
+                    {selectedFinding.imageUrl || <div className="mb-8 rounded-2xl overflow-hidden border border-white/5 bg-slate-955/20">
+                        <MedImage src={selectedFinding.imageUrl} alt={selectedFinding.name} label="Radiology Reference" className="w-full h-auto" onEnlarge={() => setEnlargedImage({
+    src: selectedFinding.imageUrl!,
+    alt: selectedFinding.name
+  })} />
+                        <div className="p-3 bg-slate-950 text-[10px] font-bold text-slate-400 text-center uppercase tracking-widest border-t border-white/5">
+                          Clinical Imaging Reference
+                        </div>
+                      </div>}
                     <h3 className="text-xs font-black uppercase tracking-widest text-slate-400 flex items-center gap-2">
                       <Zap className="w-4 h-4 text-amber-500" /> Key Radiological Signs

[NoCoverage] ConditionalExpression
components/RadiologyView.tsx:223:22
                   </div>
 
                   <div className="space-y-6">
-                    {selectedFinding.imageUrl && (
-                      <div className="mb-8 rounded-2xl overflow-hidden border border-white/5 bg-slate-955/20">
-                        <MedImage
-                          src={selectedFinding.imageUrl}
-                          alt={selectedFinding.name}
-                          label="Radiology Reference"
-                          className="w-full h-auto"
-                          onEnlarge={() =>
-                            setEnlargedImage({
-                              src: selectedFinding.imageUrl!,
-                              alt: selectedFinding.name
-                            })
-                          }
-                        />
-                        <div className="p-3 bg-slate-950 text-[10px] font-bold text-slate-400 text-center uppercase tracking-widest border-t border-white/5">
-                          Clinical Imaging Reference
-                        </div>
-                      </div>
-                    )}
+                    {true}
                     <h3 className="text-xs font-black uppercase tracking-widest text-slate-400 flex items-center gap-2">
                       <Zap className="w-4 h-4 text-amber-500" /> Key Radiological Signs

[NoCoverage] ArrowFunction
components/RadiologyView.tsx:230:38
                           alt={selectedFinding.name}
                           label="Radiology Reference"
                           className="w-full h-auto"
-                          onEnlarge={() =>
-                            setEnlargedImage({
-                              src: selectedFinding.imageUrl!,
-                              alt: selectedFinding.name
-                            })
+                          onEnlarge={() => undefined
                           }
                         />

[NoCoverage] ArrowFunction
components/RadiologyView.tsx:246:53
                       <Zap className="w-4 h-4 text-amber-500" /> Key Radiological Signs
                     </h3>
                     <div className="grid grid-cols-1 sm:grid-cols-2 gap-4">
-                      {selectedFinding.keySigns.map((item, i) => (
-                        <div
-                          key={i}
-                          className="p-4 bg-slate-955/40 rounded-2xl border border-white/5 text-sm font-bold text-slate-300 flex items-center gap-3"
-                        >
-                          <CheckCircle2 className="w-4 h-4 text-emerald-500 shrink-0" />
-                          {item}
-                        </div>
-                      ))}
+                      {selectedFinding.keySigns.map(() => undefined)}
                     </div>
                   </div>

[NoCoverage] ArrowFunction
components/RadiologyView.tsx:274:55
                       <ShieldAlert className="w-4 h-4 text-white" /> Management Steps
                     </h3>
                     <ul className="space-y-3">
-                      {selectedFinding.management.map((item, i) => (
-                        <li key={i} className="flex items-center gap-3 text-sm font-bold">
-                          <CheckCircle2 className="w-4 h-4 text-indigo-300 shrink-0" />
-                          {item}
-                        </li>
-                      ))}
+                      {selectedFinding.management.map(() => undefined)}
                     </ul>
                   </div>

[NoCoverage] ConditionalExpression
components/RadiologyView.tsx:310:8
           </AnimatePresence>
         </div>
       </div>
-      {enlargedImage && (
-        <ImageModal
-          src={enlargedImage.src}
-          alt={enlargedImage.alt}
-          onClose={() => setEnlargedImage(null)}
-        />
-      )}
+      {false}
     </div>
   );
