[NoCoverage] StringLiteral
components/SettingsView.tsx:67:93
               </div>
               <button
                 onClick={onToggleEditMode}
-                className={`w-12 h-6 rounded-full relative transition-colors ${isEditMode ? 'bg-emerald-600' : 'bg-slate-200'}`}
+                className={`w-12 h-6 rounded-full relative transition-colors ${isEditMode ? "" : 'bg-slate-200'}`}
               >
                 <div

[NoCoverage] StringLiteral
components/SettingsView.tsx:70:30
                 className={`w-12 h-6 rounded-full relative transition-colors ${isEditMode ? 'bg-emerald-600' : 'bg-slate-200'}`}
               >
                 <div
-                  className={`absolute top-1 w-4 h-4 bg-slate-950/40 rounded-full shadow-sm transition-all ${isEditMode ? 'right-1' : 'left-1'}`}
+                  className={``}
                 ></div>
               </button>

[NoCoverage] StringLiteral
components/SettingsView.tsx:70:135
                 className={`w-12 h-6 rounded-full relative transition-colors ${isEditMode ? 'bg-emerald-600' : 'bg-slate-200'}`}
               >
                 <div
-                  className={`absolute top-1 w-4 h-4 bg-slate-950/40 rounded-full shadow-sm transition-all ${isEditMode ? 'right-1' : 'left-1'}`}
+                  className={`absolute top-1 w-4 h-4 bg-slate-950/40 rounded-full shadow-sm transition-all ${isEditMode ? 'right-1' : ""}`}
                 ></div>
               </button>

[NoCoverage] StringLiteral
components/SettingsView.tsx:83:92
               </div>
               <button
                 onClick={onToggleDevMode}
-                className={`w-12 h-6 rounded-full relative transition-colors ${isDevMode ? 'bg-blue-600' : 'bg-slate-200'}`}
+                className={`w-12 h-6 rounded-full relative transition-colors ${isDevMode ? "" : 'bg-slate-200'}`}
               >
                 <div

[NoCoverage] StringLiteral
components/SettingsView.tsx:83:108
               </div>
               <button
                 onClick={onToggleDevMode}
-                className={`w-12 h-6 rounded-full relative transition-colors ${isDevMode ? 'bg-blue-600' : 'bg-slate-200'}`}
+                className={`w-12 h-6 rounded-full relative transition-colors ${isDevMode ? 'bg-blue-600' : ""}`}
               >
                 <div

[NoCoverage] StringLiteral
components/SettingsView.tsx:86:122
                 className={`w-12 h-6 rounded-full relative transition-colors ${isDevMode ? 'bg-blue-600' : 'bg-slate-200'}`}
               >
                 <div
-                  className={`absolute top-1 w-4 h-4 bg-slate-950/40 rounded-full shadow-sm transition-all ${isDevMode ? 'right-1' : 'left-1'}`}
+                  className={`absolute top-1 w-4 h-4 bg-slate-950/40 rounded-full shadow-sm transition-all ${isDevMode ? "" : 'left-1'}`}
                 ></div>
               </button>
