[NoCoverage] ConditionalExpression
components/Sidebar.tsx:260:77
                 >
                   <div className={`flex items-center ${isCollapsed ? 'justify-center' : 'gap-4'}`}>
                     <div
-                      className={`transition-colors duration-300 shrink-0 ${currentView === 'library' ? 'text-white' : 'text-slate-650 group-hover:text-blue-400'}`}
+                      className={`transition-colors duration-300 shrink-0 ${true ? 'text-white' : 'text-slate-650 group-hover:text-blue-400'}`}
                     >
                       <BookOpen className="w-4 h-4" />

[NoCoverage] ConditionalExpression
components/Sidebar.tsx:264:22
                     >
                       <BookOpen className="w-4 h-4" />
                     </div>
-                    {!isCollapsed && (
-                      <span className="animate-in fade-in slide-in-from-left-2 duration-500">
-                        Exams & OSCEs
-                      </span>
-                    )}
+                    {true}
                   </div>
                   {!isCollapsed && (

[NoCoverage] ConditionalExpression
components/Sidebar.tsx:270:20
                       </span>
                     )}
                   </div>
-                  {!isCollapsed && (
-                    <ChevronDown
-                      className={`w-3 h-3 transition-transform duration-300 ${sectionsOpen.examinations ? '' : '-rotate-90'}`}
-                    />
-                  )}
+                  {true}
                 </button>
 

[NoCoverage] ConditionalExpression
components/Sidebar.tsx:270:20
                       </span>
                     )}
                   </div>
-                  {!isCollapsed && (
-                    <ChevronDown
-                      className={`w-3 h-3 transition-transform duration-300 ${sectionsOpen.examinations ? '' : '-rotate-90'}`}
-                    />
-                  )}
+                  {false}
                 </button>
 

[NoCoverage] StringLiteral
components/Sidebar.tsx:272:34
                   </div>
                   {!isCollapsed && (
                     <ChevronDown
-                      className={`w-3 h-3 transition-transform duration-300 ${sectionsOpen.examinations ? '' : '-rotate-90'}`}
+                      className={``}
                     />
                   )}

[NoCoverage] StringLiteral
components/Sidebar.tsx:272:112
                   </div>
                   {!isCollapsed && (
                     <ChevronDown
-                      className={`w-3 h-3 transition-transform duration-300 ${sectionsOpen.examinations ? '' : '-rotate-90'}`}
+                      className={`w-3 h-3 transition-transform duration-300 ${sectionsOpen.examinations ? '' : ""}`}
                     />
                   )}

[NoCoverage] BooleanLiteral
components/Sidebar.tsx:277:47
                   )}
                 </button>
 
-                {sectionsOpen.examinations && !isCollapsed && (
+                {sectionsOpen.examinations && isCollapsed && (
                   <div className="ml-4 pl-4 border-l border-white/5 space-y-1 mt-1 animate-in slide-in-from-top-2 duration-300">
                     <button

[NoCoverage] ConditionalExpression
components/Sidebar.tsx:277:18
                   )}
                 </button>
 
-                {sectionsOpen.examinations && !isCollapsed && (
+                {true && (
                   <div className="ml-4 pl-4 border-l border-white/5 space-y-1 mt-1 animate-in slide-in-from-top-2 duration-300">
                     <button

[NoCoverage] BlockStatement
components/Sidebar.tsx:280:38
                 {sectionsOpen.examinations && !isCollapsed && (
                   <div className="ml-4 pl-4 border-l border-white/5 space-y-1 mt-1 animate-in slide-in-from-top-2 duration-300">
                     <button
-                      onClick={() => {
-                        setSelectedSystem(null);
-                        navTo('/library');
-                      }}
+                      onClick={() => {}}
                       className={`w-full text-left px-4 py-2 rounded-lg text-[9px] font-black uppercase tracking-widest transition-all ${
                         currentView === 'library' && selectedSystem === null

[NoCoverage] StringLiteral
components/Sidebar.tsx:282:31
                     <button
                       onClick={() => {
                         setSelectedSystem(null);
-                        navTo('/library');
+                        navTo("");
                       }}
                       className={`w-full text-left px-4 py-2 rounded-lg text-[9px] font-black uppercase tracking-widest transition-all ${

[NoCoverage] StringLiteral
components/Sidebar.tsx:284:34
                         setSelectedSystem(null);
                         navTo('/library');
                       }}
-                      className={`w-full text-left px-4 py-2 rounded-lg text-[9px] font-black uppercase tracking-widest transition-all ${
-                        currentView === 'library' && selectedSystem === null
-                          ? 'text-blue-400 bg-blue-400/10'
-                          : 'text-slate-400 hover:text-slate-300 hover:bg-slate-950/40/5'
-                      }`}
+                      className={``}
                     >
                       All Systems

[NoCoverage] ConditionalExpression
components/Sidebar.tsx:285:25
                         navTo('/library');
                       }}
                       className={`w-full text-left px-4 py-2 rounded-lg text-[9px] font-black uppercase tracking-widest transition-all ${
-                        currentView === 'library' && selectedSystem === null
+                        false
                           ? 'text-blue-400 bg-blue-400/10'
                           : 'text-slate-400 hover:text-slate-300 hover:bg-slate-950/40/5'

[NoCoverage] LogicalOperator
components/Sidebar.tsx:285:25
                         navTo('/library');
                       }}
                       className={`w-full text-left px-4 py-2 rounded-lg text-[9px] font-black uppercase tracking-widest transition-all ${
-                        currentView === 'library' && selectedSystem === null
+                        currentView === 'library' || selectedSystem === null
                           ? 'text-blue-400 bg-blue-400/10'
                           : 'text-slate-400 hover:text-slate-300 hover:bg-slate-950/40/5'

[NoCoverage] StringLiteral
components/Sidebar.tsx:286:29
                       }}
                       className={`w-full text-left px-4 py-2 rounded-lg text-[9px] font-black uppercase tracking-widest transition-all ${
                         currentView === 'library' && selectedSystem === null
-                          ? 'text-blue-400 bg-blue-400/10'
+                          ? ""
                           : 'text-slate-400 hover:text-slate-300 hover:bg-slate-950/40/5'
                       }`}

[NoCoverage] ArrowFunction
components/Sidebar.tsx:292:52
                     >
                       All Systems
                     </button>
-                    {Object.values(ExamSystem).map((system) => (
-                      <button
-                        key={system}
-                        onClick={() => {
-                          setSelectedSystem(system);
-                          navTo('/library');
-                        }}
-                        className={`w-full text-left px-4 py-2 rounded-lg text-[9px] font-black uppercase tracking-widest transition-all flex items-center gap-3 ${
-                          currentView === 'library' && selectedSystem === system
-                            ? 'text-blue-400 bg-blue-400/10'
-                            : 'text-slate-400 hover:text-slate-300 hover:bg-slate-950/40/5'
-                        }`}
-                      >
-                        <div className="shrink-0 opacity-50">
-                          {SYSTEM_THEMES[system]?.iconRaw &&
-                            React.createElement(SYSTEM_THEMES[system].iconRaw, {
-                              className: 'w-3 h-3'
-                            })}
-                        </div>
-                        <span className="truncate">{system}</span>
-                      </button>
-                    ))}
+                    {Object.values(ExamSystem).map(() => undefined)}
                   </div>
                 )}

[NoCoverage] BlockStatement
components/Sidebar.tsx:295:40
                     {Object.values(ExamSystem).map((system) => (
                       <button
                         key={system}
-                        onClick={() => {
-                          setSelectedSystem(system);
-                          navTo('/library');
-                        }}
+                        onClick={() => {}}
                         className={`w-full text-left px-4 py-2 rounded-lg text-[9px] font-black uppercase tracking-widest transition-all flex items-center gap-3 ${
                           currentView === 'library' && selectedSystem === system

[NoCoverage] StringLiteral
components/Sidebar.tsx:299:36
                           setSelectedSystem(system);
                           navTo('/library');
                         }}
-                        className={`w-full text-left px-4 py-2 rounded-lg text-[9px] font-black uppercase tracking-widest transition-all flex items-center gap-3 ${
-                          currentView === 'library' && selectedSystem === system
-                            ? 'text-blue-400 bg-blue-400/10'
-                            : 'text-slate-400 hover:text-slate-300 hover:bg-slate-950/40/5'
-                        }`}
+                        className={``}
                       >
                         <div className="shrink-0 opacity-50">

[NoCoverage] ConditionalExpression
components/Sidebar.tsx:300:27
                           navTo('/library');
                         }}
                         className={`w-full text-left px-4 py-2 rounded-lg text-[9px] font-black uppercase tracking-widest transition-all flex items-center gap-3 ${
-                          currentView === 'library' && selectedSystem === system
+                          true
                             ? 'text-blue-400 bg-blue-400/10'
                             : 'text-slate-400 hover:text-slate-300 hover:bg-slate-950/40/5'

[NoCoverage] ConditionalExpression
components/Sidebar.tsx:300:27
                           navTo('/library');
                         }}
                         className={`w-full text-left px-4 py-2 rounded-lg text-[9px] font-black uppercase tracking-widest transition-all flex items-center gap-3 ${
-                          currentView === 'library' && selectedSystem === system
+                          true && selectedSystem === system
                             ? 'text-blue-400 bg-blue-400/10'
                             : 'text-slate-400 hover:text-slate-300 hover:bg-slate-950/40/5'

[NoCoverage] StringLiteral
components/Sidebar.tsx:302:31
                         className={`w-full text-left px-4 py-2 rounded-lg text-[9px] font-black uppercase tracking-widest transition-all flex items-center gap-3 ${
                           currentView === 'library' && selectedSystem === system
                             ? 'text-blue-400 bg-blue-400/10'
-                            : 'text-slate-400 hover:text-slate-300 hover:bg-slate-950/40/5'
+                            : ""
                         }`}
                       >

[NoCoverage] ConditionalExpression
components/Sidebar.tsx:306:28
                         }`}
                       >
                         <div className="shrink-0 opacity-50">
-                          {SYSTEM_THEMES[system]?.iconRaw &&
-                            React.createElement(SYSTEM_THEMES[system].iconRaw, {
-                              className: 'w-3 h-3'
-                            })}
+                          {false}
                         </div>
                         <span className="truncate">{system}</span>

[NoCoverage] LogicalOperator
components/Sidebar.tsx:306:28
                         }`}
                       >
                         <div className="shrink-0 opacity-50">
-                          {SYSTEM_THEMES[system]?.iconRaw &&
-                            React.createElement(SYSTEM_THEMES[system].iconRaw, {
-                              className: 'w-3 h-3'
-                            })}
+                          {SYSTEM_THEMES[system]?.iconRaw || React.createElement(SYSTEM_THEMES[system].iconRaw, {
+  className: 'w-3 h-3'
+})}
                         </div>
                         <span className="truncate">{system}</span>

[NoCoverage] ArrowFunction
components/Sidebar.tsx:322:26
                 id="diagnosticReasoning"
                 label="Diagnostic Reasoning"
                 icon={<GitBranch className="w-4 h-4" />}
-                onClick={() => navTo('/diagnostic-reasoning')}
+                onClick={() => undefined}
                 active={[
                   'diagnostic-reasoning',

[NoCoverage] StringLiteral
components/Sidebar.tsx:324:19
                 icon={<GitBranch className="w-4 h-4" />}
                 onClick={() => navTo('/diagnostic-reasoning')}
                 active={[
-                  'diagnostic-reasoning',
+                  "",
                   'symptom-checker',
                   'finder',

[NoCoverage] StringLiteral
components/Sidebar.tsx:326:19
                 active={[
                   'diagnostic-reasoning',
                   'symptom-checker',
-                  'finder',
+                  "",
                   'correlation',
                   'derm-revisor'

[NoCoverage] ArrowFunction
components/Sidebar.tsx:339:26
                 id="investigationsHub"
                 label="Investigations Hub"
                 icon={<Microscope className="w-4 h-4" />}
-                onClick={() => navTo('/investigations-hub')}
+                onClick={() => undefined}
                 active={[
                   'investigations-hub',

[NoCoverage] StringLiteral
components/Sidebar.tsx:345:19
                   'investigations',
                   'ecg',
                   'radiology',
-                  'clinical-calculators'
+                  ""
                 ].includes(currentView)}
                 color="emerald"

[NoCoverage] ArrowFunction
components/Sidebar.tsx:356:26
                 id="therapeuticsTox"
                 label="Therapeutics & Tox"
                 icon={<Pill className="w-4 h-4" />}
-                onClick={() => navTo('/therapeutics-tox')}
+                onClick={() => undefined}
                 active={[
                   'therapeutics-tox',

[NoCoverage] StringLiteral
components/Sidebar.tsx:359:19
                 onClick={() => navTo('/therapeutics-tox')}
                 active={[
                   'therapeutics-tox',
-                  'generic-pharmacology',
+                  "",
                   'pharmacology',
                   'pharmacology-tox',

[NoCoverage] ArrowFunction
components/Sidebar.tsx:374:26
                 id="acuteInterventions"
                 label="Acute Interventions"
                 icon={<Zap className="w-4 h-4" />}
-                onClick={() => navTo('/acute-interventions')}
+                onClick={() => undefined}
                 active={[
                   'acute-interventions',

[NoCoverage] StringLiteral
components/Sidebar.tsx:376:19
                 icon={<Zap className="w-4 h-4" />}
                 onClick={() => navTo('/acute-interventions')}
                 active={[
-                  'acute-interventions',
+                  "",
                   'acute-care',
                   'procedures',

[NoCoverage] StringLiteral
components/Sidebar.tsx:377:19
                 onClick={() => navTo('/acute-interventions')}
                 active={[
                   'acute-interventions',
-                  'acute-care',
+                  "",
                   'procedures',
                   'anaesthetics-cc',

[NoCoverage] ArrowFunction
components/Sidebar.tsx:391:26
                 id="foundations"
                 label="Foundations"
                 icon={<Layers className="w-4 h-4" />}
-                onClick={() => navTo('/foundations')}
+                onClick={() => undefined}
                 active={['foundations', 'sciences-explorer', 'glossary'].includes(currentView)}
                 color="cyan"

[NoCoverage] StringLiteral
components/Sidebar.tsx:391:38
                 id="foundations"
                 label="Foundations"
                 icon={<Layers className="w-4 h-4" />}
-                onClick={() => navTo('/foundations')}
+                onClick={() => navTo("")}
                 active={['foundations', 'sciences-explorer', 'glossary'].includes(currentView)}
                 color="cyan"

[NoCoverage] StringLiteral
components/Sidebar.tsx:392:41
                 label="Foundations"
                 icon={<Layers className="w-4 h-4" />}
                 onClick={() => navTo('/foundations')}
-                active={['foundations', 'sciences-explorer', 'glossary'].includes(currentView)}
+                active={['foundations', "", 'glossary'].includes(currentView)}
                 color="cyan"
                 tooltip="Sciences, Pharmacology & Glossary"

[NoCoverage] StringLiteral
components/Sidebar.tsx:392:26
                 label="Foundations"
                 icon={<Layers className="w-4 h-4" />}
                 onClick={() => navTo('/foundations')}
-                active={['foundations', 'sciences-explorer', 'glossary'].includes(currentView)}
+                active={["", 'sciences-explorer', 'glossary'].includes(currentView)}
                 color="cyan"
                 tooltip="Sciences, Pharmacology & Glossary"

[NoCoverage] ConditionalExpression
components/Sidebar.tsx:402:12
         </div>
 
         <div className="space-y-2">
-          {!isCollapsed && (
-            <button
-              onClick={() => toggleSection('resources')}
-              className="w-full flex items-center justify-between px-3 mb-2 hover:bg-slate-950/40/5 py-1.5 rounded-lg transition-colors group"
-            >
-              <p className="text-[9px] font-black text-slate-400 group-hover:text-slate-400 uppercase tracking-[0.3em] transition-colors">
-                Resources & System
-              </p>
-              <ChevronDown
-                className={`w-3 h-3 text-slate-400 transition-transform duration-300 ${sectionsOpen.resources ? '' : '-rotate-90'}`}
-              />
-            </button>
-          )}
+          {false}
 
           {(sectionsOpen.resources || isCollapsed) && (

[NoCoverage] ArrowFunction
components/Sidebar.tsx:404:24
         <div className="space-y-2">
           {!isCollapsed && (
             <button
-              onClick={() => toggleSection('resources')}
+              onClick={() => undefined}
               className="w-full flex items-center justify-between px-3 mb-2 hover:bg-slate-950/40/5 py-1.5 rounded-lg transition-colors group"
             >

[NoCoverage] StringLiteral
components/Sidebar.tsx:404:44
         <div className="space-y-2">
           {!isCollapsed && (
             <button
-              onClick={() => toggleSection('resources')}
+              onClick={() => toggleSection("")}
               className="w-full flex items-center justify-between px-3 mb-2 hover:bg-slate-950/40/5 py-1.5 rounded-lg transition-colors group"
             >

[NoCoverage] LogicalOperator
components/Sidebar.tsx:416:13
             </button>
           )}
 
-          {(sectionsOpen.resources || isCollapsed) && (
+          {(sectionsOpen.resources && isCollapsed) && (
             <div className="space-y-1 animate-in slide-in-from-top-2 duration-300">
               <SidebarItem

[NoCoverage] ConditionalExpression
components/Sidebar.tsx:416:13
             </button>
           )}
 
-          {(sectionsOpen.resources || isCollapsed) && (
+          {(true) && (
             <div className="space-y-1 animate-in slide-in-from-top-2 duration-300">
               <SidebarItem

[NoCoverage] ArrowFunction
components/Sidebar.tsx:422:26
                 id="studyHub"
                 label="Study Hub"
                 icon={<GraduationCap className="w-4 h-4" />}
-                onClick={() => navTo('/study-hub')}
+                onClick={() => undefined}
                 active={currentView === 'study-hub'}
                 color="indigo"

[NoCoverage] ConditionalExpression
components/Sidebar.tsx:423:25
                 label="Study Hub"
                 icon={<GraduationCap className="w-4 h-4" />}
                 onClick={() => navTo('/study-hub')}
-                active={currentView === 'study-hub'}
+                active={true}
                 color="indigo"
                 tooltip="RGA MCQ Prep"

[NoCoverage] ConditionalExpression
components/Sidebar.tsx:423:25
                 label="Study Hub"
                 icon={<GraduationCap className="w-4 h-4" />}
                 onClick={() => navTo('/study-hub')}
-                active={currentView === 'study-hub'}
+                active={false}
                 color="indigo"
                 tooltip="RGA MCQ Prep"

[NoCoverage] ArrowFunction
components/Sidebar.tsx:433:26
                 id="knowledgeGraph"
                 label="Knowledge Graph"
                 icon={<Network className="w-4 h-4" />}
-                onClick={() => navTo('/knowledge-graph')}
+                onClick={() => undefined}
                 active={currentView === 'knowledge-graph'}
                 color="rose"

[NoCoverage] ConditionalExpression
components/Sidebar.tsx:434:25
                 label="Knowledge Graph"
                 icon={<Network className="w-4 h-4" />}
                 onClick={() => navTo('/knowledge-graph')}
-                active={currentView === 'knowledge-graph'}
+                active={false}
                 color="rose"
                 tooltip="LOD Architecture Explorer"

[NoCoverage] EqualityOperator
components/Sidebar.tsx:434:25
                 label="Knowledge Graph"
                 icon={<Network className="w-4 h-4" />}
                 onClick={() => navTo('/knowledge-graph')}
-                active={currentView === 'knowledge-graph'}
+                active={currentView !== 'knowledge-graph'}
                 color="rose"
                 tooltip="LOD Architecture Explorer"

[NoCoverage] ArrowFunction
components/Sidebar.tsx:446:26
                 id="downloads"
                 label="Download Manager"
                 icon={<CloudDownload className="w-4 h-4" />}
-                onClick={() => navTo('/downloads')}
+                onClick={() => undefined}
                 active={currentView === 'downloads'}
                 tooltip="Data Pipeline"

[NoCoverage] StringLiteral
components/Sidebar.tsx:446:38
                 id="downloads"
                 label="Download Manager"
                 icon={<CloudDownload className="w-4 h-4" />}
-                onClick={() => navTo('/downloads')}
+                onClick={() => navTo("")}
                 active={currentView === 'downloads'}
                 tooltip="Data Pipeline"

[NoCoverage] EqualityOperator
components/Sidebar.tsx:447:25
                 label="Download Manager"
                 icon={<CloudDownload className="w-4 h-4" />}
                 onClick={() => navTo('/downloads')}
-                active={currentView === 'downloads'}
+                active={currentView !== 'downloads'}
                 tooltip="Data Pipeline"
                 isCollapsed={isCollapsed}

[NoCoverage] ConditionalExpression
components/Sidebar.tsx:447:25
                 label="Download Manager"
                 icon={<CloudDownload className="w-4 h-4" />}
                 onClick={() => navTo('/downloads')}
-                active={currentView === 'downloads'}
+                active={false}
                 tooltip="Data Pipeline"
                 isCollapsed={isCollapsed}

[NoCoverage] ArrowFunction
components/Sidebar.tsx:456:28
                   id: 'tutorial',
                   label: 'Tutorial Info',
                   icon: <BookOpen className="w-4 h-4" />,
-                  onClick: () => navTo('/tutorial'),
+                  onClick: () => undefined,
                   active: currentView === 'tutorial',
                   tooltip: 'How to use MedEx'

[NoCoverage] ConditionalExpression
components/Sidebar.tsx:457:27
                   label: 'Tutorial Info',
                   icon: <BookOpen className="w-4 h-4" />,
                   onClick: () => navTo('/tutorial'),
-                  active: currentView === 'tutorial',
+                  active: true,
                   tooltip: 'How to use MedEx'
                 },

[NoCoverage] ConditionalExpression
components/Sidebar.tsx:457:27
                   label: 'Tutorial Info',
                   icon: <BookOpen className="w-4 h-4" />,
                   onClick: () => navTo('/tutorial'),
-                  active: currentView === 'tutorial',
+                  active: false,
                   tooltip: 'How to use MedEx'
                 },

[NoCoverage] ArrowFunction
components/Sidebar.tsx:464:28
                   id: 'settings',
                   label: 'Settings',
                   icon: <Settings className="w-4 h-4" />,
-                  onClick: () => navTo('/settings'),
+                  onClick: () => undefined,
                   active: currentView === 'settings',
                   tooltip: 'System Preferences'

[NoCoverage] ConditionalExpression
components/Sidebar.tsx:465:27
                   label: 'Settings',
                   icon: <Settings className="w-4 h-4" />,
                   onClick: () => navTo('/settings'),
-                  active: currentView === 'settings',
+                  active: true,
                   tooltip: 'System Preferences'
                 }

[NoCoverage] EqualityOperator
components/Sidebar.tsx:465:27
                   label: 'Settings',
                   icon: <Settings className="w-4 h-4" />,
                   onClick: () => navTo('/settings'),
-                  active: currentView === 'settings',
+                  active: currentView !== 'settings',
                   tooltip: 'System Preferences'
                 }

[NoCoverage] ArrowFunction
components/Sidebar.tsx:468:21
                   active: currentView === 'settings',
                   tooltip: 'System Preferences'
                 }
-              ].map((item) => (
-                <SidebarItem key={item.id} {...item} isCollapsed={isCollapsed} />
-              ))}
+              ].map(() => undefined)}
             </div>
           )}

[NoCoverage] ArrowFunction
components/Sidebar.tsx:480:20
         className={`p-6 border-t border-white/5 bg-[#0F1115]/80 backdrop-blur-xl shrink-0 space-y-4 ${isCollapsed ? 'items-center' : ''}`}
       >
         <button
-          onClick={() => setIsEditMode(!isEditMode)}
+          onClick={() => undefined}
         >

[NoCoverage] BooleanLiteral
components/Sidebar.tsx:480:40
         className={`p-6 border-t border-white/5 bg-[#0F1115]/80 backdrop-blur-xl shrink-0 space-y-4 ${isCollapsed ? 'items-center' : ''}`}
       >
         <button
-          onClick={() => setIsEditMode(!isEditMode)}
+          onClick={() => setIsEditMode(isEditMode)}
         >

[NoCoverage] StringLiteral
components/Sidebar.tsx:483:81
           onClick={() => setIsEditMode(!isEditMode)}
         >
-          <div className={`flex items-center ${isCollapsed ? 'justify-center' : 'gap-4'}`}>
+          <div className={`flex items-center ${isCollapsed ? 'justify-center' : ""}`}>
             <Code2 className="w-4 h-4 shrink-0" />
             {!isCollapsed && (

[NoCoverage] LogicalOperator
components/Sidebar.tsx:485:14
         >
           <div className={`flex items-center ${isCollapsed ? 'justify-center' : 'gap-4'}`}>
             <Code2 className="w-4 h-4 shrink-0" />
-            {!isCollapsed && (
-              <span className="text-[9px] font-black uppercase tracking-widest truncate animate-in fade-in slide-in-from-left-2 duration-500">
-                Edit Mode
-              </span>
-            )}
+            {!isCollapsed || <span className="text-[9px] font-black uppercase tracking-widest truncate animate-in fade-in slide-in-from-left-2 duration-500">
+                Edit Mode
+              </span>}
           </div>
           {!isCollapsed &&

[NoCoverage] BooleanLiteral
components/Sidebar.tsx:485:14
         >
           <div className={`flex items-center ${isCollapsed ? 'justify-center' : 'gap-4'}`}>
             <Code2 className="w-4 h-4 shrink-0" />
-            {!isCollapsed && (
+            {isCollapsed && (
               <span className="text-[9px] font-black uppercase tracking-widest truncate animate-in fade-in slide-in-from-left-2 duration-500">
                 Edit Mode

[NoCoverage] ConditionalExpression
components/Sidebar.tsx:491:12
               </span>
             )}
           </div>
-          {!isCollapsed &&
-            (isEditMode ? <ToggleRight className="w-5 h-5" /> : <ToggleLeft className="w-5 h-5" />)}
+          {false}
         </button>
 

[NoCoverage] ConditionalExpression
components/Sidebar.tsx:491:12
               </span>
             )}
           </div>
-          {!isCollapsed &&
-            (isEditMode ? <ToggleRight className="w-5 h-5" /> : <ToggleLeft className="w-5 h-5" />)}
+          {true}
         </button>
 
