[NoCoverage] EqualityOperator
components/StudyHubView.tsx:317:56
         </h3>
         <div className="grid grid-cols-1 md:grid-cols-2 gap-4">
           {RGA_TOPICS.map((topic) => {
-            const topicProgress = progress.find((p) => p.topic === topic.name);
+            const topicProgress = progress.find((p) => p.topic !== topic.name);
             return (
               <div

[NoCoverage] LogicalOperator
components/StudyHubView.tsx:335:22
                     </h4>
                   </div>
                   <span className="text-[10px] font-black text-indigo-400 uppercase tracking-widest">
-                    {topicProgress?.masteryLevel || 0}% Mastery
+                    {topicProgress?.masteryLevel && 0}% Mastery
                   </span>
                 </div>

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:335:22
                     </h4>
                   </div>
                   <span className="text-[10px] font-black text-indigo-400 uppercase tracking-widest">
-                    {topicProgress?.masteryLevel || 0}% Mastery
+                    {false}% Mastery
                   </span>
                 </div>

[NoCoverage] ArrowFunction
components/StudyHubView.tsx:341:30
 
                 <div className="flex gap-2 mt-auto">
                   <button
-                    onClick={() => startSession(topic.name, 'practice')}
+                    onClick={() => undefined}
                   >

[NoCoverage] StringLiteral
components/StudyHubView.tsx:341:61
 
                 <div className="flex gap-2 mt-auto">
                   <button
-                    onClick={() => startSession(topic.name, 'practice')}
+                    onClick={() => startSession(topic.name, "")}
                   >

[NoCoverage] ArrowFunction
components/StudyHubView.tsx:347:30
                     Practice Mode
                   </button>
                   <button
-                    onClick={() => startSession(topic.name, 'mock')}
+                    onClick={() => undefined}
                   >

[NoCoverage] BooleanLiteral
components/StudyHubView.tsx:362:9
   );
 
   const renderSession = () => {
-    if (!currentSession) return null;
+    if (currentSession) return null;
     const question = currentSession.questions[currentQuestionIndex];
 

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:362:9
   );
 
   const renderSession = () => {
-    if (!currentSession) return null;
+    if (false) return null;
     const question = currentSession.questions[currentQuestionIndex];
 

[NoCoverage] ArrowFunction
components/StudyHubView.tsx:369:22
       <div className="max-w-3xl mx-auto py-4">
         <div className="flex items-center justify-between mb-8">
           <button
-            onClick={() => setView('dashboard')}
+            onClick={() => undefined}
             className="flex items-center gap-2 text-slate-400 hover:text-white font-black uppercase text-[9px] tracking-widest transition-colors cursor-pointer"
           >

[NoCoverage] ArithmeticOperator
components/StudyHubView.tsx:376:25
           </button>
           <div className="flex items-center gap-4">
             <div className="text-[9px] font-black uppercase text-slate-400 tracking-widest">
-              Question {currentQuestionIndex + 1} / {currentSession.questions.length}
+              Question {currentQuestionIndex - 1} / {currentSession.questions.length}
             </div>
             <div className="w-24 h-1.5 bg-slate-900 rounded-full overflow-hidden border border-white/5">

[NoCoverage] ArithmeticOperator
components/StudyHubView.tsx:382:29
               <div
                 className="h-full bg-indigo-950/200 transition-all duration-500"
                 style={{
-                  width: `${((currentQuestionIndex + 1) / currentSession.questions.length) * 100}%`
+                  width: `${(currentQuestionIndex + 1) / currentSession.questions.length / 100}%`
                 }}
               />

[NoCoverage] ArithmeticOperator
components/StudyHubView.tsx:382:30
               <div
                 className="h-full bg-indigo-950/200 transition-all duration-500"
                 style={{
-                  width: `${((currentQuestionIndex + 1) / currentSession.questions.length) * 100}%`
+                  width: `${((currentQuestionIndex + 1) * currentSession.questions.length) * 100}%`
                 }}
               />

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:396:17
             </span>
             <span
               className={`px-2.5 py-1 rounded-lg border text-[9px] font-black uppercase tracking-widest ${
-                question.difficulty === 'Easy'
+                false
                   ? 'bg-emerald-950/50 border-emerald-500/20 text-emerald-400'
                   : question.difficulty === 'Medium'

[NoCoverage] EqualityOperator
components/StudyHubView.tsx:396:17
             </span>
             <span
               className={`px-2.5 py-1 rounded-lg border text-[9px] font-black uppercase tracking-widest ${
-                question.difficulty === 'Easy'
+                question.difficulty !== 'Easy'
                   ? 'bg-emerald-950/50 border-emerald-500/20 text-emerald-400'
                   : question.difficulty === 'Medium'

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:398:21
               className={`px-2.5 py-1 rounded-lg border text-[9px] font-black uppercase tracking-widest ${
                 question.difficulty === 'Easy'
                   ? 'bg-emerald-950/50 border-emerald-500/20 text-emerald-400'
-                  : question.difficulty === 'Medium'
+                  : true
                     ? 'bg-amber-955/50 border-amber-500/20 text-amber-400'
                     : 'bg-rose-95/-50 border-rose-500/20 text-rose-400'

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:398:21
               className={`px-2.5 py-1 rounded-lg border text-[9px] font-black uppercase tracking-widest ${
                 question.difficulty === 'Easy'
                   ? 'bg-emerald-950/50 border-emerald-500/20 text-emerald-400'
-                  : question.difficulty === 'Medium'
+                  : false
                     ? 'bg-amber-955/50 border-amber-500/20 text-amber-400'
                     : 'bg-rose-95/-50 border-rose-500/20 text-rose-400'

[NoCoverage] StringLiteral
components/StudyHubView.tsx:400:23
                   ? 'bg-emerald-950/50 border-emerald-500/20 text-emerald-400'
                   : question.difficulty === 'Medium'
                     ? 'bg-amber-955/50 border-amber-500/20 text-amber-400'
-                    : 'bg-rose-95/-50 border-rose-500/20 text-rose-400'
+                    : ""
               }`}
             >

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:413:34
 
           <div className="space-y-3">
             {question.options.map((option, idx) => {
-              const isSelected = selectedOption === idx;
+              const isSelected = false;
               const isCorrect = idx === question.correctOptionIndex;
               const showResult = selectedOption !== null;

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:413:34
 
           <div className="space-y-3">
             {question.options.map((option, idx) => {
-              const isSelected = selectedOption === idx;
+              const isSelected = true;
               const isCorrect = idx === question.correctOptionIndex;
               const showResult = selectedOption !== null;

[NoCoverage] EqualityOperator
components/StudyHubView.tsx:414:33
           <div className="space-y-3">
             {question.options.map((option, idx) => {
               const isSelected = selectedOption === idx;
-              const isCorrect = idx === question.correctOptionIndex;
+              const isCorrect = idx !== question.correctOptionIndex;
               const showResult = selectedOption !== null;
 

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:414:33
           <div className="space-y-3">
             {question.options.map((option, idx) => {
               const isSelected = selectedOption === idx;
-              const isCorrect = idx === question.correctOptionIndex;
+              const isCorrect = true;
               const showResult = selectedOption !== null;
 

[NoCoverage] EqualityOperator
components/StudyHubView.tsx:415:34
             {question.options.map((option, idx) => {
               const isSelected = selectedOption === idx;
               const isCorrect = idx === question.correctOptionIndex;
-              const showResult = selectedOption !== null;
+              const showResult = selectedOption === null;
 
               return (

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:415:34
             {question.options.map((option, idx) => {
               const isSelected = selectedOption === idx;
               const isCorrect = idx === question.correctOptionIndex;
-              const showResult = selectedOption !== null;
+              const showResult = false;
 
               return (

[NoCoverage] ArrowFunction
components/StudyHubView.tsx:420:28
               return (
                 <button
                   key={idx}
-                  onClick={() => handleAnswer(idx)}
+                  onClick={() => undefined}
                   disabled={selectedOption !== null}
                   className={`w-full p-4 rounded-2xl border transition-all text-left flex items-center justify-between group cursor-pointer ${

[NoCoverage] EqualityOperator
components/StudyHubView.tsx:421:29
                 <button
                   key={idx}
                   onClick={() => handleAnswer(idx)}
-                  disabled={selectedOption !== null}
+                  disabled={selectedOption === null}
                   className={`w-full p-4 rounded-2xl border transition-all text-left flex items-center justify-between group cursor-pointer ${
                     isSelected && isCorrect

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:421:29
                 <button
                   key={idx}
                   onClick={() => handleAnswer(idx)}
-                  disabled={selectedOption !== null}
+                  disabled={true}
                   className={`w-full p-4 rounded-2xl border transition-all text-left flex items-center justify-between group cursor-pointer ${
                     isSelected && isCorrect

[NoCoverage] StringLiteral
components/StudyHubView.tsx:422:30
                   key={idx}
                   onClick={() => handleAnswer(idx)}
                   disabled={selectedOption !== null}
-                  className={`w-full p-4 rounded-2xl border transition-all text-left flex items-center justify-between group cursor-pointer ${
-                    isSelected && isCorrect
-                      ? 'border-emerald-500 bg-emerald-950/20 text-emerald-300'
-                      : isSelected && !isCorrect
-                        ? 'border-rose-500 bg-rose-950/20 text-rose-300'
-                        : showResult && isCorrect
-                          ? 'border-emerald-500 bg-emerald-950/20 text-emerald-300'
-                          : 'border-white/5 bg-slate-950/40 text-slate-300 hover:border-indigo-500/40 hover:bg-slate-900'
-                  }`}
+                  className={``}
                 >
                   <span className="font-bold text-xs">{option}</span>

[NoCoverage] LogicalOperator
components/StudyHubView.tsx:423:21
                   onClick={() => handleAnswer(idx)}
                   disabled={selectedOption !== null}
                   className={`w-full p-4 rounded-2xl border transition-all text-left flex items-center justify-between group cursor-pointer ${
-                    isSelected && isCorrect
+                    isSelected || isCorrect
                       ? 'border-emerald-500 bg-emerald-950/20 text-emerald-300'
                       : isSelected && !isCorrect

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:423:21
                   onClick={() => handleAnswer(idx)}
                   disabled={selectedOption !== null}
                   className={`w-full p-4 rounded-2xl border transition-all text-left flex items-center justify-between group cursor-pointer ${
-                    isSelected && isCorrect
+                    false
                       ? 'border-emerald-500 bg-emerald-950/20 text-emerald-300'
                       : isSelected && !isCorrect

[NoCoverage] BooleanLiteral
components/StudyHubView.tsx:425:39
                   className={`w-full p-4 rounded-2xl border transition-all text-left flex items-center justify-between group cursor-pointer ${
                     isSelected && isCorrect
                       ? 'border-emerald-500 bg-emerald-950/20 text-emerald-300'
-                      : isSelected && !isCorrect
+                      : isSelected && isCorrect
                         ? 'border-rose-500 bg-rose-950/20 text-rose-300'
                         : showResult && isCorrect

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:425:25
                   className={`w-full p-4 rounded-2xl border transition-all text-left flex items-center justify-between group cursor-pointer ${
                     isSelected && isCorrect
                       ? 'border-emerald-500 bg-emerald-950/20 text-emerald-300'
-                      : isSelected && !isCorrect
+                      : true
                         ? 'border-rose-500 bg-rose-950/20 text-rose-300'
                         : showResult && isCorrect

[NoCoverage] StringLiteral
components/StudyHubView.tsx:426:27
                     isSelected && isCorrect
                       ? 'border-emerald-500 bg-emerald-950/20 text-emerald-300'
                       : isSelected && !isCorrect
-                        ? 'border-rose-500 bg-rose-950/20 text-rose-300'
+                        ? ""
                         : showResult && isCorrect
                           ? 'border-emerald-500 bg-emerald-950/20 text-emerald-300'

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:427:27
                       ? 'border-emerald-500 bg-emerald-950/20 text-emerald-300'
                       : isSelected && !isCorrect
                         ? 'border-rose-500 bg-rose-950/20 text-rose-300'
-                        : showResult && isCorrect
+                        : true
                           ? 'border-emerald-500 bg-emerald-950/20 text-emerald-300'
                           : 'border-white/5 bg-slate-950/40 text-slate-300 hover:border-indigo-500/40 hover:bg-slate-900'

[NoCoverage] LogicalOperator
components/StudyHubView.tsx:427:27
                       ? 'border-emerald-500 bg-emerald-950/20 text-emerald-300'
                       : isSelected && !isCorrect
                         ? 'border-rose-500 bg-rose-950/20 text-rose-300'
-                        : showResult && isCorrect
+                        : showResult || isCorrect
                           ? 'border-emerald-500 bg-emerald-950/20 text-emerald-300'
                           : 'border-white/5 bg-slate-950/40 text-slate-300 hover:border-indigo-500/40 hover:bg-slate-900'

[NoCoverage] StringLiteral
components/StudyHubView.tsx:429:29
                         ? 'border-rose-500 bg-rose-950/20 text-rose-300'
                         : showResult && isCorrect
                           ? 'border-emerald-500 bg-emerald-950/20 text-emerald-300'
-                          : 'border-white/5 bg-slate-950/40 text-slate-300 hover:border-indigo-500/40 hover:bg-slate-900'
+                          : ""
                   }`}
                 >

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:433:20
                   }`}
                 >
                   <span className="font-bold text-xs">{option}</span>
-                  {showResult && isCorrect && (
-                    <CheckCircle2 className="w-5 h-5 text-emerald-500 shrink-0" />
-                  )}
+                  {false}
                   {isSelected && !isCorrect && (
                     <XCircle className="w-5 h-5 text-rose-500 shrink-0" />

[NoCoverage] LogicalOperator
components/StudyHubView.tsx:433:20
                   }`}
                 >
                   <span className="font-bold text-xs">{option}</span>
-                  {showResult && isCorrect && (
+                  {showResult || isCorrect && (
                     <CheckCircle2 className="w-5 h-5 text-emerald-500 shrink-0" />
                   )}

[NoCoverage] LogicalOperator
components/StudyHubView.tsx:436:20
                   {showResult && isCorrect && (
                     <CheckCircle2 className="w-5 h-5 text-emerald-500 shrink-0" />
                   )}
-                  {isSelected && !isCorrect && (
-                    <XCircle className="w-5 h-5 text-rose-500 shrink-0" />
-                  )}
+                  {isSelected && !isCorrect || <XCircle className="w-5 h-5 text-rose-500 shrink-0" />}
                 </button>
               );

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:436:20
                   {showResult && isCorrect && (
                     <CheckCircle2 className="w-5 h-5 text-emerald-500 shrink-0" />
                   )}
-                  {isSelected && !isCorrect && (
-                    <XCircle className="w-5 h-5 text-rose-500 shrink-0" />
-                  )}
+                  {false}
                 </button>
               );

[NoCoverage] ObjectLiteral
components/StudyHubView.tsx:448:26
             {showExplanation && (
               <motion.div
                 initial={{ opacity: 0, height: 0 }}
-                animate={{ opacity: 1, height: 'auto' }}
+                animate={{}}
                 className="mt-8 pt-8 border-t border-white/5"
               >

[NoCoverage] EqualityOperator
components/StudyHubView.tsx:461:20
                   onClick={nextQuestion}
                 >
-                  {currentQuestionIndex === currentSession.questions.length - 1
+                  {currentQuestionIndex !== currentSession.questions.length - 1
                     ? 'Complete Session'
                     : 'Next Question'}

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:461:20
                   onClick={nextQuestion}
                 >
-                  {currentQuestionIndex === currentSession.questions.length - 1
+                  {true
                     ? 'Complete Session'
                     : 'Next Question'}

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:475:9
   };
 
   const renderResults = () => {
-    if (!currentSession) return null;
+    if (true) return null;
     const percentage = Math.round((currentSession.score / currentSession.questions.length) * 100);
 

[NoCoverage] BooleanLiteral
components/StudyHubView.tsx:475:9
   };
 
   const renderResults = () => {
-    if (!currentSession) return null;
+    if (currentSession) return null;
     const percentage = Math.round((currentSession.score / currentSession.questions.length) * 100);
 

[NoCoverage] ArithmeticOperator
components/StudyHubView.tsx:476:35
 
   const renderResults = () => {
     if (!currentSession) return null;
-    const percentage = Math.round((currentSession.score / currentSession.questions.length) * 100);
+    const percentage = Math.round(currentSession.score / currentSession.questions.length / 100);
 
     return (

[NoCoverage] ArithmeticOperator
components/StudyHubView.tsx:476:36
 
   const renderResults = () => {
     if (!currentSession) return null;
-    const percentage = Math.round((currentSession.score / currentSession.questions.length) * 100);
+    const percentage = Math.round((currentSession.score * currentSession.questions.length) * 100);
 
     return (

[NoCoverage] StringLiteral
components/StudyHubView.tsx:509:36
 
         <div className="flex gap-3">
           <button
-            onClick={() => setView('dashboard')}
+            onClick={() => setView("")}
             className="flex-1 py-3 bg-slate-900 hover:bg-slate-800 text-slate-300 border border-white/5 rounded-xl font-black text-xs uppercase tracking-widest transition-all cursor-pointer"
           >

[NoCoverage] ArrowFunction
components/StudyHubView.tsx:515:22
             Dashboard
           </button>
           <button
-            onClick={() => selectedTopic && startSession(selectedTopic)}
+            onClick={() => undefined}
           >

[NoCoverage] LogicalOperator
components/StudyHubView.tsx:515:28
             Dashboard
           </button>
           <button
-            onClick={() => selectedTopic && startSession(selectedTopic)}
+            onClick={() => selectedTopic || startSession(selectedTopic)}
           >

[NoCoverage] BlockStatement
components/StudyHubView.tsx:533:40
             Select Focus Topic
           </h3>
           <div className="space-y-1">
-            {RGA_TOPICS.map((topic) => {
-              const topicProgress = progress.find((p) => p.topic === topic.name);
-              return (
-                <button
-                  key={topic.id}
-                  onClick={() => {
-                    if (view === 'dashboard') {
-                      startSession(topic.name, 'practice');
-                    }
-                  }}
-                  className={`w-full text-left px-3 py-2.5 rounded-xl text-[10px] font-bold uppercase tracking-wider flex items-center justify-between transition-all cursor-pointer ${
-                    selectedTopic === topic.name
-                      ? 'text-indigo-400 bg-indigo-950/200/10'
-                      : 'text-slate-400 hover:text-slate-200 hover:bg-slate-950/40/[0.02]'
-                  }`}
-                >
-                  <span className="truncate">{topic.name}</span>
-                  <span className="text-[9px] text-slate-400 font-medium shrink-0 ml-2">
-                    {topicProgress?.masteryLevel || 0}%
-                  </span>
-                </button>
-              );
-            })}
+            {RGA_TOPICS.map((topic) => {})}
           </div>
         </div>

[NoCoverage] ArrowFunction
components/StudyHubView.tsx:534:51
           </h3>
           <div className="space-y-1">
             {RGA_TOPICS.map((topic) => {
-              const topicProgress = progress.find((p) => p.topic === topic.name);
+              const topicProgress = progress.find(() => undefined);
               return (
                 <button

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:534:58
           </h3>
           <div className="space-y-1">
             {RGA_TOPICS.map((topic) => {
-              const topicProgress = progress.find((p) => p.topic === topic.name);
+              const topicProgress = progress.find((p) => false);
               return (
                 <button

[NoCoverage] BlockStatement
components/StudyHubView.tsx:538:34
               return (
                 <button
                   key={topic.id}
-                  onClick={() => {
-                    if (view === 'dashboard') {
-                      startSession(topic.name, 'practice');
-                    }
-                  }}
+                  onClick={() => {}}
                   className={`w-full text-left px-3 py-2.5 rounded-xl text-[10px] font-bold uppercase tracking-wider flex items-center justify-between transition-all cursor-pointer ${
                     selectedTopic === topic.name

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:539:25
                 <button
                   key={topic.id}
                   onClick={() => {
-                    if (view === 'dashboard') {
+                    if (true) {
                       startSession(topic.name, 'practice');
                     }

[NoCoverage] EqualityOperator
components/StudyHubView.tsx:539:25
                 <button
                   key={topic.id}
                   onClick={() => {
-                    if (view === 'dashboard') {
+                    if (view !== 'dashboard') {
                       startSession(topic.name, 'practice');
                     }

[NoCoverage] EqualityOperator
components/StudyHubView.tsx:544:21
                     }
                   }}
                   className={`w-full text-left px-3 py-2.5 rounded-xl text-[10px] font-bold uppercase tracking-wider flex items-center justify-between transition-all cursor-pointer ${
-                    selectedTopic === topic.name
+                    selectedTopic !== topic.name
                       ? 'text-indigo-400 bg-indigo-950/200/10'
                       : 'text-slate-400 hover:text-slate-200 hover:bg-slate-950/40/[0.02]'

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:544:21
                     }
                   }}
                   className={`w-full text-left px-3 py-2.5 rounded-xl text-[10px] font-bold uppercase tracking-wider flex items-center justify-between transition-all cursor-pointer ${
-                    selectedTopic === topic.name
+                    true
                       ? 'text-indigo-400 bg-indigo-950/200/10'
                       : 'text-slate-400 hover:text-slate-200 hover:bg-slate-950/40/[0.02]'

[NoCoverage] StringLiteral
components/StudyHubView.tsx:546:25
                   className={`w-full text-left px-3 py-2.5 rounded-xl text-[10px] font-bold uppercase tracking-wider flex items-center justify-between transition-all cursor-pointer ${
                     selectedTopic === topic.name
                       ? 'text-indigo-400 bg-indigo-950/200/10'
-                      : 'text-slate-400 hover:text-slate-200 hover:bg-slate-950/40/[0.02]'
+                      : ""
                   }`}
                 >

[NoCoverage] OptionalChaining
components/StudyHubView.tsx:551:22
                 >
                   <span className="truncate">{topic.name}</span>
                   <span className="text-[9px] text-slate-400 font-medium shrink-0 ml-2">
-                    {topicProgress?.masteryLevel || 0}%
+                    {topicProgress.masteryLevel || 0}%
                   </span>
                 </button>

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:551:22
                 >
                   <span className="truncate">{topic.name}</span>
                   <span className="text-[9px] text-slate-400 font-medium shrink-0 ml-2">
-                    {topicProgress?.masteryLevel || 0}%
+                    {true}%
                   </span>
                 </button>

[NoCoverage] ArithmeticOperator
components/StudyHubView.tsx:573:46
             <div className="flex justify-between">
               <span className="text-slate-400">Total Score:</span>
               <span className="font-black text-white">
-                {progress.reduce((acc, p) => acc + p.correctAnswers, 0)}
+                {progress.reduce((acc, p) => acc - p.correctAnswers, 0)}
               </span>
             </div>

[NoCoverage] ArrowFunction
components/StudyHubView.tsx:573:34
             <div className="flex justify-between">
               <span className="text-slate-400">Total Score:</span>
               <span className="font-black text-white">
-                {progress.reduce((acc, p) => acc + p.correctAnswers, 0)}
+                {progress.reduce(() => undefined, 0)}
               </span>
             </div>

[NoCoverage] ArithmeticOperator
components/StudyHubView.tsx:579:46
             <div className="flex justify-between">
               <span className="text-slate-400">Attempted:</span>
               <span className="font-black text-white">
-                {progress.reduce((acc, p) => acc + p.questionsAttempted, 0)}
+                {progress.reduce((acc, p) => acc - p.questionsAttempted, 0)}
               </span>
             </div>

[NoCoverage] ArrowFunction
components/StudyHubView.tsx:579:34
             <div className="flex justify-between">
               <span className="text-slate-400">Attempted:</span>
               <span className="font-black text-white">
-                {progress.reduce((acc, p) => acc + p.questionsAttempted, 0)}
+                {progress.reduce(() => undefined, 0)}
               </span>
             </div>

[NoCoverage] ConditionalExpression
components/StudyHubView.tsx:585:18
             <div className="flex justify-between">
               <span className="text-slate-400">Average Accuracy:</span>
               <span className="font-black text-white">
-                {progress.reduce((acc, p) => acc + p.questionsAttempted, 0) > 0
+                {false
                   ? `${Math.round((progress.reduce((acc, p) => acc + p.correctAnswers, 0) / progress.reduce((acc, p) => acc + p.questionsAttempted, 0)) * 100)}%`
                   : '0%'}

[NoCoverage] EqualityOperator
components/StudyHubView.tsx:585:18
             <div className="flex justify-between">
               <span className="text-slate-400">Average Accuracy:</span>
               <span className="font-black text-white">
-                {progress.reduce((acc, p) => acc + p.questionsAttempted, 0) > 0
+                {progress.reduce((acc, p) => acc + p.questionsAttempted, 0) >= 0
                   ? `${Math.round((progress.reduce((acc, p) => acc + p.correctAnswers, 0) / progress.reduce((acc, p) => acc + p.questionsAttempted, 0)) * 100)}%`
                   : '0%'}
