[NoCoverage] LogicalOperator
components/SystemSection.tsx:30:19
     downloadedIds,
     syncingIds
   }) => {
-    const style = SYSTEM_THEMES[system] || DEFAULT_STYLE;
+    const style = SYSTEM_THEMES[system] && DEFAULT_STYLE;
     const downloadedCount = (exams || []).filter((e) => downloadedIds.has(e.id)).length;
 

[NoCoverage] ConditionalExpression
components/SystemSection.tsx:30:19
     downloadedIds,
     syncingIds
   }) => {
-    const style = SYSTEM_THEMES[system] || DEFAULT_STYLE;
+    const style = true;
     const downloadedCount = (exams || []).filter((e) => downloadedIds.has(e.id)).length;
 

[NoCoverage] ConditionalExpression
components/SystemSection.tsx:31:30
     syncingIds
   }) => {
     const style = SYSTEM_THEMES[system] || DEFAULT_STYLE;
-    const downloadedCount = (exams || []).filter((e) => downloadedIds.has(e.id)).length;
+    const downloadedCount = (false).filter((e) => downloadedIds.has(e.id)).length;
 
     return (

[NoCoverage] ConditionalExpression
components/SystemSection.tsx:31:30
     syncingIds
   }) => {
     const style = SYSTEM_THEMES[system] || DEFAULT_STYLE;
-    const downloadedCount = (exams || []).filter((e) => downloadedIds.has(e.id)).length;
+    const downloadedCount = (true).filter((e) => downloadedIds.has(e.id)).length;
 
     return (

[NoCoverage] ArrowFunction
components/SystemSection.tsx:36:20
     return (
       <div className="group/system animate-in fade-in slide-in-from-bottom-4 duration-700">
         <button
-          onClick={() => onToggle(system)}
+          onClick={() => undefined}
           className={`w-full flex items-center justify-between p-6 rounded-[32px] transition-all duration-700 border-2 backdrop-blur-xl group/btn overflow-hidden relative ${
             isExpanded

[NoCoverage] StringLiteral
components/SystemSection.tsx:37:22
       <div className="group/system animate-in fade-in slide-in-from-bottom-4 duration-700">
         <button
           onClick={() => onToggle(system)}
-          className={`w-full flex items-center justify-between p-6 rounded-[32px] transition-all duration-700 border-2 backdrop-blur-xl group/btn overflow-hidden relative ${
-            isExpanded
-              ? `${style.activeBg} ${style.border} ${style.glow} mb-8 scale-[1.01] shadow-2xl z-10`
-              : `bg-slate-900/40 border-white/5 hover:bg-slate-900/80 hover:border-slate-800 shadow-sm ${style.shadow}`
-          }`}
+          className={``}
         >
           {/* Background Accent Glow on Hover */}

[NoCoverage] StringLiteral
components/SystemSection.tsx:50:26
 
           <div className="flex items-center gap-5 relative z-10">
             <div
-              className={`p-4 rounded-2xl transition-all duration-700 shadow-xl border ${
-                isExpanded
-                  ? `${style.text} bg-slate-950 border-white/10 scale-110 rotate-3`
-                  : `bg-slate-950 border-white/5 ${style.text} group-hover/btn:scale-105 group-hover/btn:-rotate-2`
-              }`}
+              className={``}
             >
               {style.icon}

[NoCoverage] StringLiteral
components/SystemSection.tsx:60:124
             </div>
             <div className="text-left">
               <h3
-                className={`font-black tracking-tight text-xl transition-colors duration-500 ${isExpanded ? 'text-white' : 'text-slate-200'}`}
+                className={`font-black tracking-tight text-xl transition-colors duration-500 ${isExpanded ? 'text-white' : ""}`}
               >
                 {system}

[NoCoverage] StringLiteral
components/SystemSection.tsx:60:109
             </div>
             <div className="text-left">
               <h3
-                className={`font-black tracking-tight text-xl transition-colors duration-500 ${isExpanded ? 'text-white' : 'text-slate-200'}`}
+                className={`font-black tracking-tight text-xl transition-colors duration-500 ${isExpanded ? "" : 'text-slate-200'}`}
               >
                 {system}

[NoCoverage] StringLiteral
components/SystemSection.tsx:66:30
               </h3>
               <div className="flex items-center gap-3 mt-1">
                 <span
-                  className={`text-[10px] font-black uppercase tracking-widest transition-all duration-500 ${isExpanded ? 'text-slate-300' : 'text-slate-550'}`}
+                  className={``}
                 >
                   {(exams || []).length} Protocols

[NoCoverage] ConditionalExpression
components/SystemSection.tsx:68:21
                 <span
                   className={`text-[10px] font-black uppercase tracking-widest transition-all duration-500 ${isExpanded ? 'text-slate-300' : 'text-slate-550'}`}
                 >
-                  {(exams || []).length} Protocols
+                  {(true).length} Protocols
                 </span>
                 <div className="flex items-center gap-1.5 px-2 py-0.5 bg-slate-950/40 rounded-full border border-white/5">

[NoCoverage] ConditionalExpression
components/SystemSection.tsx:68:21
                 <span
                   className={`text-[10px] font-black uppercase tracking-widest transition-all duration-500 ${isExpanded ? 'text-slate-300' : 'text-slate-550'}`}
                 >
-                  {(exams || []).length} Protocols
+                  {(false).length} Protocols
                 </span>
                 <div className="flex items-center gap-1.5 px-2 py-0.5 bg-slate-950/40 rounded-full border border-white/5">

[NoCoverage] LogicalOperator
components/SystemSection.tsx:72:64
                 </span>
                 <div className="flex items-center gap-1.5 px-2 py-0.5 bg-slate-950/40 rounded-full border border-white/5">
                   <CheckCircle2
-                    className={`w-3 h-3 ${downloadedCount === (exams || []).length ? 'text-emerald-400' : 'text-slate-400'}`}
+                    className={`w-3 h-3 ${downloadedCount === (exams && []).length ? 'text-emerald-400' : 'text-slate-400'}`}
                   />
                   <span className="text-[8px] font-black text-slate-400">

[NoCoverage] EqualityOperator
components/SystemSection.tsx:72:43
                 </span>
                 <div className="flex items-center gap-1.5 px-2 py-0.5 bg-slate-950/40 rounded-full border border-white/5">
                   <CheckCircle2
-                    className={`w-3 h-3 ${downloadedCount === (exams || []).length ? 'text-emerald-400' : 'text-slate-400'}`}
+                    className={`w-3 h-3 ${downloadedCount !== (exams || []).length ? 'text-emerald-400' : 'text-slate-400'}`}
                   />
                   <span className="text-[8px] font-black text-slate-400">

[NoCoverage] LogicalOperator
components/SystemSection.tsx:75:43
                     className={`w-3 h-3 ${downloadedCount === (exams || []).length ? 'text-emerald-400' : 'text-slate-400'}`}
                   />
                   <span className="text-[8px] font-black text-slate-400">
-                    {downloadedCount} / {(exams || []).length}
+                    {downloadedCount} / {(exams && []).length}
                   </span>
                 </div>

[NoCoverage] ConditionalExpression
components/SystemSection.tsx:75:43
                     className={`w-3 h-3 ${downloadedCount === (exams || []).length ? 'text-emerald-400' : 'text-slate-400'}`}
                   />
                   <span className="text-[8px] font-black text-slate-400">
-                    {downloadedCount} / {(exams || []).length}
+                    {downloadedCount} / {(true).length}
                   </span>
                 </div>

[NoCoverage] StringLiteral
components/SystemSection.tsx:85:19
           <div
             className={`transition-all duration-700 w-12 h-12 rounded-full flex items-center justify-center border ${
               isExpanded
-                ? `rotate-180 bg-slate-950 text-white border-white/10 shadow-xl`
+                ? ``
                 : 'bg-slate-950/50 text-slate-400 border-white/5 group-hover/btn:text-slate-250 group-hover/btn:bg-slate-900'
             }`}

[NoCoverage] ConditionalExpression
components/SystemSection.tsx:93:10
           </div>
         </button>
 
-        {isExpanded && (
-          <div className="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-8 pl-6 ml-8 pb-10 animate-in zoom-in-95 duration-500 border-l-2 border-white/5">
-            {(exams || []).map((exam) => (
-              <ExaminationCard
-                key={exam.id}
-                exam={exam}
-                onSelect={onSelectExam}
-                onSync={onSyncExam}
-                isDownloaded={downloadedIds.has(exam.id)}
-                isSyncing={syncingIds.has(exam.id)}
-              />
-            ))}
-          </div>
-        )}
+        {true}
       </div>
     );

[NoCoverage] ConditionalExpression
components/SystemSection.tsx:93:10
           </div>
         </button>
 
-        {isExpanded && (
-          <div className="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-8 pl-6 ml-8 pb-10 animate-in zoom-in-95 duration-500 border-l-2 border-white/5">
-            {(exams || []).map((exam) => (
-              <ExaminationCard
-                key={exam.id}
-                exam={exam}
-                onSelect={onSelectExam}
-                onSync={onSyncExam}
-                isDownloaded={downloadedIds.has(exam.id)}
-                isSyncing={syncingIds.has(exam.id)}
-              />
-            ))}
-          </div>
-        )}
+        {false}
       </div>
     );

[NoCoverage] ArrowFunction
components/SystemSection.tsx:95:32
 
         {isExpanded && (
           <div className="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-8 pl-6 ml-8 pb-10 animate-in zoom-in-95 duration-500 border-l-2 border-white/5">
-            {(exams || []).map((exam) => (
-              <ExaminationCard
-                key={exam.id}
-                exam={exam}
-                onSelect={onSelectExam}
-                onSync={onSyncExam}
-                isDownloaded={downloadedIds.has(exam.id)}
-                isSyncing={syncingIds.has(exam.id)}
-              />
-            ))}
+            {(exams || []).map(() => undefined)}
           </div>
         )}

[NoCoverage] ConditionalExpression
components/SystemSection.tsx:95:15
 
         {isExpanded && (
           <div className="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-8 pl-6 ml-8 pb-10 animate-in zoom-in-95 duration-500 border-l-2 border-white/5">
-            {(exams || []).map((exam) => (
+            {(true).map((exam) => (
               <ExaminationCard
                 key={exam.id}
