[NoCoverage] StringLiteral
components/TherapeuticNavigator.tsx:23:52
 
 export const TherapeuticNavigator: React.FC = () => {
   const [query, setQuery] = useState('');
-  const [referenceUrl, setReferenceUrl] = useState('');
+  const [referenceUrl, setReferenceUrl] = useState("Stryker was here!");
   const [showUrlInput, setShowUrlInput] = useState(false);
   const [loading, setLoading] = useState(false);

[NoCoverage] BooleanLiteral
components/TherapeuticNavigator.tsx:24:52
 export const TherapeuticNavigator: React.FC = () => {
   const [query, setQuery] = useState('');
   const [referenceUrl, setReferenceUrl] = useState('');
-  const [showUrlInput, setShowUrlInput] = useState(false);
+  const [showUrlInput, setShowUrlInput] = useState(true);
   const [loading, setLoading] = useState(false);
   const [guidance, setGuidance] = useState<TherapeuticGuidance | null>(null);

[NoCoverage] BooleanLiteral
components/TherapeuticNavigator.tsx:25:42
   const [query, setQuery] = useState('');
   const [referenceUrl, setReferenceUrl] = useState('');
   const [showUrlInput, setShowUrlInput] = useState(false);
-  const [loading, setLoading] = useState(false);
+  const [loading, setLoading] = useState(true);
   const [guidance, setGuidance] = useState<TherapeuticGuidance | null>(null);
   const [error, setError] = useState<string | null>(null);

[NoCoverage] BlockStatement
components/TherapeuticNavigator.tsx:29:86
   const [guidance, setGuidance] = useState<TherapeuticGuidance | null>(null);
   const [error, setError] = useState<string | null>(null);
 
-  const handleSearch = async (e?: React.FormEvent, forceRefresh: boolean = false) => {
-    e?.preventDefault();
-    if (!query.trim()) return;
-
-    setLoading(true);
-    setError(null);
-    try {
-      const result = await gemini.getTherapeuticGuidance(
-        query,
-        forceRefresh,
-        referenceUrl || undefined
-      );
-      setGuidance(result);
-    } catch (err) {
-      setError('Failed to fetch therapeutic guidelines. Please try again.');
-      console.error(err);
-    } finally {
-      setLoading(false);
-    }
-  };
+  const handleSearch = async (e?: React.FormEvent, forceRefresh: boolean = false) => {};
 
   return (

[NoCoverage] BooleanLiteral
components/TherapeuticNavigator.tsx:29:76
   const [guidance, setGuidance] = useState<TherapeuticGuidance | null>(null);
   const [error, setError] = useState<string | null>(null);
 
-  const handleSearch = async (e?: React.FormEvent, forceRefresh: boolean = false) => {
+  const handleSearch = async (e?: React.FormEvent, forceRefresh: boolean = true) => {
     e?.preventDefault();
     if (!query.trim()) return;

[NoCoverage] OptionalChaining
components/TherapeuticNavigator.tsx:30:5
   const [error, setError] = useState<string | null>(null);
 
   const handleSearch = async (e?: React.FormEvent, forceRefresh: boolean = false) => {
-    e?.preventDefault();
+    e.preventDefault();
     if (!query.trim()) return;
 

[NoCoverage] ConditionalExpression
components/TherapeuticNavigator.tsx:31:9
 
   const handleSearch = async (e?: React.FormEvent, forceRefresh: boolean = false) => {
     e?.preventDefault();
-    if (!query.trim()) return;
+    if (false) return;
 
     setLoading(true);

[NoCoverage] BlockStatement
components/TherapeuticNavigator.tsx:35:9
 
     setLoading(true);
     setError(null);
-    try {
-      const result = await gemini.getTherapeuticGuidance(
-        query,
-        forceRefresh,
-        referenceUrl || undefined
-      );
-      setGuidance(result);
-    } catch (err) {
+    try {} catch (err) {
       setError('Failed to fetch therapeutic guidelines. Please try again.');
       console.error(err);

[NoCoverage] LogicalOperator
components/TherapeuticNavigator.tsx:39:9
       const result = await gemini.getTherapeuticGuidance(
         query,
         forceRefresh,
-        referenceUrl || undefined
+        referenceUrl && undefined
       );
       setGuidance(result);

[NoCoverage] ConditionalExpression
components/TherapeuticNavigator.tsx:39:9
       const result = await gemini.getTherapeuticGuidance(
         query,
         forceRefresh,
-        referenceUrl || undefined
+        true
       );
       setGuidance(result);

[NoCoverage] BlockStatement
components/TherapeuticNavigator.tsx:42:19
         referenceUrl || undefined
       );
       setGuidance(result);
-    } catch (err) {
-      setError('Failed to fetch therapeutic guidelines. Please try again.');
-      console.error(err);
-    } finally {
+    } catch (err) {} finally {
       setLoading(false);
     }

[NoCoverage] BooleanLiteral
components/TherapeuticNavigator.tsx:80:34
           />
           <button
             type="submit"
-            disabled={loading || !query.trim()}
+            disabled={loading || query.trim()}
           >

[NoCoverage] MethodExpression
components/TherapeuticNavigator.tsx:80:35
           />
           <button
             type="submit"
-            disabled={loading || !query.trim()}
+            disabled={loading || !query}
           >

[NoCoverage] BooleanLiteral
components/TherapeuticNavigator.tsx:89:44
 
         <div className="flex justify-center">
           <button
-            onClick={() => setShowUrlInput(!showUrlInput)}
+            onClick={() => setShowUrlInput(showUrlInput)}
             className="flex items-center gap-2 text-[10px] font-black uppercase text-slate-400 hover:text-amber-400 transition-colors tracking-widest cursor-pointer"
           >

[NoCoverage] ArrowFunction
components/TherapeuticNavigator.tsx:89:22
 
         <div className="flex justify-center">
           <button
-            onClick={() => setShowUrlInput(!showUrlInput)}
+            onClick={() => undefined}
             className="flex items-center gap-2 text-[10px] font-black uppercase text-slate-400 hover:text-amber-400 transition-colors tracking-widest cursor-pointer"
           >

[NoCoverage] StringLiteral
components/TherapeuticNavigator.tsx:93:29
             className="flex items-center gap-2 text-[10px] font-black uppercase text-slate-400 hover:text-amber-400 transition-colors tracking-widest cursor-pointer"
           >
             <ExternalLink className="w-3.5 h-3.5" />
-            {showUrlInput ? 'Hide Reference URL' : 'Attach Reference Pathway (URL)'}
+            {showUrlInput ? "" : 'Attach Reference Pathway (URL)'}
           </button>
         </div>

[NoCoverage] StringLiteral
components/TherapeuticNavigator.tsx:93:52
             className="flex items-center gap-2 text-[10px] font-black uppercase text-slate-400 hover:text-amber-400 transition-colors tracking-widest cursor-pointer"
           >
             <ExternalLink className="w-3.5 h-3.5" />
-            {showUrlInput ? 'Hide Reference URL' : 'Attach Reference Pathway (URL)'}
+            {showUrlInput ? 'Hide Reference URL' : ""}
           </button>
         </div>

[NoCoverage] ConditionalExpression
components/TherapeuticNavigator.tsx:98:12
         </div>
 
         <AnimatePresence>
-          {showUrlInput && (
-            <motion.div
-              initial={{ opacity: 0, height: 0 }}
-              animate={{ opacity: 1, height: 'auto' }}
-              exit={{ opacity: 0, height: 0 }}
-              className="overflow-hidden"
-            >
-              <div className="p-6 bg-slate-900/60 rounded-[24px] border border-white/5">
-                <label className="block text-[9px] font-black uppercase text-slate-400 tracking-widest mb-2">
-                  Reference Pathway URL (PDF or Webpage)
-                </label>
-                <input
-                  type="url"
-                  value={referenceUrl}
-                  onChange={(e) => setReferenceUrl(e.target.value)}
-                  placeholder="https://www.health.qld.gov.au/.../pathway.pdf"
-                  className="w-full bg-slate-950 border border-white/5 text-white rounded-xl px-4 py-3 text-xs font-bold outline-none focus:border-amber-500"
-                />
-                <p className="text-[8px] text-slate-400 mt-2 font-medium">
-                  The AI will use this document as the primary source of truth for management steps.
-                </p>
-              </div>
-            </motion.div>
-          )}
+          {true}
         </AnimatePresence>
       </div>

[NoCoverage] ConditionalExpression
components/TherapeuticNavigator.tsx:98:12
         </div>
 
         <AnimatePresence>
-          {showUrlInput && (
-            <motion.div
-              initial={{ opacity: 0, height: 0 }}
-              animate={{ opacity: 1, height: 'auto' }}
-              exit={{ opacity: 0, height: 0 }}
-              className="overflow-hidden"
-            >
-              <div className="p-6 bg-slate-900/60 rounded-[24px] border border-white/5">
-                <label className="block text-[9px] font-black uppercase text-slate-400 tracking-widest mb-2">
-                  Reference Pathway URL (PDF or Webpage)
-                </label>
-                <input
-                  type="url"
-                  value={referenceUrl}
-                  onChange={(e) => setReferenceUrl(e.target.value)}
-                  placeholder="https://www.health.qld.gov.au/.../pathway.pdf"
-                  className="w-full bg-slate-950 border border-white/5 text-white rounded-xl px-4 py-3 text-xs font-bold outline-none focus:border-amber-500"
-                />
-                <p className="text-[8px] text-slate-400 mt-2 font-medium">
-                  The AI will use this document as the primary source of truth for management steps.
-                </p>
-              </div>
-            </motion.div>
-          )}
+          {false}
         </AnimatePresence>
       </div>

[NoCoverage] ObjectLiteral
components/TherapeuticNavigator.tsx:102:21
             <motion.div
               initial={{ opacity: 0, height: 0 }}
               animate={{ opacity: 1, height: 'auto' }}
-              exit={{ opacity: 0, height: 0 }}
+              exit={{}}
               className="overflow-hidden"
             >

[NoCoverage] ArrowFunction
components/TherapeuticNavigator.tsx:112:29
                 <input
                   type="url"
                   value={referenceUrl}
-                  onChange={(e) => setReferenceUrl(e.target.value)}
+                  onChange={() => undefined}
                   placeholder="https://www.health.qld.gov.au/.../pathway.pdf"
                   className="w-full bg-slate-950 border border-white/5 text-white rounded-xl px-4 py-3 text-xs font-bold outline-none focus:border-amber-500"

[NoCoverage] ArrowFunction
components/TherapeuticNavigator.tsx:176:24
             <AlertCircle className="w-12 h-12 text-red-400 mx-auto mb-4" />
             <h3 className="text-lg font-bold text-red-200">{error}</h3>
             <button
-              onClick={() => handleSearch()}
+              onClick={() => undefined}
             >

[NoCoverage] ObjectLiteral
components/TherapeuticNavigator.tsx:184:22
           </motion.div>
         ) : guidance ? (
           <motion.div
-            initial={{ opacity: 0, y: 20 }}
+            initial={{}}
             animate={{ opacity: 1, y: 0 }}
             className="space-y-8"

[NoCoverage] LogicalOperator
components/TherapeuticNavigator.tsx:192:20
             <div className="bg-slate-900 p-10 rounded-[48px] border border-white/5 shadow-sm relative group">
               <div className="flex items-center justify-between mb-6">
                 <div className="flex flex-col gap-1">
-                  {guidance.retrievedAt && (
-                    <div className="flex items-center gap-2 text-[10px] font-black text-slate-400 uppercase tracking-[0.2em]">
-                      <Clock className="w-3 h-3" /> Retrieved:{' '}
-                      {new Date(guidance.retrievedAt).toLocaleString()}
-                    </div>
-                  )}
+                  {guidance.retrievedAt || <div className="flex items-center gap-2 text-[10px] font-black text-slate-400 uppercase tracking-[0.2em]">
+                      <Clock className="w-3 h-3" /> Retrieved:{' '}
+                      {new Date(guidance.retrievedAt).toLocaleString()}
+                    </div>}
                   {guidance.referenceUrl && (
                     <div className="flex items-center gap-2 text-[9px] font-black text-amber-500 uppercase tracking-widest">

[NoCoverage] ConditionalExpression
components/TherapeuticNavigator.tsx:192:20
             <div className="bg-slate-900 p-10 rounded-[48px] border border-white/5 shadow-sm relative group">
               <div className="flex items-center justify-between mb-6">
                 <div className="flex flex-col gap-1">
-                  {guidance.retrievedAt && (
-                    <div className="flex items-center gap-2 text-[10px] font-black text-slate-400 uppercase tracking-[0.2em]">
-                      <Clock className="w-3 h-3" /> Retrieved:{' '}
-                      {new Date(guidance.retrievedAt).toLocaleString()}
-                    </div>
-                  )}
+                  {false}
                   {guidance.referenceUrl && (
                     <div className="flex items-center gap-2 text-[9px] font-black text-amber-500 uppercase tracking-widest">

[NoCoverage] ConditionalExpression
components/TherapeuticNavigator.tsx:198:20
                       {new Date(guidance.retrievedAt).toLocaleString()}
                     </div>
                   )}
-                  {guidance.referenceUrl && (
-                    <div className="flex items-center gap-2 text-[9px] font-black text-amber-500 uppercase tracking-widest">
-                      <ShieldAlert className="w-3 h-3" /> Grounded in Reference Pathway
-                    </div>
-                  )}
+                  {true}
                 </div>
                 <button

[NoCoverage] LogicalOperator
components/TherapeuticNavigator.tsx:198:20
                       {new Date(guidance.retrievedAt).toLocaleString()}
                     </div>
                   )}
-                  {guidance.referenceUrl && (
-                    <div className="flex items-center gap-2 text-[9px] font-black text-amber-500 uppercase tracking-widest">
-                      <ShieldAlert className="w-3 h-3" /> Grounded in Reference Pathway
-                    </div>
-                  )}
+                  {guidance.referenceUrl || <div className="flex items-center gap-2 text-[9px] font-black text-amber-500 uppercase tracking-widest">
+                      <ShieldAlert className="w-3 h-3" /> Grounded in Reference Pathway
+                    </div>}
                 </div>
                 <button

[NoCoverage] BooleanLiteral
components/TherapeuticNavigator.tsx:205:58
                   )}
                 </div>
                 <button
-                  onClick={() => handleSearch(undefined, true)}
+                  onClick={() => handleSearch(undefined, false)}
                   disabled={loading}

[NoCoverage] ArrowFunction
components/TherapeuticNavigator.tsx:205:28
                   )}
                 </div>
                 <button
-                  onClick={() => handleSearch(undefined, true)}
+                  onClick={() => undefined}
                   disabled={loading}

[NoCoverage] StringLiteral
components/TherapeuticNavigator.tsx:210:62
                   title="Force re-acquisition from live sources"
                 >
-                  <RefreshCw className={`w-3 h-3 ${loading ? 'animate-spin' : ''}`} /> Refresh Live
+                  <RefreshCw className={`w-3 h-3 ${loading ? "" : ''}`} /> Refresh Live
                 </button>
               </div>

[NoCoverage] StringLiteral
components/TherapeuticNavigator.tsx:210:79
                   title="Force re-acquisition from live sources"
                 >
-                  <RefreshCw className={`w-3 h-3 ${loading ? 'animate-spin' : ''}`} /> Refresh Live
+                  <RefreshCw className={`w-3 h-3 ${loading ? 'animate-spin' : "Stryker was here!"}`} /> Refresh Live
                 </button>
               </div>

[NoCoverage] ArrowFunction
components/TherapeuticNavigator.tsx:224:43
                   <Activity className="w-4 h-4" /> First-Line Management
                 </h3>
                 <ul className="space-y-4">
-                  {guidance.firstLine.map((item, i) => (
-                    <li key={i} className="flex gap-3 text-slate-300 font-medium">
-                      <div className="mt-1.5 w-1.5 h-1.5 rounded-full bg-emerald-950/200 shrink-0" />
-                      {item}
-                    </li>
-                  ))}
+                  {guidance.firstLine.map(() => undefined)}
                 </ul>
               </div>

[NoCoverage] ArrowFunction
components/TherapeuticNavigator.tsx:239:44
                   <Info className="w-4 h-4" /> Alternative / 2nd Line
                 </h3>
                 <ul className="space-y-4">
-                  {guidance.secondLine.map((item, i) => (
-                    <li key={i} className="flex gap-3 text-slate-300 font-medium">
-                      <div className="mt-1.5 w-1.5 h-1.5 rounded-full bg-amber-950/200 shrink-0" />
-                      {item}
-                    </li>
-                  ))}
+                  {guidance.secondLine.map(() => undefined)}
                 </ul>
               </div>

[NoCoverage] ArrowFunction
components/TherapeuticNavigator.tsx:263:42
                 <Activity className="w-4 h-4" /> Monitoring & Follow-up
               </h3>
               <div className="grid grid-cols-1 sm:grid-cols-2 gap-4">
-                {guidance.monitoring.map((item, i) => (
-                  <div
-                    key={i}
-                    className="flex items-center gap-3 p-4 bg-slate-950/40 border border-white/5 rounded-2xl text-slate-300 font-medium"
-                  >
-                    <ChevronRight className="w-4 h-4 text-slate-400" />
-                    {item}
-                  </div>
-                ))}
+                {guidance.monitoring.map(() => undefined)}
               </div>
             </div>

[NoCoverage] ArrowFunction
components/TherapeuticNavigator.tsx:281:39
                 <BookOpen className="w-4 h-4" /> Verified Sources & References
               </h3>
               <div className="grid grid-cols-1 sm:grid-cols-2 gap-4">
-                {guidance.sources.map((source, i) => (
-                  <a
-                    key={i}
-                    href={source.uri}
-                    target="_blank"
-                    rel="noopener noreferrer"
-                    className="flex items-center justify-between p-4 bg-slate-900 rounded-2xl border border-white/5 hover:border-amber-500/30 hover:shadow-md transition-all group cursor-pointer"
-                  >
-                    <div className="flex items-center gap-3 overflow-hidden">
-                      <div className="w-8 h-8 bg-amber-950/45 rounded-lg flex items-center justify-center shrink-0 border border-amber-500/10">
-                        <ExternalLink className="w-4 h-4 text-amber-400" />
-                      </div>
-                      <span className="text-sm font-bold text-slate-300 truncate group-hover:text-amber-400 transition-colors">
-                        {source.title}
-                      </span>
-                    </div>
-                    <ChevronRight className="w-4 h-4 text-slate-400 group-hover:text-amber-400" />
-                  </a>
-                ))}
+                {guidance.sources.map(() => undefined)}
               </div>
             </div>
