[NoCoverage] BlockStatement
scripts/batchGenerate.ts:166:32
     console.log(`Limiting run to ${limit} items.`);
   }
 
-  if (targetObjs.length === 0) {
-    console.log('No objectives to process.');
-    return;
-  }
+  if (targetObjs.length === 0) {}
 
   let successCount = 0;

[NoCoverage] EqualityOperator
scripts/batchGenerate.ts:166:7
     console.log(`Limiting run to ${limit} items.`);
   }
 
-  if (targetObjs.length === 0) {
+  if (targetObjs.length !== 0) {
     console.log('No objectives to process.');
     return;

[NoCoverage] UpdateOperator
scripts/batchGenerate.ts:172:42
   }
 
   let successCount = 0;
-  for (let i = 0; i < targetObjs.length; i++) {
+  for (let i = 0; i < targetObjs.length; i--) {
     const obj = targetObjs[i];
     const targetFile = mapPrefixToFile(obj.code);

[NoCoverage] ConditionalExpression
scripts/batchGenerate.ts:172:19
   }
 
   let successCount = 0;
-  for (let i = 0; i < targetObjs.length; i++) {
+  for (let i = 0; false; i++) {
     const obj = targetObjs[i];
     const targetFile = mapPrefixToFile(obj.code);

[NoCoverage] ArithmeticOperator
scripts/batchGenerate.ts:178:21
     ensureFileExists(targetFile);
 
     console.log(`\n======================================================`);
-    console.log(`[${i + 1}/${targetObjs.length}] Processing ${obj.code} -> ${targetFile}`);
+    console.log(`[${i - 1}/${targetObjs.length}] Processing ${obj.code} -> ${targetFile}`);
     console.log(`Objective: ${obj.text}`);
     console.log(`======================================================\n`);

[NoCoverage] StringLiteral
scripts/batchGenerate.ts:179:17
 
     console.log(`\n======================================================`);
     console.log(`[${i + 1}/${targetObjs.length}] Processing ${obj.code} -> ${targetFile}`);
-    console.log(`Objective: ${obj.text}`);
+    console.log(``);
     console.log(`======================================================\n`);
 

[NoCoverage] BlockStatement
scripts/batchGenerate.ts:182:9
     console.log(`Objective: ${obj.text}`);
     console.log(`======================================================\n`);
 
-    try {
-      execSync(
-        `npx tsx scripts/generateContent.ts --objective "${obj.code}" --file "${targetFile}"`,
-        { stdio: 'inherit' }
-      );
-      successCount++;
-    } catch (e: any) {
+    try {} catch (e: any) {
       console.error(`\n❌ Failed generating for ${obj.code}:`, e.message);
     }

[NoCoverage] StringLiteral
scripts/batchGenerate.ts:184:9
 
     try {
       execSync(
-        `npx tsx scripts/generateContent.ts --objective "${obj.code}" --file "${targetFile}"`,
+        ``,
         { stdio: 'inherit' }
       );

[NoCoverage] StringLiteral
scripts/batchGenerate.ts:185:18
     try {
       execSync(
         `npx tsx scripts/generateContent.ts --objective "${obj.code}" --file "${targetFile}"`,
-        { stdio: 'inherit' }
+        { stdio: "" }
       );
       successCount++;

[NoCoverage] UpdateOperator
scripts/batchGenerate.ts:187:7
         `npx tsx scripts/generateContent.ts --objective "${obj.code}" --file "${targetFile}"`,
         { stdio: 'inherit' }
       );
-      successCount++;
+      successCount--;
     } catch (e: any) {
       console.error(`\n❌ Failed generating for ${obj.code}:`, e.message);

[NoCoverage] BlockStatement
scripts/batchGenerate.ts:188:22
         { stdio: 'inherit' }
       );
       successCount++;
-    } catch (e: any) {
-      console.error(`\n❌ Failed generating for ${obj.code}:`, e.message);
-    }
+    } catch (e: any) {}
 
     if (i < targetObjs.length - 1 && delayMs > 0) {

[NoCoverage] EqualityOperator
scripts/batchGenerate.ts:192:9
       console.error(`\n❌ Failed generating for ${obj.code}:`, e.message);
     }
 
-    if (i < targetObjs.length - 1 && delayMs > 0) {
+    if (i <= targetObjs.length - 1 && delayMs > 0) {
       console.log(`⏳ Sleeping for ${delayMs / 1000} seconds to respect API rate limits...`);
       await new Promise((r) => setTimeout(r, delayMs));

[NoCoverage] BlockStatement
scripts/batchGenerate.ts:192:51
       console.error(`\n❌ Failed generating for ${obj.code}:`, e.message);
     }
 
-    if (i < targetObjs.length - 1 && delayMs > 0) {
-      console.log(`⏳ Sleeping for ${delayMs / 1000} seconds to respect API rate limits...`);
-      await new Promise((r) => setTimeout(r, delayMs));
-    }
+    if (i < targetObjs.length - 1 && delayMs > 0) {}
   }
 

[NoCoverage] ArithmeticOperator
scripts/batchGenerate.ts:193:37
     }
 
     if (i < targetObjs.length - 1 && delayMs > 0) {
-      console.log(`⏳ Sleeping for ${delayMs / 1000} seconds to respect API rate limits...`);
+      console.log(`⏳ Sleeping for ${delayMs * 1000} seconds to respect API rate limits...`);
       await new Promise((r) => setTimeout(r, delayMs));
     }

[NoCoverage] ArrowFunction
scripts/batchGenerate.ts:194:25
 
     if (i < targetObjs.length - 1 && delayMs > 0) {
       console.log(`⏳ Sleeping for ${delayMs / 1000} seconds to respect API rate limits...`);
-      await new Promise((r) => setTimeout(r, delayMs));
+      await new Promise(() => undefined);
     }
   }

[NoCoverage] StringLiteral
scripts/batchGenerate.ts:199:5
   }
 
   console.log(
-    `\nBatch process complete. Successfully processed ${successCount}/${targetObjs.length} items.`
+    ``
   );
 }
