[NoCoverage] StringLiteral
scripts/generateContent.ts:152:23
       console.warn(
         `⚠️ Warning: Objective code ${args.objective} not found in unique_learning_objectives.md. Generating from code prefix.`
       );
-      promptContext = `Curriculum Objective Code: ${args.objective}`;
+      promptContext = ``;
     }
   } else {

[NoCoverage] BlockStatement
scripts/generateContent.ts:154:10
       );
       promptContext = `Curriculum Objective Code: ${args.objective}`;
     }
-  } else {
-    promptContext = `Concept Topic: ${conceptName}`;
-  }
+  } else {}
 
   console.log(`\n🚀 Starting Content Generation Pipeline using model: ${args.model}`);

[NoCoverage] StringLiteral
scripts/generateContent.ts:155:21
       promptContext = `Curriculum Objective Code: ${args.objective}`;
     }
   } else {
-    promptContext = `Concept Topic: ${conceptName}`;
+    promptContext = ``;
   }
 

[NoCoverage] StringLiteral
scripts/generateContent.ts:159:15
   }
 
   console.log(`\n🚀 Starting Content Generation Pipeline using model: ${args.model}`);
-  console.log(`Target: ${conceptName} -> ${args.file}\n`);
+  console.log(``);
 
   // Prompt schemas and guidelines

[NoCoverage] StringLiteral
scripts/generateContent.ts:215:15
   `;
 
   // --- STEP 1: INITIAL GENERATION ---
-  console.log('1. Generating initial draft...');
+  console.log("");
   const genPrompt = `
   You are an elite Medical Education Architect designing materials for senior anaesthesia and intensive care fellowship candidates (CICM, ANZCA, RACP).

[NoCoverage] BlockStatement
scripts/generateContent.ts:227:7
   `;
 
   let draftText = '';
-  try {
-    const response = await ai.models.generateContent({
-      model: args.model,
-      contents: genPrompt,
-      config: {
-        responseMimeType: 'application/json',
-        systemInstruction: 'You are an elite medical education database builder.'
-      }
-    });
-    draftText = response.text || '';
-  } catch (error: any) {
+  try {} catch (error: any) {
     console.error(`❌ Initial generation failed: ${error.message}`);
     process.exit(1);

[NoCoverage] ConditionalExpression
scripts/generateContent.ts:236:17
         systemInstruction: 'You are an elite medical education database builder.'
       }
     });
-    draftText = response.text || '';
+    draftText = true;
   } catch (error: any) {
     console.error(`❌ Initial generation failed: ${error.message}`);

[NoCoverage] ConditionalExpression
scripts/generateContent.ts:236:17
         systemInstruction: 'You are an elite medical education database builder.'
       }
     });
-    draftText = response.text || '';
+    draftText = false;
   } catch (error: any) {
     console.error(`❌ Initial generation failed: ${error.message}`);

[NoCoverage] BlockStatement
scripts/generateContent.ts:237:24
       }
     });
     draftText = response.text || '';
-  } catch (error: any) {
-    console.error(`❌ Initial generation failed: ${error.message}`);
-    process.exit(1);
-  }
+  } catch (error: any) {}
 
   let draftObj: any = null;

[NoCoverage] BlockStatement
scripts/generateContent.ts:246:94
   let iterationsCount = 0;
 
   // Internal function to clean and validate
-  function validateDraft(jsonText: string): { success: boolean; data?: any; error?: string } {
-    try {
-      const cleaned = cleanJson(jsonText);
-      const parsed = JSON.parse(cleaned);
-      const validation = ConceptSchema.safeParse(parsed);
-      if (!validation.success) {
-        return { success: false, error: JSON.stringify(validation.error.format(), null, 2) };
-      }
-      return { success: true, data: validation.data };
-    } catch (e: any) {
-      return { success: false, error: `JSON Parse error: ${e.message}` };
-    }
-  }
+  function validateDraft(jsonText: string): { success: boolean; data?: any; error?: string } {}
 
   // Schema self-correction loop

[NoCoverage] BlockStatement
scripts/generateContent.ts:247:9
 
   // Internal function to clean and validate
   function validateDraft(jsonText: string): { success: boolean; data?: any; error?: string } {
-    try {
-      const cleaned = cleanJson(jsonText);
-      const parsed = JSON.parse(cleaned);
-      const validation = ConceptSchema.safeParse(parsed);
-      if (!validation.success) {
-        return { success: false, error: JSON.stringify(validation.error.format(), null, 2) };
-      }
-      return { success: true, data: validation.data };
-    } catch (e: any) {
+    try {} catch (e: any) {
       return { success: false, error: `JSON Parse error: ${e.message}` };
     }

[NoCoverage] BlockStatement
scripts/generateContent.ts:251:32
       const cleaned = cleanJson(jsonText);
       const parsed = JSON.parse(cleaned);
       const validation = ConceptSchema.safeParse(parsed);
-      if (!validation.success) {
-        return { success: false, error: JSON.stringify(validation.error.format(), null, 2) };
-      }
+      if (!validation.success) {}
       return { success: true, data: validation.data };
     } catch (e: any) {

[NoCoverage] BooleanLiteral
scripts/generateContent.ts:251:11
       const cleaned = cleanJson(jsonText);
       const parsed = JSON.parse(cleaned);
       const validation = ConceptSchema.safeParse(parsed);
-      if (!validation.success) {
+      if (validation.success) {
         return { success: false, error: JSON.stringify(validation.error.format(), null, 2) };
       }

[NoCoverage] BooleanLiteral
scripts/generateContent.ts:252:27
       const parsed = JSON.parse(cleaned);
       const validation = ConceptSchema.safeParse(parsed);
       if (!validation.success) {
-        return { success: false, error: JSON.stringify(validation.error.format(), null, 2) };
+        return { success: true, error: JSON.stringify(validation.error.format(), null, 2) };
       }
       return { success: true, data: validation.data };

[NoCoverage] BooleanLiteral
scripts/generateContent.ts:254:25
       if (!validation.success) {
         return { success: false, error: JSON.stringify(validation.error.format(), null, 2) };
       }
-      return { success: true, data: validation.data };
+      return { success: false, data: validation.data };
     } catch (e: any) {
       return { success: false, error: `JSON Parse error: ${e.message}` };

[NoCoverage] BlockStatement
scripts/generateContent.ts:255:22
         return { success: false, error: JSON.stringify(validation.error.format(), null, 2) };
       }
       return { success: true, data: validation.data };
-    } catch (e: any) {
-      return { success: false, error: `JSON Parse error: ${e.message}` };
-    }
+    } catch (e: any) {}
   }
 

[NoCoverage] BooleanLiteral
scripts/generateContent.ts:256:25
       }
       return { success: true, data: validation.data };
     } catch (e: any) {
-      return { success: false, error: `JSON Parse error: ${e.message}` };
+      return { success: true, error: `JSON Parse error: ${e.message}` };
     }
   }

[NoCoverage] StringLiteral
scripts/generateContent.ts:256:39
       }
       return { success: true, data: validation.data };
     } catch (e: any) {
-      return { success: false, error: `JSON Parse error: ${e.message}` };
+      return { success: false, error: `` };
     }
   }

[NoCoverage] ConditionalExpression
scripts/generateContent.ts:262:39
 
   // Schema self-correction loop
   let validationResult = validateDraft(draftText);
-  while (!validationResult.success && iterationsCount < 2) {
+  while (!validationResult.success && true) {
     console.log(
       `⚠️ Schema validation failed. Prompting model for self-correction (Attempt ${iterationsCount + 1})...`

[NoCoverage] LogicalOperator
scripts/generateContent.ts:262:10
 
   // Schema self-correction loop
   let validationResult = validateDraft(draftText);
-  while (!validationResult.success && iterationsCount < 2) {
+  while (!validationResult.success || iterationsCount < 2) {
     console.log(
       `⚠️ Schema validation failed. Prompting model for self-correction (Attempt ${iterationsCount + 1})...`

[NoCoverage] ArithmeticOperator
scripts/generateContent.ts:264:84
   let validationResult = validateDraft(draftText);
   while (!validationResult.success && iterationsCount < 2) {
     console.log(
-      `⚠️ Schema validation failed. Prompting model for self-correction (Attempt ${iterationsCount + 1})...`
+      `⚠️ Schema validation failed. Prompting model for self-correction (Attempt ${iterationsCount - 1})...`
     );
     console.log(validationResult.error);

[NoCoverage] UpdateOperator
scripts/generateContent.ts:267:5
       `⚠️ Schema validation failed. Prompting model for self-correction (Attempt ${iterationsCount + 1})...`
     );
     console.log(validationResult.error);
-    iterationsCount++;
+    iterationsCount--;
     try {
       const correctionResponse = await ai.models.generateContent({

[NoCoverage] ConditionalExpression
scripts/generateContent.ts:274:19
         config: { responseMimeType: 'application/json' }
       });
-      draftText = correctionResponse.text || '';
+      draftText = true;
       validationResult = validateDraft(draftText);
     } catch (error: any) {

[NoCoverage] LogicalOperator
scripts/generateContent.ts:274:19
         config: { responseMimeType: 'application/json' }
       });
-      draftText = correctionResponse.text || '';
+      draftText = correctionResponse.text && '';
       validationResult = validateDraft(draftText);
     } catch (error: any) {

[NoCoverage] BlockStatement
scripts/generateContent.ts:276:26
       });
       draftText = correctionResponse.text || '';
       validationResult = validateDraft(draftText);
-    } catch (error: any) {
-      console.error(`❌ Self-correction failed: ${error.message}`);
-      break;
-    }
+    } catch (error: any) {}
   }
 

[NoCoverage] StringLiteral
scripts/generateContent.ts:277:21
       draftText = correctionResponse.text || '';
       validationResult = validateDraft(draftText);
     } catch (error: any) {
-      console.error(`❌ Self-correction failed: ${error.message}`);
+      console.error(``);
       break;
     }

[NoCoverage] BlockStatement
scripts/generateContent.ts:282:34
     }
   }
 
-  if (!validationResult.success) {
-    console.error('❌ Fatal: Could not generate a schema-compliant JSON draft.');
-    process.exit(1);
-  }
+  if (!validationResult.success) {}
 
   draftObj = validationResult.data;

[NoCoverage] ConditionalExpression
scripts/generateContent.ts:282:7
     }
   }
 
-  if (!validationResult.success) {
+  if (true) {
     console.error('❌ Fatal: Could not generate a schema-compliant JSON draft.');
     process.exit(1);

[NoCoverage] ConditionalExpression
scripts/generateContent.ts:292:22
   // --- STEP 2: CRITIC REVIEW & REFLECTION LOOP ---
   let finalDraftObj = draftObj;
 
-  for (let iter = 1; iter <= args.iterations; iter++) {
+  for (let iter = 1; false; iter++) {
     console.log(`\n2. Critic evaluating draft (Iteration ${iter}/${args.iterations})...`);
 

[NoCoverage] UpdateOperator
scripts/generateContent.ts:292:47
   // --- STEP 2: CRITIC REVIEW & REFLECTION LOOP ---
   let finalDraftObj = draftObj;
 
-  for (let iter = 1; iter <= args.iterations; iter++) {
+  for (let iter = 1; iter <= args.iterations; iter--) {
     console.log(`\n2. Critic evaluating draft (Iteration ${iter}/${args.iterations})...`);
 

[NoCoverage] StringLiteral
scripts/generateContent.ts:293:17
   let finalDraftObj = draftObj;
 
   for (let iter = 1; iter <= args.iterations; iter++) {
-    console.log(`\n2. Critic evaluating draft (Iteration ${iter}/${args.iterations})...`);
+    console.log(``);
 
     const criticSystemPrompt = `

[NoCoverage] StringLiteral
scripts/generateContent.ts:295:32
   for (let iter = 1; iter <= args.iterations; iter++) {
     console.log(`\n2. Critic evaluating draft (Iteration ${iter}/${args.iterations})...`);
 
-    const criticSystemPrompt = `
-    You are a stringent, expert Consultant Physician and ANZCA Curriculum Examiner reviewing a database record for a medical education application.
-    Your job is to critically review the concept draft and find gaps or errors.
-    Look for:
-    1. Generic pathophysiology that needs deeper mechanistic explanation (e.g. molecular pathways, cellular receptors, biophysics).
-    2. Missing Likelihood Ratios (LR+ / LR-) or Sensitivity/Specificity metrics for clinical special tests.
-    3. Missing clinical pearls, pitfalls, or advanced nuances expected of a specialist consultant.
-    4. Malformed LaTeX or unescaped backslashes in equations.
-    
-    Respond ONLY with a bulleted list of missing details and corrections that must be made. If the concept is absolutely perfect, consultant-grade, and free of errors, respond ONLY with "PERFECT".
-    `;
+    const criticSystemPrompt = ``;
 
     const criticPrompt = `Review this draft concept and list what is missing or incorrect:\n\n${JSON.stringify(finalDraftObj, null, 2)}`;

[NoCoverage] StringLiteral
scripts/generateContent.ts:307:26
     Respond ONLY with a bulleted list of missing details and corrections that must be made. If the concept is absolutely perfect, consultant-grade, and free of errors, respond ONLY with "PERFECT".
     `;
 
-    const criticPrompt = `Review this draft concept and list what is missing or incorrect:\n\n${JSON.stringify(finalDraftObj, null, 2)}`;
+    const criticPrompt = ``;
 
     let criticFeedback = '';

[NoCoverage] BlockStatement
scripts/generateContent.ts:310:9
     const criticPrompt = `Review this draft concept and list what is missing or incorrect:\n\n${JSON.stringify(finalDraftObj, null, 2)}`;
 
     let criticFeedback = '';
-    try {
-      const response = await ai.models.generateContent({
-        model: args.model,
-        contents: criticPrompt,
-        config: {
-          systemInstruction: criticSystemPrompt
-        }
-      });
-      criticFeedback = response.text || '';
-    } catch (error: any) {
+    try {} catch (error: any) {
       console.error(`❌ Critic evaluation failed: ${error.message}`);
       break;

[NoCoverage] ObjectLiteral
scripts/generateContent.ts:311:56
 
     let criticFeedback = '';
     try {
-      const response = await ai.models.generateContent({
-        model: args.model,
-        contents: criticPrompt,
-        config: {
-          systemInstruction: criticSystemPrompt
-        }
-      });
+      const response = await ai.models.generateContent({});
       criticFeedback = response.text || '';
     } catch (error: any) {

[NoCoverage] ConditionalExpression
scripts/generateContent.ts:318:24
           systemInstruction: criticSystemPrompt
         }
       });
-      criticFeedback = response.text || '';
+      criticFeedback = false;
     } catch (error: any) {
       console.error(`❌ Critic evaluation failed: ${error.message}`);

[NoCoverage] ConditionalExpression
scripts/generateContent.ts:318:24
           systemInstruction: criticSystemPrompt
         }
       });
-      criticFeedback = response.text || '';
+      criticFeedback = true;
     } catch (error: any) {
       console.error(`❌ Critic evaluation failed: ${error.message}`);

[NoCoverage] BlockStatement
scripts/generateContent.ts:319:26
         }
       });
       criticFeedback = response.text || '';
-    } catch (error: any) {
-      console.error(`❌ Critic evaluation failed: ${error.message}`);
-      break;
-    }
+    } catch (error: any) {}
 
     console.log(

[NoCoverage] MethodExpression
scripts/generateContent.ts:325:49
     }
 
     console.log(
-      `\nCritic Feedback:\n-----------------\n${criticFeedback.trim()}\n-----------------`
+      `\nCritic Feedback:\n-----------------\n${criticFeedback}\n-----------------`
     );
 

[NoCoverage] StringLiteral
scripts/generateContent.ts:325:7
     }
 
     console.log(
-      `\nCritic Feedback:\n-----------------\n${criticFeedback.trim()}\n-----------------`
+      ``
     );
 

[NoCoverage] EqualityOperator
scripts/generateContent.ts:328:61
       `\nCritic Feedback:\n-----------------\n${criticFeedback.trim()}\n-----------------`
     );
 
-    if (criticFeedback.toUpperCase().includes('PERFECT') && criticFeedback.length < 20) {
+    if (criticFeedback.toUpperCase().includes('PERFECT') && criticFeedback.length <= 20) {
       console.log('🎉 Concept accepted by Critic without further revisions.');
       break;

[NoCoverage] ConditionalExpression
scripts/generateContent.ts:328:9
       `\nCritic Feedback:\n-----------------\n${criticFeedback.trim()}\n-----------------`
     );
 
-    if (criticFeedback.toUpperCase().includes('PERFECT') && criticFeedback.length < 20) {
+    if (false) {
       console.log('🎉 Concept accepted by Critic without further revisions.');
       break;

[NoCoverage] BlockStatement
scripts/generateContent.ts:351:9
     ${formatInstructions}
     `;
 
-    try {
-      const reviseResponse = await ai.models.generateContent({
-        model: args.model,
-        contents: revisePrompt,
-        config: {
-          responseMimeType: 'application/json',
-          systemInstruction: 'You are an elite medical education database builder.'
-        }
-      });
-
-      const revisionText = reviseResponse.text || '';
-      const validation = validateDraft(revisionText);
-      if (validation.success) {
-        finalDraftObj = validation.data;
-        console.log('✅ Revision successfully parsed and validated against schema.');
-      } else {
-        console.warn(
-          `⚠️ Revised draft failed schema validation: ${validation.error}. Retaining previous iteration.`
-        );
-      }
-    } catch (error: any) {
+    try {} catch (error: any) {
       console.error(`❌ Revision failed: ${error.message}. Retaining previous iteration.`);
     }

[NoCoverage] StringLiteral
scripts/generateContent.ts:357:30
         contents: revisePrompt,
         config: {
           responseMimeType: 'application/json',
-          systemInstruction: 'You are an elite medical education database builder.'
+          systemInstruction: ""
         }
       });

[NoCoverage] ConditionalExpression
scripts/generateContent.ts:361:28
         }
       });
 
-      const revisionText = reviseResponse.text || '';
+      const revisionText = true;
       const validation = validateDraft(revisionText);
       if (validation.success) {

[NoCoverage] ConditionalExpression
scripts/generateContent.ts:361:28
         }
       });
 
-      const revisionText = reviseResponse.text || '';
+      const revisionText = false;
       const validation = validateDraft(revisionText);
       if (validation.success) {

[NoCoverage] ConditionalExpression
scripts/generateContent.ts:363:11
 
       const revisionText = reviseResponse.text || '';
       const validation = validateDraft(revisionText);
-      if (validation.success) {
+      if (false) {
         finalDraftObj = validation.data;
         console.log('✅ Revision successfully parsed and validated against schema.');

[NoCoverage] ConditionalExpression
scripts/generateContent.ts:363:11
 
       const revisionText = reviseResponse.text || '';
       const validation = validateDraft(revisionText);
-      if (validation.success) {
+      if (true) {
         finalDraftObj = validation.data;
         console.log('✅ Revision successfully parsed and validated against schema.');

[NoCoverage] BlockStatement
scripts/generateContent.ts:366:14
       if (validation.success) {
         finalDraftObj = validation.data;
         console.log('✅ Revision successfully parsed and validated against schema.');
-      } else {
-        console.warn(
-          `⚠️ Revised draft failed schema validation: ${validation.error}. Retaining previous iteration.`
-        );
-      }
+      } else {}
     } catch (error: any) {
       console.error(`❌ Revision failed: ${error.message}. Retaining previous iteration.`);

[NoCoverage] BlockStatement
scripts/generateContent.ts:371:26
           `⚠️ Revised draft failed schema validation: ${validation.error}. Retaining previous iteration.`
         );
       }
-    } catch (error: any) {
-      console.error(`❌ Revision failed: ${error.message}. Retaining previous iteration.`);
-    }
+    } catch (error: any) {}
   }
 

[NoCoverage] StringLiteral
scripts/generateContent.ts:372:21
         );
       }
     } catch (error: any) {
-      console.error(`❌ Revision failed: ${error.message}. Retaining previous iteration.`);
+      console.error(``);
     }
   }

[NoCoverage] BlockStatement
scripts/generateContent.ts:378:7
 
   // --- STEP 4: WRITE TO TARGET JSON DATABASE FILE ---
   console.log(`\n💾 Appending concept to database file: ${targetFilePath}`);
-  try {
-    const fileContent = fs.readFileSync(targetFilePath, 'utf8');
-    const moduleObj = JSON.parse(fileContent);
-
-    if (!moduleObj.concepts) {
-      moduleObj.concepts = [];
-    }
-
-    // Check if concept already exists by conceptId and update, otherwise push new
-    const existingIndex = moduleObj.concepts.findIndex(
-      (c: any) => c.conceptId === finalDraftObj.conceptId
-    );
-    if (existingIndex >= 0) {
-      console.log(`Updating existing concept with ID: ${finalDraftObj.conceptId}`);
-      moduleObj.concepts[existingIndex] = finalDraftObj;
-    } else {
-      console.log(`Adding new concept with ID: ${finalDraftObj.conceptId}`);
-      moduleObj.concepts.push(finalDraftObj);
-    }
-
-    fs.writeFileSync(targetFilePath, JSON.stringify(moduleObj, null, 2), 'utf8');
-    console.log('🎉 Successfully saved concept to target file.');
-  } catch (error: any) {
+  try {} catch (error: any) {
     console.error(`❌ Error writing to database file: ${error.message}`);
     process.exit(1);

[NoCoverage] ConditionalExpression
scripts/generateContent.ts:382:9
     const fileContent = fs.readFileSync(targetFilePath, 'utf8');
     const moduleObj = JSON.parse(fileContent);
 
-    if (!moduleObj.concepts) {
+    if (false) {
       moduleObj.concepts = [];
     }

[NoCoverage] BooleanLiteral
scripts/generateContent.ts:382:9
     const fileContent = fs.readFileSync(targetFilePath, 'utf8');
     const moduleObj = JSON.parse(fileContent);
 
-    if (!moduleObj.concepts) {
+    if (moduleObj.concepts) {
       moduleObj.concepts = [];
     }

[NoCoverage] ConditionalExpression
scripts/generateContent.ts:388:19
 
     // Check if concept already exists by conceptId and update, otherwise push new
     const existingIndex = moduleObj.concepts.findIndex(
-      (c: any) => c.conceptId === finalDraftObj.conceptId
+      (c: any) => true
     );
     if (existingIndex >= 0) {

[NoCoverage] EqualityOperator
scripts/generateContent.ts:388:19
 
     // Check if concept already exists by conceptId and update, otherwise push new
     const existingIndex = moduleObj.concepts.findIndex(
-      (c: any) => c.conceptId === finalDraftObj.conceptId
+      (c: any) => c.conceptId !== finalDraftObj.conceptId
     );
     if (existingIndex >= 0) {

[NoCoverage] ConditionalExpression
scripts/generateContent.ts:390:9
     const existingIndex = moduleObj.concepts.findIndex(
       (c: any) => c.conceptId === finalDraftObj.conceptId
     );
-    if (existingIndex >= 0) {
+    if (false) {
       console.log(`Updating existing concept with ID: ${finalDraftObj.conceptId}`);
       moduleObj.concepts[existingIndex] = finalDraftObj;

[NoCoverage] EqualityOperator
scripts/generateContent.ts:390:9
     const existingIndex = moduleObj.concepts.findIndex(
       (c: any) => c.conceptId === finalDraftObj.conceptId
     );
-    if (existingIndex >= 0) {
+    if (existingIndex > 0) {
       console.log(`Updating existing concept with ID: ${finalDraftObj.conceptId}`);
       moduleObj.concepts[existingIndex] = finalDraftObj;

[NoCoverage] BlockStatement
scripts/generateContent.ts:393:12
     if (existingIndex >= 0) {
       console.log(`Updating existing concept with ID: ${finalDraftObj.conceptId}`);
       moduleObj.concepts[existingIndex] = finalDraftObj;
-    } else {
-      console.log(`Adding new concept with ID: ${finalDraftObj.conceptId}`);
-      moduleObj.concepts.push(finalDraftObj);
-    }
+    } else {}
 
     fs.writeFileSync(targetFilePath, JSON.stringify(moduleObj, null, 2), 'utf8');

[NoCoverage] BlockStatement
scripts/generateContent.ts:400:24
 
     fs.writeFileSync(targetFilePath, JSON.stringify(moduleObj, null, 2), 'utf8');
     console.log('🎉 Successfully saved concept to target file.');
-  } catch (error: any) {
-    console.error(`❌ Error writing to database file: ${error.message}`);
-    process.exit(1);
-  }
+  } catch (error: any) {}
 
   // --- STEP 5: AUTOMATED SCHEMA AND LATEX INTEGRITY CHECK ---

[NoCoverage] StringLiteral
scripts/generateContent.ts:406:15
   }
 
   // --- STEP 5: AUTOMATED SCHEMA AND LATEX INTEGRITY CHECK ---
-  console.log('\n🔍 Running integrity checks...');
+  console.log("";
 
   // 1. Schema Check

[NoCoverage] StringLiteral
scripts/generateContent.ts:409:15
   console.log('\n🔍 Running integrity checks...');
 
   // 1. Schema Check
-  console.log('- Running schema validation check...');
+  console.log("");
   const schemaCheckResult = validateDraft(JSON.stringify(finalDraftObj));
   if (schemaCheckResult.success) {

[NoCoverage] BlockStatement
scripts/generateContent.ts:411:34
   // 1. Schema Check
   console.log('- Running schema validation check...');
   const schemaCheckResult = validateDraft(JSON.stringify(finalDraftObj));
-  if (schemaCheckResult.success) {
-    console.log('  ✅ Schema integrity check passed.');
-  } else {
+  if (schemaCheckResult.success) {} else {
     console.warn(`  ⚠️ Schema integrity check failed: ${schemaCheckResult.error}`);
   }

[NoCoverage] ConditionalExpression
scripts/generateContent.ts:411:7
   // 1. Schema Check
   console.log('- Running schema validation check...');
   const schemaCheckResult = validateDraft(JSON.stringify(finalDraftObj));
-  if (schemaCheckResult.success) {
+  if (true) {
     console.log('  ✅ Schema integrity check passed.');
   } else {

[NoCoverage] BlockStatement
scripts/generateContent.ts:413:10
   const schemaCheckResult = validateDraft(JSON.stringify(finalDraftObj));
   if (schemaCheckResult.success) {
     console.log('  ✅ Schema integrity check passed.');
-  } else {
-    console.warn(`  ⚠️ Schema integrity check failed: ${schemaCheckResult.error}`);
-  }
+  } else {}
 
   // 2. Run compile and validators via shell command if possible

[NoCoverage] StringLiteral
scripts/generateContent.ts:414:18
   if (schemaCheckResult.success) {
     console.log('  ✅ Schema integrity check passed.');
   } else {
-    console.warn(`  ⚠️ Schema integrity check failed: ${schemaCheckResult.error}`);
+    console.warn(``);
   }
 

[NoCoverage] BlockStatement
scripts/generateContent.ts:422:30
   // We will let the developer see these on completion.
 }
 
-runPipeline().catch((err) => {
-  console.error('Fatal pipeline error:', err);
-  process.exit(1);
-});
+runPipeline().catch((err) => {});
 
