[Killed] BlockStatement
scripts/healData.ts:11:57
 const DATA_DIR = path.resolve(__dirname, '../data/applied_anatomy');
 
 // 1. JSON Auto-Repair
-export function attemptJSONRepair(rawText: string): any {
-  try {
-    return JSON.parse(rawText);
-  } catch (e) {
-    let repaired = rawText.trim();
-    const tryParse = (text: string) => {
-      try {
-        return JSON.parse(text);
-      } catch {
-        return null;
-      }
-    };
-
-    let result = tryParse(repaired + '}');
-    if (result) return result;
-
-    result = tryParse(repaired + ']}');
-    if (result) return result;
-
-    result = tryParse(repaired + '"}');
-    if (result) return result;
-
-    throw e;
-  }
-}
+export function attemptJSONRepair(rawText: string): any {}
 
 // 2. KaTeX Repair
killedBy: healData - attemptJSONRepair should parse valid JSON successfully
statusReason: expected undefined to deeply equal { test: 123 }

[Killed] BlockStatement
scripts/healData.ts:12:7
 
 // 1. JSON Auto-Repair
 export function attemptJSONRepair(rawText: string): any {
-  try {
-    return JSON.parse(rawText);
-  } catch (e) {
+  try {} catch (e) {
     let repaired = rawText.trim();
     const tryParse = (text: string) => {
killedBy: healData - attemptJSONRepair should parse valid JSON successfully
statusReason: expected undefined to deeply equal { test: 123 }

[Killed] BlockStatement
scripts/healData.ts:14:15
 export function attemptJSONRepair(rawText: string): any {
   try {
     return JSON.parse(rawText);
-  } catch (e) {
-    let repaired = rawText.trim();
-    const tryParse = (text: string) => {
-      try {
-        return JSON.parse(text);
-      } catch {
-        return null;
-      }
-    };
-
-    let result = tryParse(repaired + '}');
-    if (result) return result;
-
-    result = tryParse(repaired + ']}');
-    if (result) return result;
-
-    result = tryParse(repaired + '"}');
-    if (result) return result;
-
-    throw e;
-  }
+  } catch (e) {}
 }
 
killedBy: healData - attemptJSONRepair should repair JSON with missing closing brace
statusReason: expected undefined to deeply equal { test: 123 }

[Survived] MethodExpression
scripts/healData.ts:15:20
   try {
     return JSON.parse(rawText);
   } catch (e) {
-    let repaired = rawText.trim();
+    let repaired = rawText;
     const tryParse = (text: string) => {
       try {

[Killed] BlockStatement
scripts/healData.ts:16:40
     return JSON.parse(rawText);
   } catch (e) {
     let repaired = rawText.trim();
-    const tryParse = (text: string) => {
-      try {
-        return JSON.parse(text);
-      } catch {
-        return null;
-      }
-    };
+    const tryParse = (text: string) => {};
 
     let result = tryParse(repaired + '}');
killedBy: healData - attemptJSONRepair should repair JSON with missing closing brace
statusReason: Expected ',' or '}' after property value in JSON at position 12 (line 1 column 13)

[Killed] BlockStatement
scripts/healData.ts:17:11
   } catch (e) {
     let repaired = rawText.trim();
     const tryParse = (text: string) => {
-      try {
-        return JSON.parse(text);
-      } catch {
+      try {} catch {
         return null;
       }
killedBy: healData - attemptJSONRepair should repair JSON with missing closing brace
statusReason: Expected ',' or '}' after property value in JSON at position 12 (line 1 column 13)

[Survived] BlockStatement
scripts/healData.ts:19:15
     const tryParse = (text: string) => {
       try {
         return JSON.parse(text);
-      } catch {
-        return null;
-      }
+      } catch {}
     };
 

[Killed] ConditionalExpression
scripts/healData.ts:25:9
     };
 
     let result = tryParse(repaired + '}');
-    if (result) return result;
+    if (true) return result;
 
     result = tryParse(repaired + ']}');
killedBy: healData - attemptJSONRepair should repair JSON with missing array closing brace
statusReason: expected null to deeply equal { test: [ 123 ] }

[Killed] ConditionalExpression
scripts/healData.ts:25:9
     };
 
     let result = tryParse(repaired + '}');
-    if (result) return result;
+    if (false) return result;
 
     result = tryParse(repaired + ']}');
killedBy: healData - attemptJSONRepair should repair JSON with missing closing brace
statusReason: Expected ',' or '}' after property value in JSON at position 12 (line 1 column 13)

[Killed] ConditionalExpression
scripts/healData.ts:28:9
     if (result) return result;
 
     result = tryParse(repaired + ']}');
-    if (result) return result;
+    if (true) return result;
 
     result = tryParse(repaired + '"}');
killedBy: healData - attemptJSONRepair should repair JSON with missing string quote and brace
statusReason: expected null to deeply equal { test: '123' }

[Killed] ConditionalExpression
scripts/healData.ts:28:9
     if (result) return result;
 
     result = tryParse(repaired + ']}');
-    if (result) return result;
+    if (false) return result;
 
     result = tryParse(repaired + '"}');
killedBy: healData - attemptJSONRepair should repair JSON with missing array closing brace
statusReason: Expected ',' or ']' after array element in JSON at position 13 (line 1 column 14)

[Killed] ConditionalExpression
scripts/healData.ts:31:9
     if (result) return result;
 
     result = tryParse(repaired + '"}');
-    if (result) return result;
+    if (false) return result;
 
     throw e;
killedBy: healData - attemptJSONRepair should repair JSON with missing string quote and brace
statusReason: Unterminated string in JSON at position 13 (line 1 column 14)

[Survived] ConditionalExpression
scripts/healData.ts:31:9
     if (result) return result;
 
     result = tryParse(repaired + '"}');
-    if (result) return result;
+    if (true) return result;
 
     throw e;

[Killed] ConditionalExpression
scripts/healData.ts:39:7
 
 // 2. KaTeX Repair
 export function repairKaTeX(str: string): string {
-  if (typeof str !== 'string') return str;
+  if (false) return str;
   let newStr = str;
 
killedBy: healData - repairKaTeX should handle non-string inputs gracefully
statusReason: newStr.replace is not a function

[Killed] EqualityOperator
scripts/healData.ts:39:7
 
 // 2. KaTeX Repair
 export function repairKaTeX(str: string): string {
-  if (typeof str !== 'string') return str;
+  if (typeof str === 'string') return str;
   let newStr = str;
 
killedBy: healData - repairKaTeX should escape bare percent signs
statusReason: expected '50% of people' to be '50\% of people' // Object.is equality

[Killed] ArrayDeclaration
scripts/healData.ts:47:20
 
   // Wrap common physiological acronyms in \text{} if they are not already wrapped.
   // We only do this loosely for known variables
-  const acronyms = [
-    'CPP',
-    'MAP',
-    'GFR',
-    'ICP',
-    'CVP',
-    'SVR',
-    'PVR',
-    'CO',
-    'HR',
-    'SV',
-    'PEEP',
-    'V_d',
-    'V_t',
-    'P_a',
-    'P_A',
-    'F_iO_2'
-  ];
+  const acronyms = [];
 
   for (const ac of acronyms) {
killedBy: healData - repairKaTeX should wrap common physiological acronyms in \text{}
statusReason: expected 'The MAP is 70' to be 'The \text{MAP} is 70' // Object.is equality

[Killed] StringLiteral
scripts/healData.ts:48:5
   // Wrap common physiological acronyms in \text{} if they are not already wrapped.
   // We only do this loosely for known variables
   const acronyms = [
-    'CPP',
+    "",
     'MAP',
     'GFR',
killedBy: healData - repairKaTeX should escape bare percent signs
statusReason: expected '\text{}50\text{}\% \text{}of\text{} \…' to be '50\% of people' // Object.is equality

[Killed] StringLiteral
scripts/healData.ts:49:5
   // We only do this loosely for known variables
   const acronyms = [
     'CPP',
-    'MAP',
+    "",
     'GFR',
     'ICP',
killedBy: healData - repairKaTeX should escape bare percent signs
statusReason: expected '\text{}50\text{}\% \text{}of\text{} \…' to be '50\% of people' // Object.is equality

[Killed] StringLiteral
scripts/healData.ts:58:5
     'CO',
     'HR',
     'SV',
-    'PEEP',
+    "",
     'V_d',
     'V_t',
killedBy: healData - repairKaTeX should escape bare percent signs
statusReason: expected '\text{}50\text{}\% \text{}of\text{} \…' to be '50\% of people' // Object.is equality

[Killed] StringLiteral
scripts/healData.ts:60:5
     'SV',
     'PEEP',
     'V_d',
-    'V_t',
+    "",
     'P_a',
     'P_A',
killedBy: healData - repairKaTeX should escape bare percent signs
statusReason: expected '\text{}50\text{}\% \text{}of\text{} \…' to be '50\% of people' // Object.is equality

[Killed] BlockStatement
scripts/healData.ts:66:30
     'F_iO_2'
   ];
 
-  for (const ac of acronyms) {
-    // In memory string has a single backslash for \text{
-    const regex = new RegExp(`(?<!\\\\text\\{)\\b${ac}\\b(?!\\})`, 'g');
-    newStr = newStr.replace(regex, `\\text{${ac}}`);
-  }
+  for (const ac of acronyms) {}
 
   return newStr;
killedBy: healData - repairKaTeX should wrap common physiological acronyms in \text{}
statusReason: expected 'The MAP is 70' to be 'The \text{MAP} is 70' // Object.is equality

[Killed] BlockStatement
scripts/healData.ts:75:52
   return newStr;
 }
 
-export function deeplyRepairStrings(obj: any): any {
-  if (typeof obj === 'string') {
-    return repairKaTeX(obj);
-  } else if (Array.isArray(obj)) {
-    return obj.map((item) => deeplyRepairStrings(item));
-  } else if (obj !== null && typeof obj === 'object') {
-    const newObj: any = {};
-    for (const [key, val] of Object.entries(obj)) {
-      newObj[key] = deeplyRepairStrings(val);
-    }
-    return newObj;
-  }
-  return obj;
-}
+export function deeplyRepairStrings(obj: any): any {}
 
 // 3. Main Healing Function
killedBy: healData - deeplyRepairStrings should recursively repair strings in objects and arrays
statusReason: expected undefined to deeply equal { …(2) }

[Killed] BlockStatement
scripts/healData.ts:76:32
 }
 
 export function deeplyRepairStrings(obj: any): any {
-  if (typeof obj === 'string') {
-    return repairKaTeX(obj);
-  } else if (Array.isArray(obj)) {
+  if (typeof obj === 'string') {} else if (Array.isArray(obj)) {
     return obj.map((item) => deeplyRepairStrings(item));
   } else if (obj !== null && typeof obj === 'object') {
killedBy: healData - deeplyRepairStrings should recursively repair strings in objects and arrays
statusReason: expected { description: 'MAP is 50%', …(1) } to deeply equal { …(2) }

[Killed] EqualityOperator
scripts/healData.ts:76:7
 }
 
 export function deeplyRepairStrings(obj: any): any {
-  if (typeof obj === 'string') {
+  if (typeof obj !== 'string') {
     return repairKaTeX(obj);
   } else if (Array.isArray(obj)) {
killedBy: healData - deeplyRepairStrings should recursively repair strings in objects and arrays
statusReason: expected { description: 'MAP is 50%', …(1) } to deeply equal { …(2) }

[Killed] ConditionalExpression
scripts/healData.ts:78:14
 export function deeplyRepairStrings(obj: any): any {
   if (typeof obj === 'string') {
     return repairKaTeX(obj);
-  } else if (Array.isArray(obj)) {
+  } else if (true) {
     return obj.map((item) => deeplyRepairStrings(item));
   } else if (obj !== null && typeof obj === 'object') {
killedBy: healData - deeplyRepairStrings should recursively repair strings in objects and arrays
statusReason: obj.map is not a function

[Killed] ConditionalExpression
scripts/healData.ts:78:14
 export function deeplyRepairStrings(obj: any): any {
   if (typeof obj === 'string') {
     return repairKaTeX(obj);
-  } else if (Array.isArray(obj)) {
+  } else if (false) {
     return obj.map((item) => deeplyRepairStrings(item));
   } else if (obj !== null && typeof obj === 'object') {
killedBy: healData - deeplyRepairStrings should recursively repair strings in objects and arrays
statusReason: expected { …(2) } to deeply equal { …(2) }

[Killed] ArrowFunction
scripts/healData.ts:79:20
   if (typeof obj === 'string') {
     return repairKaTeX(obj);
   } else if (Array.isArray(obj)) {
-    return obj.map((item) => deeplyRepairStrings(item));
+    return obj.map(() => undefined);
   } else if (obj !== null && typeof obj === 'object') {
     const newObj: any = {};
killedBy: healData - deeplyRepairStrings should recursively repair strings in objects and arrays
statusReason: expected { …(2) } to deeply equal { …(2) }

[Killed] BlockStatement
scripts/healData.ts:80:55
     return repairKaTeX(obj);
   } else if (Array.isArray(obj)) {
     return obj.map((item) => deeplyRepairStrings(item));
-  } else if (obj !== null && typeof obj === 'object') {
-    const newObj: any = {};
-    for (const [key, val] of Object.entries(obj)) {
-      newObj[key] = deeplyRepairStrings(val);
-    }
-    return newObj;
-  }
+  } else if (obj !== null && typeof obj === 'object') {}
   return obj;
 }
killedBy: healData - deeplyRepairStrings should recursively repair strings in objects and arrays
statusReason: expected { description: 'MAP is 50%', …(1) } to deeply equal { …(2) }

[Killed] EqualityOperator
scripts/healData.ts:80:14
     return repairKaTeX(obj);
   } else if (Array.isArray(obj)) {
     return obj.map((item) => deeplyRepairStrings(item));
-  } else if (obj !== null && typeof obj === 'object') {
+  } else if (obj === null && typeof obj === 'object') {
     const newObj: any = {};
     for (const [key, val] of Object.entries(obj)) {
killedBy: healData - deeplyRepairStrings should recursively repair strings in objects and arrays
statusReason: expected { description: 'MAP is 50%', …(1) } to deeply equal { …(2) }

[Killed] BlockStatement
scripts/healData.ts:82:51
     return obj.map((item) => deeplyRepairStrings(item));
   } else if (obj !== null && typeof obj === 'object') {
     const newObj: any = {};
-    for (const [key, val] of Object.entries(obj)) {
-      newObj[key] = deeplyRepairStrings(val);
-    }
+    for (const [key, val] of Object.entries(obj)) {}
     return newObj;
   }
killedBy: healData - deeplyRepairStrings should recursively repair strings in objects and arrays
statusReason: expected {} to deeply equal { …(2) }

[NoCoverage] BlockStatement
scripts/healData.ts:93:34
 // 3. Main Healing Function
 export function healData(targetDir: string = DATA_DIR) {
   console.log(`Starting Data Healing process in ${targetDir}...`);
-  if (!fs.existsSync(targetDir)) {
-    console.error(`Error: Directory does not exist: ${targetDir}`);
-    process.exit(1);
-  }
+  if (!fs.existsSync(targetDir)) {}
 
   const files = fs.readdirSync(targetDir).filter((file) => file.endsWith('.json'));

[NoCoverage] ConditionalExpression
scripts/healData.ts:93:7
 // 3. Main Healing Function
 export function healData(targetDir: string = DATA_DIR) {
   console.log(`Starting Data Healing process in ${targetDir}...`);
-  if (!fs.existsSync(targetDir)) {
+  if (true) {
     console.error(`Error: Directory does not exist: ${targetDir}`);
     process.exit(1);

[NoCoverage] ArrowFunction
scripts/healData.ts:98:50
     process.exit(1);
   }
 
-  const files = fs.readdirSync(targetDir).filter((file) => file.endsWith('.json'));
+  const files = fs.readdirSync(targetDir).filter(() => undefined);
   let healedCount = 0;
   let failedCount = 0;

[NoCoverage] MethodExpression
scripts/healData.ts:98:60
     process.exit(1);
   }
 
-  const files = fs.readdirSync(targetDir).filter((file) => file.endsWith('.json'));
+  const files = fs.readdirSync(targetDir).filter((file) => file.startsWith('.json'));
   let healedCount = 0;
   let failedCount = 0;

[NoCoverage] StringLiteral
scripts/healData.ts:104:50
 
   files.forEach((file) => {
     const filePath = path.join(targetDir, file);
-    const rawContent = fs.readFileSync(filePath, 'utf-8');
+    const rawContent = fs.readFileSync(filePath, "");
 
     let jsonData;

[NoCoverage] BlockStatement
scripts/healData.ts:107:9
     const rawContent = fs.readFileSync(filePath, 'utf-8');
 
     let jsonData;
-    try {
-      jsonData = attemptJSONRepair(rawContent);
-    } catch (e: any) {
+    try {} catch (e: any) {
       console.error(`❌ [FATAL] Could not parse or repair JSON for ${file}: ${e.message}`);
       failedCount++;

[NoCoverage] BlockStatement
scripts/healData.ts:109:22
     let jsonData;
     try {
       jsonData = attemptJSONRepair(rawContent);
-    } catch (e: any) {
-      console.error(`❌ [FATAL] Could not parse or repair JSON for ${file}: ${e.message}`);
-      failedCount++;
-      return;
-    }
+    } catch (e: any) {}
 
     let repairedData = deeplyRepairStrings(jsonData);

[NoCoverage] StringLiteral
scripts/healData.ts:110:21
     try {
       jsonData = attemptJSONRepair(rawContent);
     } catch (e: any) {
-      console.error(`❌ [FATAL] Could not parse or repair JSON for ${file}: ${e.message}`);
+      console.error(``);
       failedCount++;
       return;

[NoCoverage] UpdateOperator
scripts/healData.ts:111:7
       jsonData = attemptJSONRepair(rawContent);
     } catch (e: any) {
       console.error(`❌ [FATAL] Could not parse or repair JSON for ${file}: ${e.message}`);
-      failedCount++;
+      failedCount--;
       return;
     }

[NoCoverage] ConditionalExpression
scripts/healData.ts:118:9
     let repairedData = deeplyRepairStrings(jsonData);
 
     const validationResult = AppliedAnatomyModuleSchema.safeParse(repairedData);
-    if (!validationResult.success) {
+    if (true) {
       console.warn(
         `⚠️ [WARN] Schema validation failed for ${file}. Attempting to inject fallbacks...`

[NoCoverage] ConditionalExpression
scripts/healData.ts:118:9
     let repairedData = deeplyRepairStrings(jsonData);
 
     const validationResult = AppliedAnatomyModuleSchema.safeParse(repairedData);
-    if (!validationResult.success) {
+    if (false) {
       console.warn(
         `⚠️ [WARN] Schema validation failed for ${file}. Attempting to inject fallbacks...`

[NoCoverage] BooleanLiteral
scripts/healData.ts:122:11
       console.warn(
         `⚠️ [WARN] Schema validation failed for ${file}. Attempting to inject fallbacks...`
       );
-      if (!repairedData.moduleId) repairedData.moduleId = file.replace('.json', '');
+      if (repairedData.moduleId) repairedData.moduleId = file.replace('.json', '');
       if (!repairedData.moduleTitle)
         repairedData.moduleTitle = file.replace(/_|-/g, ' ').replace('.json', '');

[NoCoverage] ConditionalExpression
scripts/healData.ts:122:11
       console.warn(
         `⚠️ [WARN] Schema validation failed for ${file}. Attempting to inject fallbacks...`
       );
-      if (!repairedData.moduleId) repairedData.moduleId = file.replace('.json', '');
+      if (true) repairedData.moduleId = file.replace('.json', '');
       if (!repairedData.moduleTitle)
         repairedData.moduleTitle = file.replace(/_|-/g, ' ').replace('.json', '');

[NoCoverage] ConditionalExpression
scripts/healData.ts:123:11
         `⚠️ [WARN] Schema validation failed for ${file}. Attempting to inject fallbacks...`
       );
       if (!repairedData.moduleId) repairedData.moduleId = file.replace('.json', '');
-      if (!repairedData.moduleTitle)
+      if (true)
         repairedData.moduleTitle = file.replace(/_|-/g, ' ').replace('.json', '');
       if (!repairedData.tags) repairedData.tags = [];

[NoCoverage] ConditionalExpression
scripts/healData.ts:123:11
         `⚠️ [WARN] Schema validation failed for ${file}. Attempting to inject fallbacks...`
       );
       if (!repairedData.moduleId) repairedData.moduleId = file.replace('.json', '');
-      if (!repairedData.moduleTitle)
+      if (false)
         repairedData.moduleTitle = file.replace(/_|-/g, ' ').replace('.json', '');
       if (!repairedData.tags) repairedData.tags = [];

[NoCoverage] StringLiteral
scripts/healData.ts:124:79
       );
       if (!repairedData.moduleId) repairedData.moduleId = file.replace('.json', '');
       if (!repairedData.moduleTitle)
-        repairedData.moduleTitle = file.replace(/_|-/g, ' ').replace('.json', '');
+        repairedData.moduleTitle = file.replace(/_|-/g, ' ').replace('.json', "Stryker was here!");
       if (!repairedData.tags) repairedData.tags = [];
 

[NoCoverage] StringLiteral
scripts/healData.ts:124:57
       );
       if (!repairedData.moduleId) repairedData.moduleId = file.replace('.json', '');
       if (!repairedData.moduleTitle)
-        repairedData.moduleTitle = file.replace(/_|-/g, ' ').replace('.json', '');
+        repairedData.moduleTitle = file.replace(/_|-/g, "").replace('.json', '');
       if (!repairedData.tags) repairedData.tags = [];
 

[NoCoverage] ConditionalExpression
scripts/healData.ts:125:11
       if (!repairedData.moduleId) repairedData.moduleId = file.replace('.json', '');
       if (!repairedData.moduleTitle)
         repairedData.moduleTitle = file.replace(/_|-/g, ' ').replace('.json', '');
-      if (!repairedData.tags) repairedData.tags = [];
+      if (false) repairedData.tags = [];
 
       const retryValidation = AppliedAnatomyModuleSchema.safeParse(repairedData);

[NoCoverage] ConditionalExpression
scripts/healData.ts:125:11
       if (!repairedData.moduleId) repairedData.moduleId = file.replace('.json', '');
       if (!repairedData.moduleTitle)
         repairedData.moduleTitle = file.replace(/_|-/g, ' ').replace('.json', '');
-      if (!repairedData.tags) repairedData.tags = [];
+      if (true) repairedData.tags = [];
 
       const retryValidation = AppliedAnatomyModuleSchema.safeParse(repairedData);

[NoCoverage] BooleanLiteral
scripts/healData.ts:128:11
       if (!repairedData.tags) repairedData.tags = [];
 
       const retryValidation = AppliedAnatomyModuleSchema.safeParse(repairedData);
-      if (!retryValidation.success) {
+      if (retryValidation.success) {
         console.error(`❌ [ERROR] Could not heal schema errors for ${file}:`);
         console.error(JSON.stringify(retryValidation.error.format(), null, 2));

[NoCoverage] ConditionalExpression
scripts/healData.ts:128:11
       if (!repairedData.tags) repairedData.tags = [];
 
       const retryValidation = AppliedAnatomyModuleSchema.safeParse(repairedData);
-      if (!retryValidation.success) {
+      if (false) {
         console.error(`❌ [ERROR] Could not heal schema errors for ${file}:`);
         console.error(JSON.stringify(retryValidation.error.format(), null, 2));

[NoCoverage] UpdateOperator
scripts/healData.ts:131:9
       if (!retryValidation.success) {
         console.error(`❌ [ERROR] Could not heal schema errors for ${file}:`);
         console.error(JSON.stringify(retryValidation.error.format(), null, 2));
-        failedCount++;
+        failedCount--;
         return;
       } else {

[NoCoverage] BlockStatement
scripts/healData.ts:133:14
         console.error(JSON.stringify(retryValidation.error.format(), null, 2));
         failedCount++;
         return;
-      } else {
-        repairedData = retryValidation.data;
-      }
+      } else {}
     } else {
       repairedData = validationResult.data;

[NoCoverage] BlockStatement
scripts/healData.ts:136:12
       } else {
         repairedData = retryValidation.data;
       }
-    } else {
-      repairedData = validationResult.data;
-    }
+    } else {}
 
     const newContent = JSON.stringify(repairedData, null, 2) + '\n';

[NoCoverage] ConditionalExpression
scripts/healData.ts:141:38
     }
 
     const newContent = JSON.stringify(repairedData, null, 2) + '\n';
-    if (newContent !== rawContent && newContent.trim() !== rawContent.trim()) {
+    if (newContent !== rawContent && true) {
       fs.writeFileSync(filePath, newContent, 'utf-8');
       console.log(`🩹 [HEALED] ${file}`);

[NoCoverage] LogicalOperator
scripts/healData.ts:141:9
     }
 
     const newContent = JSON.stringify(repairedData, null, 2) + '\n';
-    if (newContent !== rawContent && newContent.trim() !== rawContent.trim()) {
+    if (newContent !== rawContent || newContent.trim() !== rawContent.trim()) {
       fs.writeFileSync(filePath, newContent, 'utf-8');
       console.log(`🩹 [HEALED] ${file}`);

[NoCoverage] StringLiteral
scripts/healData.ts:143:19
     const newContent = JSON.stringify(repairedData, null, 2) + '\n';
     if (newContent !== rawContent && newContent.trim() !== rawContent.trim()) {
       fs.writeFileSync(filePath, newContent, 'utf-8');
-      console.log(`🩹 [HEALED] ${file}`);
+      console.log(``;
       healedCount++;
     }

[NoCoverage] UpdateOperator
scripts/healData.ts:144:7
     if (newContent !== rawContent && newContent.trim() !== rawContent.trim()) {
       fs.writeFileSync(filePath, newContent, 'utf-8');
       console.log(`🩹 [HEALED] ${file}`);
-      healedCount++;
+      healedCount--;
     }
   });

[NoCoverage] StringLiteral
scripts/healData.ts:149:5
   });
 
   console.log(
-    `\nHealing complete. Healed ${healedCount} file(s). Failed to heal ${failedCount} file(s).`
+    ``
   );
   if (failedCount > 0) {

[NoCoverage] EqualityOperator
scripts/healData.ts:151:7
   console.log(
     `\nHealing complete. Healed ${healedCount} file(s). Failed to heal ${failedCount} file(s).`
   );
-  if (failedCount > 0) {
+  if (failedCount >= 0) {
     process.exit(1);
   } else {

[NoCoverage] BlockStatement
scripts/healData.ts:151:24
   console.log(
     `\nHealing complete. Healed ${healedCount} file(s). Failed to heal ${failedCount} file(s).`
   );
-  if (failedCount > 0) {
-    process.exit(1);
-  } else {
+  if (failedCount > 0) {} else {
     process.exit(0);
   }

[NoCoverage] BlockStatement
scripts/healData.ts:153:10
   );
   if (failedCount > 0) {
     process.exit(1);
-  } else {
-    process.exit(0);
-  }
+  } else {}
 }
 

[Survived] ConditionalExpression
scripts/healData.ts:158:5
   }
 }
 
-if (process.argv[1] === __filename) {
+if (true) {
   healData();
 }

[NoCoverage] BlockStatement
scripts/healData.ts:158:37
   }
 }
 
-if (process.argv[1] === __filename) {
-  healData();
-}
+if (process.argv[1] === __filename) {}
 
