[Survived] StringLiteral
store/useAppStore.ts:10:16
   accentColor: '#f43f5e', // rose-500
   borderRadius: '2xl',
   fontSans: 'Inter',
-  glassEffect: 'medium'
+  glassEffect: ""
 };
 

[Killed] ArrowFunction
store/useAppStore.ts:54:13
 export const useAppStore = create<AppState>((set) => ({
   // Defaults
   theme: DEFAULT_THEME,
-  setTheme: (theme) => set({ theme }),
+  setTheme: () => undefined,
   isEditMode: false,
   setIsEditMode: (mode) => set((state) => ({ isEditMode: typeof mode === 'function' ? mode(state.isEditMode) : mode })),
killedBy: useAppStore should update theme correctly
statusReason: expected '#3b82f6' to be '#000000' // Object.is equality

[Survived] BooleanLiteral
store/useAppStore.ts:55:15
   // Defaults
   theme: DEFAULT_THEME,
   setTheme: (theme) => set({ theme }),
-  isEditMode: false,
+  isEditMode: true,
   setIsEditMode: (mode) => set((state) => ({ isEditMode: typeof mode === 'function' ? mode(state.isEditMode) : mode })),
   isDevMode: false,

[Killed] ConditionalExpression
store/useAppStore.ts:56:58
   theme: DEFAULT_THEME,
   setTheme: (theme) => set({ theme }),
   isEditMode: false,
-  setIsEditMode: (mode) => set((state) => ({ isEditMode: typeof mode === 'function' ? mode(state.isEditMode) : mode })),
+  setIsEditMode: (mode) => set((state) => ({ isEditMode: true ? mode(state.isEditMode) : mode })),
   isDevMode: false,
   setIsDevMode: (mode) => set((state) => ({ isDevMode: typeof mode === 'function' ? mode(state.isDevMode) : mode })),
killedBy: useAppStore should toggle edit mode
statusReason: mode is not a function

[Killed] ConditionalExpression
store/useAppStore.ts:56:58
   theme: DEFAULT_THEME,
   setTheme: (theme) => set({ theme }),
   isEditMode: false,
-  setIsEditMode: (mode) => set((state) => ({ isEditMode: typeof mode === 'function' ? mode(state.isEditMode) : mode })),
+  setIsEditMode: (mode) => set((state) => ({ isEditMode: false ? mode(state.isEditMode) : mode })),
   isDevMode: false,
   setIsDevMode: (mode) => set((state) => ({ isDevMode: typeof mode === 'function' ? mode(state.isDevMode) : mode })),
killedBy: useAppStore should toggle edit mode
statusReason: expected [Function] to be false // Object.is equality

[Survived] BooleanLiteral
store/useAppStore.ts:57:14
   setTheme: (theme) => set({ theme }),
   isEditMode: false,
   setIsEditMode: (mode) => set((state) => ({ isEditMode: typeof mode === 'function' ? mode(state.isEditMode) : mode })),
-  isDevMode: false,
+  isDevMode: true,
   setIsDevMode: (mode) => set((state) => ({ isDevMode: typeof mode === 'function' ? mode(state.isDevMode) : mode })),
   isSidebarCollapsed: false,

[NoCoverage] EqualityOperator
store/useAppStore.ts:58:56
   isEditMode: false,
   setIsEditMode: (mode) => set((state) => ({ isEditMode: typeof mode === 'function' ? mode(state.isEditMode) : mode })),
   isDevMode: false,
-  setIsDevMode: (mode) => set((state) => ({ isDevMode: typeof mode === 'function' ? mode(state.isDevMode) : mode })),
+  setIsDevMode: (mode) => set((state) => ({ isDevMode: typeof mode !== 'function' ? mode(state.isDevMode) : mode })),
   isSidebarCollapsed: false,
   setIsSidebarCollapsed: (collapsed) => set((state) => ({ isSidebarCollapsed: typeof collapsed === 'function' ? collapsed(state.isSidebarCollapsed) : collapsed })),

[Survived] ArrowFunction
store/useAppStore.ts:58:17
   isEditMode: false,
   setIsEditMode: (mode) => set((state) => ({ isEditMode: typeof mode === 'function' ? mode(state.isEditMode) : mode })),
   isDevMode: false,
-  setIsDevMode: (mode) => set((state) => ({ isDevMode: typeof mode === 'function' ? mode(state.isDevMode) : mode })),
+  setIsDevMode: () => undefined,
   isSidebarCollapsed: false,
   setIsSidebarCollapsed: (collapsed) => set((state) => ({ isSidebarCollapsed: typeof collapsed === 'function' ? collapsed(state.isSidebarCollapsed) : collapsed })),

[Survived] BooleanLiteral
store/useAppStore.ts:59:23
   setIsEditMode: (mode) => set((state) => ({ isEditMode: typeof mode === 'function' ? mode(state.isEditMode) : mode })),
   isDevMode: false,
   setIsDevMode: (mode) => set((state) => ({ isDevMode: typeof mode === 'function' ? mode(state.isDevMode) : mode })),
-  isSidebarCollapsed: false,
+  isSidebarCollapsed: true,
   setIsSidebarCollapsed: (collapsed) => set((state) => ({ isSidebarCollapsed: typeof collapsed === 'function' ? collapsed(state.isSidebarCollapsed) : collapsed })),
   studyProgress: [],

[NoCoverage] ArrowFunction
store/useAppStore.ts:60:45
   isDevMode: false,
   setIsDevMode: (mode) => set((state) => ({ isDevMode: typeof mode === 'function' ? mode(state.isDevMode) : mode })),
   isSidebarCollapsed: false,
-  setIsSidebarCollapsed: (collapsed) => set((state) => ({ isSidebarCollapsed: typeof collapsed === 'function' ? collapsed(state.isSidebarCollapsed) : collapsed })),
+  setIsSidebarCollapsed: (collapsed) => set(() => undefined),
   studyProgress: [],
   setStudyProgress: (studyProgress) => set({ studyProgress }),

[NoCoverage] ConditionalExpression
store/useAppStore.ts:60:79
   isDevMode: false,
   setIsDevMode: (mode) => set((state) => ({ isDevMode: typeof mode === 'function' ? mode(state.isDevMode) : mode })),
   isSidebarCollapsed: false,
-  setIsSidebarCollapsed: (collapsed) => set((state) => ({ isSidebarCollapsed: typeof collapsed === 'function' ? collapsed(state.isSidebarCollapsed) : collapsed })),
+  setIsSidebarCollapsed: (collapsed) => set((state) => ({ isSidebarCollapsed: false ? collapsed(state.isSidebarCollapsed) : collapsed })),
   studyProgress: [],
   setStudyProgress: (studyProgress) => set({ studyProgress }),

[Survived] ArrayDeclaration
store/useAppStore.ts:61:18
   setIsDevMode: (mode) => set((state) => ({ isDevMode: typeof mode === 'function' ? mode(state.isDevMode) : mode })),
   isSidebarCollapsed: false,
   setIsSidebarCollapsed: (collapsed) => set((state) => ({ isSidebarCollapsed: typeof collapsed === 'function' ? collapsed(state.isSidebarCollapsed) : collapsed })),
-  studyProgress: [],
+  studyProgress: ["Stryker was here"],
   setStudyProgress: (studyProgress) => set({ studyProgress }),
 

[Killed] ArrowFunction
store/useAppStore.ts:62:21
   isSidebarCollapsed: false,
   setIsSidebarCollapsed: (collapsed) => set((state) => ({ isSidebarCollapsed: typeof collapsed === 'function' ? collapsed(state.isSidebarCollapsed) : collapsed })),
   studyProgress: [],
-  setStudyProgress: (studyProgress) => set({ studyProgress }),
+  setStudyProgress: () => undefined,
 
   searchQuery: '',
killedBy: useAppStore should correctly store study progress
statusReason: expected undefined to be defined

[Survived] StringLiteral
store/useAppStore.ts:64:16
   studyProgress: [],
   setStudyProgress: (studyProgress) => set({ studyProgress }),
 
-  searchQuery: '',
+  searchQuery: "Stryker was here!",
   setSearchQuery: (searchQuery) => set({ searchQuery }),
   investigationSearchQuery: '',

[Survived] ArrowFunction
store/useAppStore.ts:65:19
   setStudyProgress: (studyProgress) => set({ studyProgress }),
 
   searchQuery: '',
-  setSearchQuery: (searchQuery) => set({ searchQuery }),
+  setSearchQuery: () => undefined,
   investigationSearchQuery: '',
   setInvestigationSearchQuery: (investigationSearchQuery) => set({ investigationSearchQuery }),

[Survived] StringLiteral
store/useAppStore.ts:66:29
 
   searchQuery: '',
   setSearchQuery: (searchQuery) => set({ searchQuery }),
-  investigationSearchQuery: '',
+  investigationSearchQuery: "Stryker was here!",
   setInvestigationSearchQuery: (investigationSearchQuery) => set({ investigationSearchQuery }),
   glossaryTerm: undefined,

[Survived] ArrowFunction
store/useAppStore.ts:67:32
   searchQuery: '',
   setSearchQuery: (searchQuery) => set({ searchQuery }),
   investigationSearchQuery: '',
-  setInvestigationSearchQuery: (investigationSearchQuery) => set({ investigationSearchQuery }),
+  setInvestigationSearchQuery: () => undefined,
   glossaryTerm: undefined,
   setGlossaryTerm: (glossaryTerm) => set({ glossaryTerm }),

[Survived] ArrowFunction
store/useAppStore.ts:69:20
   investigationSearchQuery: '',
   setInvestigationSearchQuery: (investigationSearchQuery) => set({ investigationSearchQuery }),
   glossaryTerm: undefined,
-  setGlossaryTerm: (glossaryTerm) => set({ glossaryTerm }),
+  setGlossaryTerm: () => undefined,
 
   selectedSystem: null,

[Survived] ArrowFunction
store/useAppStore.ts:72:22
   setGlossaryTerm: (glossaryTerm) => set({ glossaryTerm }),
 
   selectedSystem: null,
-  setSelectedSystem: (selectedSystem) => set({ selectedSystem }),
+  setSelectedSystem: () => undefined,
   selectedExam: null,
   setSelectedExam: (selectedExam) => set({ selectedExam }),

[NoCoverage] ObjectLiteral
store/useAppStore.ts:72:46
   setGlossaryTerm: (glossaryTerm) => set({ glossaryTerm }),
 
   selectedSystem: null,
-  setSelectedSystem: (selectedSystem) => set({ selectedSystem }),
+  setSelectedSystem: (selectedSystem) => set({}),
   selectedExam: null,
   setSelectedExam: (selectedExam) => set({ selectedExam }),

[Survived] ArrowFunction
store/useAppStore.ts:74:20
   selectedSystem: null,
   setSelectedSystem: (selectedSystem) => set({ selectedSystem }),
   selectedExam: null,
-  setSelectedExam: (selectedExam) => set({ selectedExam }),
+  setSelectedExam: () => undefined,
   expandedSystems: new Set([ExamSystem.CARDIOVASCULAR]),
   setExpandedSystems: (systems) => set((state) => ({ expandedSystems: typeof systems === 'function' ? systems(state.expandedSystems) : systems })),

[NoCoverage] ObjectLiteral
store/useAppStore.ts:74:42
   selectedSystem: null,
   setSelectedSystem: (selectedSystem) => set({ selectedSystem }),
   selectedExam: null,
-  setSelectedExam: (selectedExam) => set({ selectedExam }),
+  setSelectedExam: (selectedExam) => set({}),
   expandedSystems: new Set([ExamSystem.CARDIOVASCULAR]),
   setExpandedSystems: (systems) => set((state) => ({ expandedSystems: typeof systems === 'function' ? systems(state.expandedSystems) : systems })),

[NoCoverage] ArrowFunction
store/useAppStore.ts:76:40
   selectedExam: null,
   setSelectedExam: (selectedExam) => set({ selectedExam }),
   expandedSystems: new Set([ExamSystem.CARDIOVASCULAR]),
-  setExpandedSystems: (systems) => set((state) => ({ expandedSystems: typeof systems === 'function' ? systems(state.expandedSystems) : systems })),
+  setExpandedSystems: (systems) => set(() => undefined),
 
   downloadedIds: new Set(),

[NoCoverage] EqualityOperator
store/useAppStore.ts:76:71
   selectedExam: null,
   setSelectedExam: (selectedExam) => set({ selectedExam }),
   expandedSystems: new Set([ExamSystem.CARDIOVASCULAR]),
-  setExpandedSystems: (systems) => set((state) => ({ expandedSystems: typeof systems === 'function' ? systems(state.expandedSystems) : systems })),
+  setExpandedSystems: (systems) => set((state) => ({ expandedSystems: typeof systems !== 'function' ? systems(state.expandedSystems) : systems })),
 
   downloadedIds: new Set(),

[Survived] ArrowFunction
store/useAppStore.ts:79:21
   setExpandedSystems: (systems) => set((state) => ({ expandedSystems: typeof systems === 'function' ? systems(state.expandedSystems) : systems })),
 
   downloadedIds: new Set(),
-  setDownloadedIds: (downloadedIds) => set({ downloadedIds }),
+  setDownloadedIds: () => undefined,
   syncingIds: new Set(),
   setSyncingIds: (syncingIds) => set({ syncingIds }),

[Survived] ArrowFunction
store/useAppStore.ts:81:18
   downloadedIds: new Set(),
   setDownloadedIds: (downloadedIds) => set({ downloadedIds }),
   syncingIds: new Set(),
-  setSyncingIds: (syncingIds) => set({ syncingIds }),
+  setSyncingIds: () => undefined,
   downloadedExams: [],
   setDownloadedExams: (downloadedExams) => set({ downloadedExams }),

[Survived] ArrayDeclaration
store/useAppStore.ts:82:20
   setDownloadedIds: (downloadedIds) => set({ downloadedIds }),
   syncingIds: new Set(),
   setSyncingIds: (syncingIds) => set({ syncingIds }),
-  downloadedExams: [],
+  downloadedExams: ["Stryker was here"],
   setDownloadedExams: (downloadedExams) => set({ downloadedExams }),
 }));

[Survived] ArrowFunction
store/useAppStore.ts:83:23
   syncingIds: new Set(),
   setSyncingIds: (syncingIds) => set({ syncingIds }),
   downloadedExams: [],
-  setDownloadedExams: (downloadedExams) => set({ downloadedExams }),
+  setDownloadedExams: () => undefined,
 }));
 

[NoCoverage] ObjectLiteral
store/useAppStore.ts:83:48
   syncingIds: new Set(),
   setSyncingIds: (syncingIds) => set({ syncingIds }),
   downloadedExams: [],
-  setDownloadedExams: (downloadedExams) => set({ downloadedExams }),
+  setDownloadedExams: (downloadedExams) => set({}),
 }));
 
